Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/quickstart/index.po
Languages: de, it, ja, pt_br, zh_tw

source: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ is an open sandbox allowing developers to quickly and easily get devices connected to the Watson IoT platform with registration required. Any device that can run an MQTT client can be connected to Quickstart within mimimum fuss, `DeveloperWorks Recipes <https://developer.ibm.com/recipes>`_ features dozens of community produced tutorials for connecting different devices to the service, including but not limited to:
de: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ ist eine offene Sandbox, mit deren Unterstützung Entwickler schnell und einfach Geräte mit Watson IoT Platform verbinden können, für die eine Registrierung erforderlich ist. Jedes Gerät, das einen MQTT-Client ausführen kann, kann mit minimalem Aufwand mit Quickstart verbunden werden. In `DeveloperWorks Recipes <https://developer.ibm.com/recipes>`_ finden Sie zahlreiche, von der Community erstellte Anleitungen zum Verbinden verschiedener Geräte mit dem Service, einschließlich der folgenden:
it: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ è una sandbox aperta che consente agli sviluppatori di connettere rapidamente e facilmente i dispositivi a Watson IoT platform con la registrazione richiesta. Un dispositivo che può eseguire un client MQTT può essere connesso a Quickstart senza difficoltà, `Le istruzioni DeveloperWorks <https://developer.ibm.com/recipes>`_ comprendono una dozzina di esercitazioni prodotte dalla comunità per connettere differenti dispositivi al servizio, ivi compresi a titolo esemplificativo, ma non esaustivo:
ja: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ は、要登録のオープンなサンドボックスです。これを利用すると、開発者は素早く簡単にデバイスを Watson IoT Platform に接続できます。 MQTT クライアントを実行できるデバイスはすべて、簡単に Quickstart に接続できます。`DeveloperWorks Recipes <https://developer.ibm.com/recipes>`_ では、さまざまなデバイスをサービスに接続するために多数のコミュニティーで作成されたチュートリアルを特集しています。以下にその例を示します (これだけではありません)。
pt_br: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ é um ambiente de simulação aberto que permite aos desenvolvedores ter de maneira rápida e fácil dispositivos conectados à plataforma Watson IoT com registro requerido. Qualquer dispositivo que pode executar um cliente MQTT pode ser conectado ao Quickstart com o mínimo esforço, `Receitas do DeveloperWorks <https://developer.ibm.com/recipes>`_ dezenas de recursos de tutoriais produzidos pela comunidade para conexão de diferentes dispositivos ao serviço incluindo, mas não se limitando a:
zh_tw: `Quickstart <https://quickstart.internetofthings.ibmcloud.com>`_ 是開放式沙盤推演，可讓開發人員利用必要的登錄快速且輕鬆地取得連接至 Watson IoT Platform 的裝置。任何可以執行 MQTT 用戶端的裝置可以自在地連接至 Quickstart。`DeveloperWorks 秘訣 <https://developer.ibm.com/recipes>`_ 提供許多社群製作的指導教學，指導使用者將不同裝置連接至服務，包括但不限於：

source: `Reactive Blocks <https://developer.ibm.com/recipes/tutorials/reactive-blocks-and-java-to-iot-foundation-part-1-quickstart/>`_
it: `Riattiva blocchi <https://developer.ibm.com/recipes/tutorials/reactive-blocks-and-java-to-iot-foundation-part-1-quickstart/>`_
pt_br: `Bloqueios Reativos <https://developer.ibm.com/recipes/tutorials/reactive-blocks-and-java-to-iot-foundation-part-1-quickstart/>`_

source: Simulated Device
de: Simuliertes Gerät
it: Dispositivo simulato
ja: シミュレート・デバイス
pt_br: Dispositivo Simulado
zh_tw: 模擬裝置

source: In addition to these, we have developed a simple browser-based simulated device, designed for mobile devices, that can be used to connect any device with a web browser to the service. Open the following URL on a mobile phone or tablet in your favourite browser: http://quickstart.internetofthings.ibmcloud.com/iotsensor.
de: Zusätzlich wurde ein einfaches, browserbasiertes simuliertes Gerät entwickelt, mit dem jedes beliebige mobile Gerät, das über einen Web-Browser verfügt, mit dem Service verbunden werden kann. Öffnen Sie die folgende URL auf einem Mobiltelefon oder Tablet in einem Browser Ihrer Wahl: http://quickstart.internetofthings.ibmcloud.com/iotsensor.
it: Oltre questi, è stato sviluppato un semplice dispositivo simulato basato sul browser, progettato per i dispositivi mobili che può essere utilizzato per connettere un dispositivo con un browser web al servizio. Aprire il seguente URL su un telefono cellulare o tablet nel browser preferito: http://quickstart.internetofthings.ibmcloud.com/iotsensor.
ja: これらの他に、モバイル・デバイス用に設計したブラウザー・ベースのシンプルなシミュレート・デバイスも開発しました。これを使用して、Web ブラウザーを持つあらゆるデバイスをサービスに接続できます。 携帯電話またはタブレットで任意のブラウザーを使用して URL (http://quickstart.internetofthings.ibmcloud.com/iotsensor) を開いてください。
pt_br: Além desses, desenvolvemos um dispositivo simulado simples baseado em navegador, projetado para dispositivos móveis, que pode ser usado para conectar qualquer dispositivo com um navegador da web ao serviço. Abra a seguinte URL em um telefone celular ou tablet em seu navegador favorito: http://quickstart.internetofthings.ibmcloud.com/iotsensor.
zh_tw: 除了這些以外，我們已開發簡單的瀏覽器型模擬裝置（針對行動式裝置而設計），可以用來利用 Web 瀏覽器將任何裝置連接至服務。請在行動電話或平板電腦上以您喜愛的瀏覽器開啟下列 URL：http://quickstart.internetofthings.ibmcloud.com/iotsensor。

source: This will launch a browser-based simulated device connecting to the Watson IoT platform. There are three sensors which you can manipulate using the on-screen controls:
de: Startet ein browserbasiertes simuliertes Gerät zum Verbinden mit Watson IoT Platform. Die drei folgenden Sensoren können mit den angezeigten Steuerelementen bearbeitet werden:
it: Questo avvierà un dispositivo simulato basato su browser che connette a Watson IoT platform. Esistono tre sensori che è possibile manipolare utilizzando i controlli sullo schermo:
ja: ブラウザー・ベースのシミュレート・デバイスが起動し、Watson IoT Platform に接続します。画面上のコントロールを使用して、以下の 3 つのセンサーを操作できます。
pt_br: Isto ativará um dispositivo simulado baseado em navegador conectando-se à plataforma Watson IoT. Há três sensores que podem ser manipulados usando os controles na tela:
zh_tw: 這將啟動連接至 Watson IoT Platform 的瀏覽器型模擬裝置。有三個您可以使用螢幕上控制項操作的感應器：

source: Temperature
de: Temperatur
it: Temperatura
ja: 温度
pt_br: Temperatura
zh_tw: 溫度

source: Humidity
de: Feuchtigkeit
it: Umidità
ja: 湿度
pt_br: Umidade
zh_tw: 濕度

source: Object temperature
de: Objekttemperatur
it: Temperatura oggetto
ja: 対象温度
pt_br: Temperatura do objeto
zh_tw: 物件溫度

source: Data Visualization
de: Datenvisualisierung
it: Visualizzazione dati
ja: データ可視化
pt_br: Visualização de Dados
zh_tw: 資料視覺化

source: Leaving the simulated device running on your phone/tablet launch the `Quickstart application <http://quickstart.internetofthings.ibmcloud.com>`_ and enter the 12 character generated ID displayed on your phone/tablet in the upper right-hand corner.
de: Starten Sie, während das simulierte Gerät auf Ihrem Mobiltelefon/Tablet ausgeführt wird, `Quickstart application <http://quickstart.internetofthings.ibmcloud.com>`_ und geben Sie die aus 12 Zeichen bestehende generierte ID ein, die auf Ihrem Mobiltelefon/Tablet in der rechten oberen Ecke angezeigt wird.
it: Lasciando il dispositivo simulato in esecuzione sul cellulare/tablet avviare l'applicazione `Quickstart <http://quickstart.internetofthings.ibmcloud.com>`_ e immettere i 12 caratteri che hanno generato l'ID visualizzato sul cellulare/tablet nell'angolo in alto a destra.
ja: 携帯/タブレットでシミュレート・デバイスを実行したまま、`Quickstart アプリケーション <http://quickstart.internetofthings.ibmcloud.com>`_ を起動し、携帯/タブレットの右上隅に表示されている 12 文字の生成 ID を入力します。
pt_br: Deixando o dispositivo simulado em execução em seu telefone/tablet, ative o `aplicativo Quickstart <http://quickstart.internetofthings.ibmcloud.com>`_ e insira o ID gerado por 12 caracteres exibido em seu telefone/tablet no canto superior direito.
zh_tw: 讓模擬裝置持續在您的電話/平板電腦上執行，即會啟動 `Quickstart 應用程式 <http://quickstart.internetofthings.ibmcloud.com>`_，並輸入顯示在電話/平板電腦右上角的 12 個字元已產生 ID。

source: Now, as you adjust the sensor values in your simulated device you will be able to see the data from your device visualized in real time in the Quickstart application.
de: Beim Anpassen der Sensorwerte in Ihrem simulierten Gerät werden die Daten von Ihrem Gerät in der Quickstart-Anwendung in Echtzeit dargestellt.
it: Ora, appena si modificano i valori del sensore nel dispositivo simulato sarà possibile visualizzare dal dispositivo i dati visualizzati in tempo reale nell'applicazione Quickstart.
ja: シミュレート・デバイスでセンサー値を調整すると、デバイスから送られてきたデータが Quickstart アプリケーションでリアルタイムに表示されるはずです。
pt_br: Agora, conforme você ajustar os valores do sensor em seu dispositivo simulado, será capaz de ver os dados de seu dispositivo visualizados em tempo real no aplicativo Quickstart.
zh_tw: 現在，當您在模擬裝置中調整感應器值時，將能夠在 Quickstart 應用程式中看到來自裝置的即時視覺化資料。

source: Mosquitto Demonstration
it: Dimostrazione Mosquitto
ja: Mosquitto デモンストレーション
pt_br: Demonstração do Mosquitto
zh_tw: Mosquitto 示範

source: `Mosquitto <http://mosquitto.org/>`_ is a cross platform open source MQTT client that is perfect for experimenting with the Watson IoT platform service. Once you have installed mosquitto pick an ``<applicationId>``, a ``<deviceId>`` that have a good chance to be unique (otherwise your experiment will clash with someone else running through this same demonstration).
de: `Mosquitto <http://mosquitto.org/>`_ ist ein plattformübergreifender quelloffener MQTT-Client, der sich hervorragend zum Experimentieren mit dem Watson IoT Platform-Service eignet. Sobald Mosquitto installiert ist, wählen Sie eine ``<applicationId>`` (Anwendungs-ID) und eine ``<deviceId>`` (Geräte-ID), die möglichst eindeutig ist (andernfalls kollidiert Ihr Experiment möglicherweise mit dem Experiment eines anderen Benutzers, der ebenfalls diese Demonstration verwendet).
it: `Mosquitto <http://mosquitto.org/>`_ è un client open source MQTT tra piattaforme che è perfetto per sperimentare il servizio Watson IoT platform. Una volta installato Mosquitto, selezionare un ``<applicationId>``, un ``<deviceId>`` con buone probabilità di essere univoco (in caso contrario, l'esperimento sarà in conflitto con altri utenti che eseguono la stessa dimostrazione).
ja: `Mosquitto <http://mosquitto.org/>`_ は、Watson IoT Platform サービスを実験するのに最適なクロスプラットフォームのオープン・ソース MQTT クライアントです。mosquitto をインストールしたら、固有と思われる ``<applicationId>`` と ``<deviceId>`` を選んでください (固有でないと、同じデモンストレーションを行っている他のユーザーと実験が衝突してしまいます)。
pt_br: `Mosquitto <http://mosquitto.org/>`_ é um cliente MQTT de software livre de plataforma cruzada que é perfeito para experiência com o serviço da plataforma Watson IoT. Assim que tiver instalado o mosquitto, selecione um ``<applicationId>``, a ``<deviceId>`` que tenha uma boa chance de ser exclusivo (caso contrário, seu experimento entrará em conflito com outra pessoa que estiver executando por meio desta mesma demonstração).
zh_tw: `Mosquitto <http://mosquitto.org/>`_ 是跨平台的開放程式碼 MQTT 用戶端，非常適合於實驗 Watson IoT Platform 服務。安裝了 Mosquitto 之後，請挑選很有可能是唯一的 ``<applicationId>`` 及 ``<deviceId>``（否則您的實驗將與透過此相同示範執行的其他實驗相衝突）。

source: There are a couple of restrictions you must consider when deciding on these IDs:
de: Beim Auswählen dieser IDs sind die folgenden Einschränkungen zu beachten:
it: Quando vengono determinati tali ID, è necessario tenere presenti alcune limitazioni:
ja: これらの ID を決める際に考慮すべき制約事項がいくつかあります。
pt_br: Existem algumas restrições que devem ser consideradas ao decidir sobre estes IDs:
zh_tw: 在決定這些 ID 時，您必須考量多項限制：

source: Maximum length of 36 characters
de: Maximale Länge von 36 Zeichen
it: Lunghezza massima di 36 caratteri
ja: 最大長 36 文字
pt_br: Comprimento máximo de 36 caracteres
zh_tw: 長度上限為 36 個字元

source: Must comprise only alpha-numeric characters (``a-z``, ``A-Z``, ``0-9``) and the following special characters:
de: Darf nur alphanumerische Zeichen (``a - z``, ``A - Z``, ``0 - 9``) und die folgenden Sonderzeichen umfassen:
it: Devono contenere solo caratteri alfanumerici (``a-z``, ``A-Z``, ``0-9``) e i seguenti caratteri speciali:
ja: 英数字 (``a-z``、``A-Z``、``0-9``) および以下の特殊文字のみで構成する必要があります。
pt_br: Deve abranger apenas caracteres alfanuméricos (` a-z``, ``A-Z`, ``0-9``) e os seguintes caracteres especiais:
zh_tw: 只能包含英數字元（``a-z``、``A-Z``、``0-9``）和下列特殊字元：

source: dash (``-``)
de: Gedankenstrich (``-``)
it: trattino (``-``)
ja: ダッシュ (``-``)
pt_br: traço (``-``)
zh_tw: 橫線 (``-``)

source: underscore (``_``)
de: Unterstreichungszeichen (``_``)
it: sottolineatura (``_``)
ja: 下線 (``_``)
pt_br: sublinhado (``_``)
zh_tw: 底線 (``_``)

source: dot (``.``)
de: Punkt (``.``)
it: punto (``.``)
ja: ドット (``.``)
pt_br: ponto (``.``)
zh_tw: 句點 (``.``)

source: With your ``<applicationId>`` and ``<deviceId>`` in hand the first thing you want to do is create a connection representing your application using ``mosquitto_sub``. Using examples of ``<applicationId>`` = myApplicationId and ``<deviceId>`` = myDeviceId:
de: Sobald Sie über die Anwendungs-ID (``<applicationId>``) und die Geräte-ID (``<deviceId>``) verfügen, erstellen Sie zunächst eine Verbindung für Ihre Anwendung unter Verwendung von ``mosquitto_sub``. Anwendungsbeispiele für ``<applicationId>`` = myApplicationId und ``<deviceId>`` = myDeviceId:
it: Una volta stabiliti ``<applicationId>`` e ``<deviceId>``, la prima operazione da eseguire è la creazione di una connessione che rappresenti la propria applicazione utilizzando ``mosquitto_sub``. Utilizzando gli esempi ``<applicationId>`` = myApplicationId e ``<deviceId>`` = myDeviceId:
ja: ``<applicationId>`` と ``<deviceId>`` を用意したら、まず ``mosquitto_sub`` を使用して、アプリケーションを表す接続を作成する必要があります。例として ``<applicationId>`` = myApplicationId および ``<deviceId>`` = myDeviceId を使用します。
pt_br: Com seu ``<applicationId>`` e ``<deviceId>`` em mãos, a primeira coisa que você deseja fazer é criar uma conexão que represente seu aplicativo usando ``mosquitto_sub``. Usando exemplos de ``<applicationId>`` = myApplicationId e ``<deviceId>`` = myDeviceId:
zh_tw: 確定 ``<applicationId>`` 及 ``<deviceId>`` 之後，您要做的第一件事就是使用 ``mosquitto_sub`` 建立代表應用程式的連線。使用範例 ``<applicationId>`` = myApplicationId 及 ``<deviceId>`` = myDeviceId：

source: Leave that process running, it is now time to turn your attention towards creating your device. We will connect a device of type ``mosquitto`` and send two events to the service using ``mosquitto_pub``:
de: Während der Prozess weiter ausgeführt wird, wenden Sie sich dem Erstellen Ihres Geräts zu. Dabei soll ein Gerät des Typs ``mosquitto`` verbunden werden und mithilfe von ``mosquitto_pub`` zwei Ereignisse zum Service senden:
it: Lasciando il processo in esecuzione, ora è tempo di rivolgere la propria attenzione alla creazione del dispositivo. Si connetterà un dispositivo del tipo ``mosquitto`` e si invieranno due eventi al servizio utilizzando ``mosquitto_pub``:
ja: このプロセスを実行したまま、デバイスの作成を始めます。 タイプ ``mosquitto`` のデバイスに接続し、2 つのイベントを ``mosquitto_pub`` を使用してサービスに送信します。
pt_br: Deixe esse processo em execução, agora é o momento de voltar sua atenção para a criação de seu dispositivo. Conectaremos um dispositivo do tipo ``mosquitto`` e enviaremos dois eventos ao serviço usando ``mosquitto_pub``:
zh_tw: 讓該程序保持執行狀態，現在是您將注意力轉向建立裝置的時候。我們將建立類型為 ``mosquitto`` 的裝置，並使用 ``mosquitto_pub``，將兩個事件傳送至服務：

source: Returning to your application terminal you should see the two events that you published almost instantly:
de: In dem Terminal Ihrer Anwendung müssten die beiden von Ihnen publizierten Ereignisse fast ohne Verzögerung angezeigt werden:
it: Ritornando al terminale dell'applicazione si dovrebbero visualizzare quasi immediatamente i due eventi pubblicati:
ja: アプリケーション端末に戻ると、パブリッシュした 2 つのイベントがすぐに表示されるはずです。
pt_br: Retornando ao seu terminal de aplicativo, você deve ver os dois eventos que publicou quase instantaneamente:
zh_tw: 回到您的應用程式終端機，您應該看到兩個幾乎即時發佈的事件：

source: That's all there is to it. You have successfully connected a device and an application to the Watson IoT platform over MQTT, sent an event from the device to the service and recieved that event in your application.
de: Und das war's auch schon. Sie haben ein Gerät und eine Anwendung erfolgreich über MQTT mit Watson IoT Platform verbunden, ein Ereignis von dem Gerät zum Service gesendet und das Ereignis in Ihrer Anwendung empfangen.
it: Non c'è altro da dire. Si è connesso correttamente un dispositivo e un'applicazione a Watson IoT platform su MQTT, inviato un evento dal dispositivo al servizio e si è ricevuto tale evento nell'applicazione.
ja: これで終わりです。MQTT を介してデバイスとアプリケーションを Watson IoT Platform に正常に接続し、イベントをデバイスからサービスへ送信し、そのイベントをアプリケーションで受信することができました。
pt_br: Por enquanto, é isso. Você conectou com êxito um dispositivo e um aplicativo à plataforma Watson IoT sobre o MQTT, enviou um evento do dispositivo para o serviço e recebeu esse evento em seu aplicativo.
zh_tw: 如此而已。您已透過 MQTT 將裝置和應用程式順利連接至 Watson IoT Platform、已將事件從裝置傳送至服務，以及已在應用程式中接收到該事件。
