Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/java.po
Languages: it, pt_br

source: Java for Device Developers
it: Java per gli sviluppatori del dispositivo
pt_br: Java para Desenvolvedores de Dispositivo

source: See `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub
it: Consultare `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub
pt_br: Consulte `iot-java <https://github.com/ibm-messaging/iot-java>`_ no GitHub

source: Constructor
it: Costruttore
pt_br: Construtor

source: The constructor builds the client instance, and accepts a Properties object containing the following definitions:
it: Il costruttore crea l'istanza client e accetta un oggetto Proprietà che contiene le seguenti definizioni:
pt_br: O construtor constrói a instância do cliente e aceita um objeto Propriedades contendo as seguintes definições:

source: org - Your organization ID. (This is a required field. In case of quickstart flow, provide org as quickstart.)
it: org - L'ID organizzazione. (Questo è un campo obbligatorio. Nel caso del flusso quickstart, specificare org come quickstart.)
pt_br: org - O ID da organização. (Este é um campo obrigatório. No caso de fluxo de iniciação rápida, forneça org como iniciação rápida.)

source: type - The type of your device. (This is a required field.)
it: type - Il tipo di dispositivo. (Questo è un campo obbligatorio.)
pt_br: type - O tipo do dispositivo. (Este é um campo obrigatório.)

source: id - The ID of your device. (This is a required field.
it: id - L'ID del dispositivo. (Questo è un campo obbligatorio.
pt_br: ID - O ID do dispositivo. (Este é um campo obrigatório.

source: auth-method - Method of authentication (This is an optional field, needed only for registered flow and the only value currently supported is "token").
it: auth-method - Il metodo di autenticazione (Questo è un campo facoltativo, necessario solo per il flusso registrato e l'unico valore attualmente supportato è "token").
pt_br: auth-method - Método de autenticação (Esse é um campo opcional, necessário somente para fluxo registrado e o único valor atualmente suportado é "token").

source: auth-token - API key token (This is an optional field, needed only for registered flow).
it: auth-token - Il token chiave API (Questo è un campo facoltativo, necessario solo per il flusso registrato).
pt_br: auth-token - Token de chave API (Esse é um campo opcional, necessário somente para fluxo registrado).

source: clean-session - true or false (required only if you want to connect the application in durable subscription. By default the clean-session is set to true).
it: clean-session - true o false (richiesto solo se si desidera connettere l'applicazione in sottoscrizioni durature. Per impostazione predefinita clean-session è impostato su true).
pt_br: clean-session - true ou false (necessário apenas se você deseja conectar o aplicativo em assinatura durável. Por padrão, a sessão de limpeza é configurada como true).

source: One must set ``clean-session`` to false to connect the device in durable subscription. Refer to `Subscription Buffers and Clean Session <https://docs.internetofthings.ibmcloud.com/reference/mqtt/index.html#/subscription-buffers-and-clean-session#subscription-buffers-and-clean-session>`__ for more information about the clean session.
it: `Si deve impostare ``clean-session`` su false per connettere il dispositivo nella sottoscrizione duratura. Fare riferimento a `Buffer di sottoscrizione e sessione pulita <https://docs.internetofthings.ibmcloud.com/reference/mqtt/index.html#/subscription-buffers-and-clean-session#subscription-buffers-and-clean-session>`__ per ulteriori informazioni relative alla sessione pulita.
pt_br: Deve-se configurar ``clean-session`` como false para conectar o dispositivo em assinatura durável. Consulte `Buffers de Assinatura e Sessão de Limpeza <https://docs.internetofthings.ibmcloud.com/reference/mqtt/index.html#/subscription-buffers-and-clean-session#subscription-buffers-and-clean-session>`__ para obter mais informações sobre a sessão de limpeza.

source: The Properties object creates definitions which are used to interact with the IoT Platform module.
it: L'oggetto Proprietà crea le definizioni utilizzate per interagire con il modulo IoT Platform.
pt_br: O objeto Propriedades cria definições que são usadas para interagir com o módulo do IoT Platform.

source: The following code shows a device publishing events in a Quickstart mode.
it: Il seguente codice mostra la pubblicazione degli eventi di un dispositivo in modalità Quickstart.
pt_br: O código a seguir mostra um dispositivo publicando eventos em um modo Quickstart.

source: The following program shows a device publishing events in a registered flow
it: Il seguente programma mostra la pubblicazione degli eventi di un dispositivo in un flusso registrato
pt_br: O programa a seguir mostra um dispositivo publicando eventos em um fluxo registrado.

source: Using a configuration file
it: Tramite file di configurazione
pt_br: Usando um arquivo de configuração

source: Instead of including a Properties object directly, you can use a configuration file containing the name-value pairs for Properties. If you are using a configuration file containing a Properties object, use the following code format.
it: Invece di includere un oggetto Proprietà direttamente, è possibile utilizzare un file di configurazione contenente le coppie nome-valore per Proprietà. Se si utilizza un file di configurazione contenente un oggetto Proprietà, utilizzare seguente il formato di codice.
pt_br: Em vez de incluir um objeto Propriedades diretamente, você pode usar um arquivo de configuração contendo os pares nome-valor para Propriedades. Se você estiver usando um arquivo de configuração contendo um objeto Propriedades, use o formato de código a seguir.

source: The content of the configuration file must be in the following format:
it: Il contenuto del file di configurazione deve essere nel seguente formato:
pt_br: O conteúdo do arquivo de configuração deve estar no seguinte formato:

source: Connecting to the Watson IoT Platform
it: Connessione a Watson IoT Platform
pt_br: Conectando-se ao Watson IoT Platform

source: Connect to the Watson IoT Platform by calling the connect function. The connect function takes an optional boolean parameter autoRetry (by default autoRetry is true) that controls allows the library to retry the connection when there is an MqttException. Note that the library won't retry when there is a MqttSecurityException due to incorrect device registration details passed even if the autoRetry is set to true.
it: Connettersi a Watson IoT Platform chiamando la funzione connect. La funzione connect accetta il parametro booleano facoltativo autoRetry (per impostazione predefinita autoRetry è true) che consente alla libreria di riprovare la connessione in presenza di una MqttException. La libreria non ritenterà la connessione in presenza di MqttSecurityException a causa della trasmissione errata dei dettagli della registrazione del dispositivo, anche se autoRetry è impostato su true.
pt_br: Conecte-se ao Watson IoT Platform chamando a função de conexão. A função de conexão obtém um parâmetro booleano opcional autoRetry (por padrão, autoRetry é true) que permite que a biblioteca tente novamente a conexão quando há uma MqttException. Observe que a biblioteca não tentará novamente quando há uma MqttSecurityException devido a detalhes de registro de dispositivo incorretos transmitidos mesmo se autoRetry estiver configurado como true.

source: After the successful connection to the IoTF service, the device client can perform the following operations, like publishing events and subscribe to device commands from application.
it: Dopo che la connessione al servizio IoTF ha avuto esito positivo, il client del dispositivo può effettuare operazioni quali la pubblicazione degli eventi e e la sottoscrizione ai comandi del dispositivo dall'applicazione.
pt_br: Após a conexão bem-sucedida com o serviço IoTF, o cliente de dispositivo pode executar as seguintes operações, como a publicação de eventos e a assinatura para comandos do dispositivo a partir do aplicativo.

source: Publishing events
it: Pubblicazione degli eventi
pt_br: Publicando eventos

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
it: Gli eventi sono il meccanismo tramite cui i dispositivi pubblicano i dati in IoT Platform. Il dispositivo controlla il contenuto dell'evento e assegna un nome per ogni evento inviato.
pt_br: Eventos são o mecanismo pelo qual dispositivos publicam dados no IoT Platform. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.

source: When an event is received by the IBM IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
it: Una volta che IBM IoT Platform riceve un evento, vengono utilizzate le credenziali della connessione su cui si è ricevuto l'evento al fine di determinare da quale dispositivo l'evento è stato inviato. Con questa architettura è impossibile per un dispositivo impersonare un altro dispositivo.
pt_br: Quando um evento é recebido pelo IBM IoT Platform, as credenciais da conexão na qual o evento foi recebido são usadas para determinar a partir de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>` defined by the MQTT protocol. By default events will be published as qos level 0.
it: Gli eventi possono essere pubblicati ad uno qualsiasi dei tre `livelli di QoS (quality of service) <../messaging/mqtt.html#/>` definiti dal protocollo MQTT. Per impostazione predefinita gli eventi verranno pubblicati al livello qos 0.
pt_br: Os eventos podem ser publicados em qualquer um dos três `níveis de qualidade de serviço <../messaging/mqtt.html#/>` definidos pelo protocolo MQTT. Por padrão, os eventos serão publicados como qos nível 0.

source: Publish event using default quality of service
it: Pubblicare l'evento utilizzando il qos predefinito
pt_br: Publicar evento usando a qualidade de serviço padrão

source: Publish event using user-defined quality of service
it: Pubblicare l'evento utilizzando il qos definito dall'utente
pt_br: Publicar evento usando a qualidade de serviço definida pelo usuário

source: Events can be published at higher MQTT quality of servive levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt. Also Quickstart flow allows only Qos of 0
it: Gli eventi possono essere pubblicati a livelli QoS MQTT più elevati, ma tali eventi saranno più lenti di quelli a livello QoS 0, a causa dell'ulteriore conferma di ricezione. Inoltre, il flusso Quickstart consente solo Qos pari a 0
pt_br: Os eventos podem ser publicados em níveis de qualidade de serviço MQTT superiores, mas esses eventos podem ser mais lentos que o QoS nível 0 por causa da confirmação de recebimento extra. Além disso, o fluxo Quickstart permite apenas Qos de 0

source: Publish event using HTTP(s)
it: Pubblicare l'evento utilizzando HTTP(s)
pt_br: Publicar evento usando HTTP(s)

source: Apart from MQTT, the devices can publish events to the IoT Platform using HTTP(s) by following 3 simple steps,
it: Oltre che MQTT, i dispositivi possono pubblicare gli eventi in IoT Platform utilizzando HTTP(s) seguendo 3 semplici passi,
pt_br: Além de MQTT, os dispositivos podem publicar eventos no IoT Platform usando HTTP(s) seguindo 3 etapas simples,

source: Construct a DeviceClient instance using the properties file
it: Creare un'istanza DeviceClient utilizzando il file delle proprietà
pt_br: Construa uma instância DeviceClient utilizando o arquivo de propriedades

source: Construct an event that needs to be published
it: Creare un evento che deve essere pubblicato
pt_br: Construa um evento que precisa ser publicado

source: Specify the event name and publish the event using publishEventOverHTTP() method as follows,
it: Specificare il nome dell'evento e pubblicare l'evento utilizzando il metodo publishEventOverHTTP() come mostrato di seguito.
pt_br: Especifique o nome do evento e publique o evento utilizando o método publishEventOverHTTP(), conforme a seguir,

source: The complete code can be found in the device example `HttpDeviceEventPublish <https://github.com/ibm-messaging/iot-device-samples/blob/master/java/device-samples/src/main/java/com/ibm/iotf/sample/client/device/HttpDeviceEventPublish.java>`__
it: È possibile trovare il codice completo nell'esempio del dispositivo `HttpDeviceEventPublish <https://github.com/ibm-messaging/iot-device-samples/blob/master/java/device-samples/src/main/java/com/ibm/iotf/sample/client/device/HttpDeviceEventPublish.java>`__
pt_br: O código completo pode ser localizado no exemplo de dispositivo `HttpDeviceEventPublish <https://github.com/ibm-messaging/iot-device-samples/blob/master/java/device-samples/src/main/java/com/ibm/iotf/sample/client/device/HttpDeviceEventPublish.java>`__

source: Based on the settings in the properties file, the publishEventOverHTTP() method either publishes the event in Quickstart or in Registered flow. When the Organization ID mentioned in the properties file is quickstart, publishEventOverHTTP() method publishes the event to the IoT Platform quickstart service and publishes the event in plain HTTP format. But when valid registered organization is mentioned in the properties file, this method always publishes the event in HTTPS (HTTP over SSL), so all the communication is secured.
it: In base alle impostazioni nel file delle proprietà, il metodo publishEventOverHTTP() pubblica l'evento in Quickstart o nel flusso registrato. Quando l'ID organizzazione indicato nel file delle proprietà è quickstart, il metodo publishEventOverHTTP() pubblica l'evento nel servizio IoT Platform Quickstart e lo pubblica nel formato semplice HTTP. Ma quando nel file delle proprietà viene menzionata un'organizzazione registrata valida, questo metodo pubblica sempre l'evento in HTTPS (HTTP over SSL), in modo da proteggere tutte le comunicazioni.
pt_br: Com base nas configurações no arquivo de propriedades, o método publishEventOverHTTP() ou publica o evento registrado no fluxo ou na Iniciação Rápida. Quando o ID da Organização mencionado no arquivo de propriedades é quickstart, o método publishEventOverHTTP() publica o evento para o serviço quickstart do IoT Platform e publica o evento em formato HTTP simples. Mas quando uma organização registrada válida é mencionada no arquivo de propriedades, esse método sempre publica o evento em HTTPS (HTTP sobre SSL), de forma que toda a comunicação é protegida.

source: The event in HTTP(s) is published at most once QoS, so the device needs to implement the retry logic when there is an error.
it: L'evento in HTTP(s) viene pubblicato al massimo una volta su QoS, pertanto quando si verifica un errore il dispositivo deve implementare la logica retry.
pt_br: O evento em HTTP(s) é publicado no máximo uma vez no QoS, portanto, o dispositivo precisa implementar a lógica de nova tentativa quando houver um erro.

source: Handling commands
it: Gestione dei comandi
pt_br: Manipulando comandos

source: When the device client connects it automatically subscribes to any commands for this device. To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
it: Quando il client del dispositivo si connette, effettua automaticamente la sottoscrizione ai comandi per questo dispositivo. Per elaborare comandi specifici è necessario registrare un metodo di callback del comando. I messaggi vengono restituiti come un'istanza della classe comando che ha le seguenti proprietà:
pt_br: Quando o cliente do dispositivo se conecta, ele automaticamente assina qualquer comando para esse dispositivo. Para processar comandos específicos, você precisa registrar um método de retorno de chamada de comando. As mensagens são retornadas como uma instância da classe Comando, que possui as seguintes propriedades:

source: payload - java.lang.String
pt_br: carga útil - java.lang.String

source: format - java.lang.String
pt_br: formato - java.lang.String

source: command - java.lang.String
pt_br: comando - java.lang.String

source: timestamp - org.joda.time.DateTime
pt_br: registro de data e hora - org.joda.time.DateTime

source: Samples
it: Esempi
pt_br: Amostras

source: Refer to the `github repository <https://github.com/ibm-messaging/iot-device-samples/tree/master/java>`__ for a list of device and device management samples developed using this Watson IoT Java client library.
it: Per un elenco di dispositivi e di esempi di gestione dei dispositivi sviluppato utilizzando la libreria client Java di Watson IoT fare riferimento a `github repository <https://github.com/ibm-messaging/iot-device-samples/tree/master/java>`__.
pt_br: Consulte o `repositório github <https://github.com/ibm-messaging/iot-device-samples/tree/master/java>`__ para obter uma lista de amostras de dispositivos e gerenciamento de dispositivos desenvolvidos usando a biblioteca deste cliente Watson IoT Java.
