Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/java_deviceManagement.po
Languages: de

source: Java Client Library - Managed Devices
de: Java-Clientbibliothek - verwaltete Geräte

source: Introduction
de: Einführung

source: This client library describes how to use devices with the Java ibmiotf client library. For help with getting started with this module, see `Java Client Library - Introduction <../java/javaintro.html>`__.
de: Diese Clientbibliothek beschreibt die Verwendung von Geräten mit der Java-ibmiotf-Clientbibliothek. Hilfe bei den ersten Schritten mit diesem Modul siehe `Java-Clientbibliothek - Einführung <../java/javaintro.html>`__.

source: This section contains information on how devices can to the IoT Platform Device Management service using Java and perform device management operations like firmware update, location update, and diagnostics update.
de: Dieser Abschnitt enthält Informationen dazu, wie Geräte die Verbindung zum Gerätemanagementservice von IoT Platform über Java herstellen und Gerätemanagementoperationen wie Firmware-, Positions- und Diagnose-Updates ausführen können.

source: The Device section contains information on how devices can publish events and handle commands using the Java ibmiotf Client Library.
de: Der Abschnitt 'Geräte' enthält Informationen dazu, wie Geräte Ereignisse publizieren und Befehle mit der Java-ibmiotf-Clientbibliothek verarbeiten können.

source: The Applications section contains information on how applications can use the Java ibmiotf Client Library to interact with devices.
de: Der Abschnitt mit den Anwendungen enthält Informationen, wie Anwendungen die Java-ibmiotf-Clientbibliothek zur Interaktion mit Geräte verwenden können.

source: Device Management
de: Gerätemanagement

source: The `device management <../reference/device_mgmt.html>`__ feature enhances the IoT Platform service with new capabilities for managing devices. Device management makes a distinction between managed and unmanaged devices:
de: Die Funktion `Gerätemanagement <../reference/device_mgmt.html>`__ erweitert den IoT Platform-Service mit neuen Funktionen zur Verwaltung von Geräten. Vom Gerätemanagement wird zwischen verwalteten und nicht verwalteten Geräte unterschieden:

source: **Managed Devices** are defined as devices which have a management agent installed. The management agent sends and receives device metadata and responds to device management commands from the IoT Platform.
de: **Verwaltete Geräte** sind Geräte, auf denen ein Managementagent installiert ist. Der Managementagent sendet und empfängt Gerätemetadaten und antwortet auf Gerätemanagementbefehle von IoT Platform.

source: **Unmanaged Devices** are any devices which do not have a device management agent. All devices begin their lifecycle as unmanaged devices, and can transition to managed devices by sending a message from a device management agent to the IoT Platform.
de: **Nicht verwaltete Geräte** sind Geräte, die nicht über einen Gerätemanagementagenten verfügen. Der Lebenszyklus jedes Geräts beginnt als nicht verwaltetes Gerät. Wenn vom Gerätemanagementagenten eine entsprechende Nachricht an IoT Platform gesendet wird, kann das Gerät zu einem verwalteten Gerät werden.

source: Connecting to the IoT Platform Device Management Service
de: Herstellen der Verbindung zu IoT Platform Device Management Service

source: Create DeviceData
de: DeviceData erstellen

source: The `device model <../reference/device_model.html>`__ describes the metadata and management characteristics of a device. The device database in the IoT Platform is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the IoT Platform, the device database is updated, making the information available to applications.
de: Vom `Gerätemodell <../reference/device_model.html>`__ werden die Gerätemetadaten und Managementeigenschaften eines Geräts beschrieben. Die Gerätedatenbank in IoT Platform ist die Hauptquelle für Geräteinformationen. Von Anwendungen und verwalteten Geräte können Aktualisierungen an die Datenbank gesendet werden, zum Beispiel zur Position oder zum Fortschritt eines Firmware-Updates. Sobald diese Aktualisierungen von IoT Platform empfangen werden, wird die Gerätedatenbank aktualisiert und die Informationen werden den Anwendungen zur Verfügung gestellt.

source: The device model in the ibmiotf client library is represented as DeviceData and to create a DeviceData one needs to create the following objects,
de: Das Gerätemodell in der ibmiotf-Clientbibliothek wird als DeviceData und zum Erstellen von DeviceData dargestellt, das zur Erstellung der folgenden Objekte erforderlich ist

source: DeviceInfo (mandatory)
de: DeviceInfo (obligatorisch)

source: DeviceLocation (required if the device supports location update)
de: DeviceLocation (erforderlich, wenn das Gerät eine Positionsaktualisierung unterstützt)

source: DiagnosticErrorCode (required if the device wants to update the ErrorCode)
de: DiagnosticErrorCode (erforderlich, wenn das Gerät den ErrorCode aktualisieren will)

source: DiagnosticLog (required if the device wants to update Log information)
de: DiagnosticLog (erforderlich, wenn das Gerät Protokollinformationen aktualisieren will)

source: DeviceFirmware (required if the device supports Firmware Actions)
de: DeviceFirmware (erforderlich, wenn das Gerät Firmwareaktionen unterstützt)

source: The following code snippet shows how to create the mandatory object DeviceInfo along with an optional object DeviceMetadata with sample data:
de: Das folgende Code-Snippet zeigt die Erstellung der obligatorischen DeviceInfo zusammen mit dem optionalen Objekt DeviceMetadata mit Beispieldaten:

source: The following code snippet shows how to create the DeviceData object with the above created DeviceInfo and DeviceMetadata objects:
de: Das folgende Code-Snippet zeigt die Erstellung der DeviceData zusammen mit den oben erstellten DeviceInfo- und DeviceMetadata-Objekten:

source: Construct ManagedDevice
de: ManagedDevice erstellen

source: ManagedDevice - A device class that connects the device as managed device to IoT Platform and enables the device to perform one or more Device Management operations. Also the ManagedDevice instance can be used to do normal device operations like publishing device events and listening for commands from application.
de: ManagedDevice - Eine Geräteklasse, die das Gerät als ein verwaltetes Gerät mit IoT Platform verbindet und es dem Gerät ermöglicht, eine oder mehrere Gerätemanagementoperationen durchzuführen. Die ManagedDevice-Instanz kann auch verwendet werden, um normale Geräteoperationen (wie die Publizierung von Geräteereignissen und die Empfangsbereitschaft für Befehle von Anwendungen) auszuführen.

source: ManagedDevice exposes 2 different constructors to support different user patterns,
de: ManagedDevice stellt 2 verschiedene Konstruktoren zur Unterstützung unterschiedlicher Benutzermuster bereit

source: **Constructor One**
de: **Konstruktor 1**

source: Constructs a ManagedDevice instance by accepting the DeviceData and the following properties,
de: Erstellung einer ManagedDevice-Instanz durch Akzeptieren der DeviceData und der folgenden Eigenschaften

source: Organization-ID - Your organization ID.
de: Organization-ID - Ihre Organisations-ID.

source: Device-Type - The type of your device.
de: Device-Type - Der Typ Ihres Gerät.

source: Device-ID - The ID of your device.
de: Device-ID - Die ID Ihres Geräts.

source: Authentication-Method - Method of authentication (The only value currently supported is "token").
de: Authentication-Method - Die Methode der Authentifizierung (der einzige derzeit unterstützte Wert ist "token").

source: Authentication-Token - API key token
de: Authentifizierungstoken - API-Schlüsseltoken

source: All these properties are required to interact with the IoT Platform.
de: Alle diese Eigenschaften sind für die Interaktion mit IoT Platform erforderlich.

source: The following code shows how to create a ManagedDevice instance:
de: Der folgende Code zeigt Ihnen die Erstellung einer ManagedDevice-Instanz:

source: The existing users of DeviceClient might observe that the names of these properties have changed slightly. These names have been changed to mirror the names in the IoT Platform Dashboard, but the existing users who want to migrate from the DeviceClient to the ManagedDevice can still use the old format and construct the ManagedDevice instance as follows:
de: Die vorhandenen Benutzer von DeviceClient werden möglicherweise feststellen, dass sich die Namen dieser Eigenschaften leicht geändert haben. Diese Änderung wurde vorgenommen, um die Namen im IoT Platform-Dashboard zu reflektieren. Vorhandene Benutzer, die von 'DeviceClient' zu 'ManagedDevice' migrieren möchten, können jedoch weiterhin das alte Format verwenden und die 'ManagedDevice'-Instanz wie folgt erstellen:

source: **Constructor Two**
de: **Konstruktor Zwei**

source: Construct a ManagedDevice instance by accepting the DeviceData and the MqttClient instance. This constructor requires the DeviceData to be created with additional device attributes like Device Type and Device Id as follows:
de: Erstellung einer ManagedDevice-Instanz durch Akzeptieren der DeviceData- und der MqttClient-Instanz. Für diesen Konstruktor ist erforderlich, dass DeviceData mit zusätzlichen Geräteattributen (wie Gerätetyp und Geräte-ID) wie folgt erstellt wird:

source: Note this constructor helps the custom device users to create a ManagedDevice instance with the already created and connected MqttClient instance to take advantage of device management operations. But we recommend the users to use the library for all the device functionalities.
de: Hinweis: diese Konstruktor hilft Benutzern von Hilfetexten Geräte, eine ManagedDevice-Instanz mit der bereits erstellten und verbundenen MqttClient-Instanz zu erstellen, um so die Operationen zum Gerätemanagement ausnutzen zu können. Wir empfehlen jedoch, dass Benutzer die Bibliothek für sämtliche Gerätefunktionalität verwenden.

source: Manage
de: Verwalten

source: The device can invoke manage() method to participate in device management activities. The manage request will initiate a connect request internally if the device is not connected to the IoT Platform already:
de: Das Gerät kann die Methode manage() zur Teilnahme in den Gerätemanagementaktivitäten aufrufen. Die Managementanforderung initiiert intern eine Verbindungsanforderung, wenn das Gerät noch nicht mit IoT Platform verbunden ist:

source: The device can use overloaded manage (lifetime) method to register the device for a given timeframe. The timeframe specifies the length of time within which the device must send another **Manage device** request in order to avoid being reverted to an unmanaged device and marked as dormant.
de: Das Gerät kann die überladene Methode zur Verwaltung (Lebensdauer) zum Registrieren des Geräts für einen angegebenen Zeitrahmen (timeframe) verwenden. Der Zeitrahmen gibt die Zeitdauer an, in der von dem Gerät eine weitere Anforderung des Typs **Gerät verwalten** gesendet werden muss, um zu vermeiden, dass es in den Status eines nicht verwalteten Geräts versetzt und als 'ruhend' angesehen wird.

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the manage operation.
de: Weitere Informationen zur Verwaltungsoperation finden Sie in der `Dokumentation <../device_mgmt/operations/manage.html>`__.

source: Unmanage
de: Nicht verwalten

source: A device can invoke unmanage() method when it no longer needs to be managed. The IoT Platform will no longer send new device management requests to this device and all device management requests from this device will be rejected other than a **Manage device** request.
de: Ein Gerät kann die Methode unmanage() aufrufen, wenn für es keine Verwaltung mehr erforderlich ist. IoT Platform sendet keine neuen Gerätemanagementanforderungen mehr an dieses Gerät und alle Gerätemanagementanforderungen von diesem Gerät bis auf die Anforderung **Gerät verwalten** werden abgelehnt.

source: Refer to the `documentation <../device_mgmt/operations/manage.html>`__ for more information about the Unmanage operation.
de: Weitere Informationen zur Operation zum Aufheben der Verwaltung finden Sie in der `Dokumentation <../device_mgmt/operations/manage.html>`__.

source: Location Update
de: Positionsaktualisierung

source: Devices that can determine their location can choose to notify the IoT Platform about location changes. In order to update the location, the device needs to create DeviceData instance with the DeviceLocation object first.
de: Bei Geräten, die Ihre Position bestimmen können, kann festgelegt werden, dass IoT Platform über Positionsänderungen informiert wird. Zum Aktualisieren der Position muss das Gerät eine DeviceData-Instanz mit dem DeviceLocation-Objekt zuerst erstellen.

source: Once the device is connected to IoT Platform, the location can be updated by invoking the following method:
de: Wenn das Gerät mit IoT Platform verbunden ist, kann die Position durch Aufrufen der folgenden Methode aktualisiert werden:

source: Later, any new location can be updated by changing the properties of the DeviceLocation object:
de: Später können alle neuen Positionen durch Ändern der Eigenschaften des DeviceLocation-Objekts aktualisiert werden:

source: The update() method informs the IoT Platform about the new location.
de: Die Methode 'update()' informiert IoT Platform über die neue Position.

source: Refer to the `documentation <../device_mgmt/operations/update.html>`__ for more information about the Location update.
de: Weitere Informationen zur Aktualisierung der Position finden Sie in der `Dokumentation <../device_mgmt/operations/update.html>`__.

source: Append/Clear ErrorCodes
de: Fehlercodes zu Anhängen/Löschen

source: Devices can choose to notify the IoT Platform about changes in their error status. In order to send the ErrorCodes the device needs to construct a DiagnosticErrorCode object as follows:
de: Geräte können festlegen, dass IoT Platform über Änderungen ihres Fehlerstatus informiert wird. Damit die Fehlercodes gesendet werden, muss das Gerät ein DiagnosticErrorCode-Objekt wie folgt erstellen:

source: Once the device is connected to IoT Platform, the ErrorCode can be sent by calling the send() method as follows:
de: Wenn das Gerät mit IoT Platform verbunden ist, kann der Fehlercode durch Aufrufen der Methode 'send()' wie folgt gesendet werden:

source: Later, any new ErrorCodes can be easily added to the IoT Platform by calling the append method as follows:
de: Später können alle neuen Fehlercodes ohne großen Aufwand zu IoT Platform hinzugefügt werden, indem die Methode 'append' wie folgt aufgerufen wird:

source: Also, the ErrorCodes can be cleared from IoT Platform by calling the clear() method as follows:
de: Die Fehlercodes können in IoT Platform auch gelöscht werden, indem die Methode 'clear()' wie folgt aufgerufen wird:

source: Append/Clear Log messages
de: Protokollnachricht Anhängen/Löschen

source: Devices can choose to notify the IoT Platform about changes by adding a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data. In order to send log messages, the device needs to construct a DiagnosticLog object as follows:
de: Für Geräte kann festgelegt werden, dass IoT Platform über Änderungen informiert wird, indem ein neuer Protokolleintrag hinzugefügt wird. Ein Protokolleintrag umfasst eine Protokollnachricht, ihre Zeitmarke und optional base64-codierte binäre Diagnosedaten. Damit Protokollnachrichten gesendet werden, muss das Gerät ein DiagnosticLog-Objekt wie folgt erstellen:

source: Once the device is connected to IoT Platform, the log message can be sent by calling the send() method as follows:
de: Wenn das Gerät mit IoT Platform verbunden ist, kann die Protokollnachricht durch Aufrufen der Methode 'send()' wie folgt gesendet werden:

source: Later, any new log messages can be easily added to the IoT Platform by calling the append method as follows:
de: Später können alle neuen Protokollnachrichten ohne großen Aufwand zu IoT Platform hinzugefügt werden, indem die Methode 'append' wie folgt aufgerufen wird:

source: Also, the log messages can be cleared from IoT Platform by calling the clear method as follows:
de: Die Protokollnachrichten können in IoT Platform auch gelöscht werden, indem die Methode 'clear' wie folgt aufgerufen wird:

source: The device diagnostics operations are intended to provide information on device errors, and does not provide diagnostic information relating to the devices connection to the IoT Platform.
de: Die Operationen zur Gerätediagnose sollen Informationen zu Gerätefehlern bereitstellen und nicht Diagnoseinformationen zur Geräteverbindung zu IoT Platform.

source: Refer to the `documentation <../device_mgmt/operations/diagnostics.html>`__ for more information about the Diagnostics operation.
de: Weitere Informationen zur Diagnoseoperation finden Sie in der `Dokumentation <../device_mgmt/operations/diagnostics.html>`__.

source: Firmware Actions
de: Firmwareaktionen

source: The firmware update process is separated into two distinct actions:
de: Der Firmware-Update-Prozess untergliedert sich in zwei wesentliche Aktionen:

source: Downloading Firmware
de: Herunterladen der Firmware

source: Updating Firmware.
de: Aktualisieren der Firmware

source: The device needs to do the following activities to support Firmware Actions:
de: Das Gerät muss folgende Aktivitäten ausführen, damit Firmwareaktionen unterstützt werden:

source: **1. Construct DeviceFirmware Object**
de: **1. Erstellen eines DeviceFirmware-Objekts**

source: In order to perform Firmware actions the device needs to construct the DeviceFirmware object and add it to DeviceData as follows:
de: Zum Ausführen von Firmwareaktionen muss das Gerät das DeviceFirmware-Objekt erstellen und dieses zu DeviceData wie folgt hinzufügen:

source: The DeviceFirmware object represents the current firmware of the device and will be used to report the status of the Firmware Download and Firmware Update actions to IoT Platform.
de: Das DeviceFirmware-Objekt stellt die aktuelle Firmware des Geräts dar und wird zum Melden des Status der Firmware-Download- und Firmware-Update-Aktionen an IoT Platform verwendet.

source: **2. Inform the server about the Firmware action support**
de: **2. Informieren des Servers über die Firmwareaktionsunterstützung**

source: The device needs to set the firmware action flag to true in order for the server to initiate the firmware request. This can be achieved by invoking a following method with a boolean value:
de: Für das Gerät muss für das Firmwareaktionsflag 'true' festgelegt werden, damit der Server die Firmwareanforderung initiieren kann. Dies kann durch Aufrufen der folgende Methode mit einem booleschen Wert erreicht werden:

source: As the manage request informs the IoT Platform about the firmware action support, manage() method needs to be called right after setting the firmware action support.
de: Während die Managementanforderung IoT Platform über die Firmwareaktionsunterstützung informiert, muss die Methode 'manage()' direkt nach dem Festlegen der Firmwareaktionsunterstützung aufgerufen werden.

source: **3. Create the Firmware Action Handler**
de: **3. Erstellen des Firmwareaktionshandlers

source: In order to support the Firmware action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceFirmwareHandler class and implement the following methods:
de: Zur Unterstützung der Firmwareaktion muss das Gerät einen Handler erstellen und diesen zu ManagedDevice hinzufügen. Der Handler muss eine DeviceFirmwareHandler-Klasse erweitern und die folgenden Methoden implementieren:

source: **3.1 Sample implementation of downloadFirmware**
de: **3.1 Beispielimplementierung von downloadFirmware**

source: The implementation must add logic to download the firmware and report the status of the download via DeviceFirmware object. If the Firmware Download operation is successful, then the state of the firmware to be set to DOWNLOADED and UpdateStatus should be set to SUCCESS.
de: Die Implementierung muss Logik hinzufügen, um die Firmware herunterzuladen und den Status des Downloads über das Objekt DeviceFirmware zu melden. Wenn die Firmware-Downloadoperation erfolgreich ist, muss der Status der Firmware auf DOWNLOADED gesetzt werden, und UpdateStatus muss auf SUCCESS gesetzt werden.

source: If an error occurs during Firmware Download the state should be set to IDLE and updateStatus should be set to one of the error status values:
de: Wenn während des Firmware-Downloads ein Fehler auftritt, muss der Status auf IDLE gesetzt werden und für updateStatus muss einer der Fehlerstatuswerte festgelegt werden:

source: A sample Firmware Download implementation for a Raspberry Pi device is shown below:
de: Eine Beispiel-Firmware-Download-Implementierung für ein Raspberry Pi-Gerät wird nachfolgend dargestellt:

source: Device can check the integrity of the downloaded firmware image using the verifier and report the status back to IoT Platform. The verifier can be set by the device during the startup (while creating the DeviceFirmware Object) or as part of the Download Firmware request by the application. A sample code to verify the same is below:
de: Das Gerät kann die Integrität des heruntergeladenen Firmware-Images prüfen, indem die Prüffunktion verwendet und der Status zurück an IoT Platform gemeldet wird. Die Prüffunktion kann von dem Gerät beim Start (beim Erstellen des DeviceFirmware-Objekts) oder als Teil der Download-Firmware-Anforderung von der Anwendung festgelegt werden. Nachfolgend ein Beispielcode zur Überprüfung:

source: The complete code can be found in the device management sample `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.
de: Den vollständigen Code finden Sie im Gerätemanagementbeispiel `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__.

source: **3.2 Sample implementation of updateFirmware**
de: **3.2 Beispielimplementierung von updateFirmware**

source: The implementation must add logic to install the downloaded firmware and report the status of the update via DeviceFirmware object. If the Firmware Update operation is successful, then the state of the firmware should to be set to IDLE and UpdateStatus should be set to SUCCESS.
de: Die Implementierung muss Logik hinzufügen, um die heruntergeladene Firmware zu installieren und den Status der Aktualisierung über das DeviceFirmware-Objekt zu melden. Wenn die Firmware-Update-Operation erfolgreich ist, muss der Status der Firmware auf IDLE gesetzt werden, und UpdateStatus muss auf SUCCESS gesetzt werden.

source: If an error occurs during Firmware Update, updateStatus should be set to one of the error status values:
de: Wenn während des Firmware-Updates ein Fehler auftritt, muss für updateStatus einer der Fehlerstatuswerte festgelegt werden:

source: A sample Firmware Update implementation for a Raspberry Pi device is shown below:
de: Eine Beispiel-Firmware-Update-Implementierung für ein Raspberry Pi-Gerät wird nachfolgend dargestellt:

source: **4. Add the handler to ManagedDevice**
de: **4. Hinzufügen des Handlers zu ManagedDevice**
