Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/java_deviceManagement.po
Languages: de

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a Firmware action request from IoT Platform.
de: Der erstellte Handler muss zur ManagedDevice-Instanz hinzugefügt werden, damit die ibmiotf-Clientbibliothek die entsprechende Methode aufruft, wenn eine Firmwareaktionsanforderung von IoT Platform vorliegt.

source: Refer to `this page <../device_mgmt/operations/firmware_actions.html>`__ for more information about the Firmware action.
de: Weitere Informationen zur Firmwareaktion finden Sie auf `dieser Seite <../device_mgmt/operations/firmware_actions.html>`__.

source: Device Actions
de: Geräteaktionen

source: The IoT Platform supports the following device actions:
de: IoT Platform unterstützt die folgenden Geräteaktionen:

source: Reboot
de: Neu starten

source: The device needs to do the following activities to support Device Actions:
de: Das Gerät muss folgende Aktivitäten ausführen, damit Geräteaktionen unterstützt werden:

source: **1. Inform server about the Device Actions support**
de: **1. Informieren des Servers über die Geräteaktionsunterstützung**

source: In order to perform Reboot and Factory Reset, the device needs to inform the IoT Platform about its support first. This can achieved by invoking a following method with a boolean value:
de: Um einen Neustart und ein Factory-Reset durchzuführen, muss das Gerät zunächst IoT Platform über seine Unterstützung informieren. Dies kann durch Aufrufen der folgende Methode mit einem booleschen Wert erreicht werden:

source: As the manage request informs the IoT Platform about the device action support, manage() method needs to be called right after setting the device action support.
de: Während die Managementanforderung IoT Platform über die Geräteaktionsunterstützung informiert, muss die Methode 'manage()' direkt nach dem Festlegen der Geräteaktionsunterstützung aufgerufen werden.

source: **2. Create the Device Action Handler**
de: **2. Erstellen des Geräteaktionshandlers

source: In order to support the device action, the device needs to create a handler and add it to ManagedDevice. The handler must extend a DeviceActionHandler class and provide implementation for the following methods:
de: Zur Unterstützung der Geräteaktion muss das Gerät einen Handler erstellen und diesen zu ManagedDevice hinzufügen. Der Handler muss eine DeviceActionHandler-Klasse erweitern und die Implementierung für die folgenden Methoden bereitstellen:

source: **2.1 Sample implementation of handleReboot**
de: **2.1 Beispielimplementierung von handleReboot**

source: The implementation must add a logic to reboot the device and report the status of the reboot via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because the successful operation reboots the device and the device code will not have a control to update the IoT Platform). A sample reboot implementation for a Raspberry Pi device is shown below:
de: Die Implementierung muss eine Logik hinzufügen, um für das Gerät einen Warmstart durchzuführen und den Status des Reboots über das DeviceAction-Objekt zu melden. Das Gerät muss den Status zusammen mit einer optionalen Nachricht nur dann aktualisieren, wenn ein Fehler vorliegt (da eine erfolgreiche Operation das Gerät neu startet und der Gerätecode keine Kontrolle über die Aktualisierung von IoT Platform hat). Eine Beispiel-Reboot-Implementierung für ein Raspberry Pi-Gerät wird nachfolgend dargestellt:

source: The complete code can be found in the device management sample `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.
de: Den vollständigen Code finden Sie im Gerätemanagementbeispiel `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__.

source: **2.2 Sample implementation of handleFactoryReset**
de: **2.2 Beispielimplementierung von handleFactoryReset**

source: The implementation must add a logic to reset the device to factory settings and report the status via DeviceAction object. The device needs to update the status along with a optional message only when there is a failure (because as part of this process, the device reboots and the device will not have a control to update status to IoT Platform). The skeleton of the Factory Reset implementation is shown below:
de: Die Implementierung muss eine Logik hinzufügen, um das Gerät auf Werkseinstellung zurückzusetzen und den Status über das Objekt DeviceAction melden zu können. Das Gerät muss den Status zusammen mit einer optionalen Nachricht nur dann aktualisieren, wenn ein Fehler vorliegt (da das Gerät als Teil dieses Prozesses einen Neustart durchführt und keine Kontrolle zum Aktualisieren des Status von IoT Platform hat). Das Gerüst der Factory-Reset-Implementierung wird nachfolgend dargestellt:

source: **3. Add the handler to ManagedDevice**
de: **3. Hinzufügen des Handlers zu ManagedDevice**

source: The created handler needs to be added to the ManagedDevice instance so that the ibmiotf client library invokes the corresponding method when there is a device action request from IoT Platform.
de: Der erstellte Handler muss zur ManagedDevice-Instanz hinzugefügt werden, damit die ibmiotf-Clientbibliothek die entsprechende Methode aufruft, wenn eine Geräteaktionsanforderung von IoT Platform vorliegt.

source: Refer to `this page <../device_mgmt/operations/device_actions.html>`__ for more information about the Device Action.
de: Weitere Informationen zur Geräteaktion finden Sie auf `dieser Seite <../device_mgmt/operations/device_actions.html>`__.

source: Listen for Device attribute changes
de: Empfangsbereit für Geräteattributänderungen sein

source: This ibmiotf client library updates the corresponding objects whenever there is an update request from the IoT Platform, these update requests are initiated by the application either directly or indirectly (Firmware Update) via the IoT Platform ReST API. Apart from updating these attributes, the library provides a mechanism where the device can be notified whenever a device attribute is updated.
de: Diese ibmiotf-Clientbibliothek aktualisiert die entsprechenden Objekte immer dann, wenn eine Aktualisierungsanforderung von IoT Platform vorliegt. Diese Aktualisierungsanforderungen werden von der Anwendung entweder direkt oder indirekt (Firmware-Update) über die REST-API von IoT Platform initiiert. Neben der Aktualisierung dieser Attribute bietet die Bibliothek einen Mechanismus bei dem das Gerät benachrichtigt werden kann, wann immer ein Geräteattribut aktualisiert wird.

source: Attributes that can be updated by this operation are location, metadata, device information and firmware.
de: Durch diese Operation können die Attribute für Position, Metadaten, Gerätedaten und Firmware aktualisiert werden.

source: In order to get notified, the device needs to add a property change listener on those objects that it is interested.
de: Damit eine Benachrichtigung erfolgen kann, muss das Gerät einen Listener für Eigenschaftsänderungen bei den Objekten hinzufügen, die von Interesse sind.

source: Also, the device needs to implement the propertyChange() method where it receives the notification. A sample implementation is as follows:
de: Darüber hinaus, muss das Gerät die Methode propertyChange() implementieren; dort erhält es die Benachrichtigung. Folgende Beispielimplementierung:

source: Refer to `this page <../device_mgmt/operations/update.html>`__ for more information about updating the device attributes.
de: Weitere Informationen zur Aktualisierung der Geräteattributen finden Sie auf `dieser Seite <../device_mgmt/operations/update.html>`__.

source: Examples
de: Beispiele

source: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - A sample agent code that shows how to perform various device management operations on Raspberry Pi.
de: `SampleRasPiDMAgent <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgent.java>`__ - Ein Beispiel-Agenten-Code, der die Ausführung verschiedener Gerätemanagementoperationen unter Raspberry Pi zeigt.

source: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - A sample code that shows how one can perform both device operations and management operations.
de: `SampleRasPiManagedDevice <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiManagedDevice.java>`__ - Ein Beispielcode, der zeigt, wie Geräteoperationen und Managementoperationen ausgeführt werden.

source: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - A sample agent code with custom MqttAsyncClient.
de: `SampleRasPiDMAgentWithCustomMqttAsyncClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttAsyncClient.java>`__ - Ein Beispielagentencode mit angepasstem MqttAsyncClient.

source: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - A sample agent code with custom MqttClient.
de: `SampleRasPiDMAgentWithCustomMqttClient <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/SampleRasPiDMAgentWithCustomMqttClient.java>`__ - Ein Beispielagentencode mit angepasstem MqttClient.

source: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - A sample implementation of FirmwareHandler for Raspberry Pi.
de: `RasPiFirmwareHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/RasPiFirmwareHandlerSample.java>`__ - Eine Beispielimplementierung von FirmwareHandler für Raspberry Pi.

source: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - A sample implementation of DeviceActionHandler
de: `DeviceActionHandlerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceActionHandlerSample.java>`__ - Eine Beispielimplementierung von DeviceActionHandler

source: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - A sample that shows how to send regular manage request with lifetime specified.
de: `ManagedDeviceWithLifetimeSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/ManagedDeviceWithLifetimeSample.java>`__ - Ein Beispiel, das das Senden einer regulären Managementanforderung mit der angegebenen Lebensdauer zeigt.

source: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - A sample listener code that shows how to listen for a various device attribute changes .
de: `DeviceAttributesUpdateListenerSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/DeviceAttributesUpdateListenerSample.java>`__ - Ein Beispiel-Listener-Code, der zeigt, wie die Empfangsbereitschaft für verschiedene Änderungen bei Geräteattributen erfolgt.

source: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - A sample that shows how to add ErrorCode without waiting for response from the server.
de: `NonBlockingDiagnosticsErrorCodeUpdateSample <https://github.com/ibm-messaging/iot-java/blob/master/samples/iotfdevicemanagement/src/com/ibm/iotf/sample/devicemgmt/device/NonBlockingDiagnosticsErrorCodeUpdateSample.java>`__ - Ein Beispiel, das das Hinzufügen von ErrorCode ohne Warten auf eine Antwort vom Server zeigt.

source: Recipe
de: Anleitung

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__ that shows how to connect the Raspberry Pi device as managed device to IoT Platform to perform various device management operations in step by step using this client library.
de: Eine schrittweise Beschreibung der Vorgehensweise zum Verbinden des Raspberry Pi-Geräts als verwaltetes Gerät mit IoT Platform zum Ausführen verschiedener Gerätemanagementoperationen unter Verwendung dieser Clientbibliothek enthält die `Anleitung <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-managed-device-to-ibm-iot-foundation/>`__.
