Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/libraries/mbedcpp.po
Languages: it, pt_br

source: mBed C++ for Device Developers
it: mBed C++ per gli sviluppatori del dispositivo
pt_br: mBed C++ para Desenvolvedores de Dispositivos

source: See `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ on `developer.mbed.org <https://developer.mbed.org/>`_
it: Consultare `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ on `developer.mbed.org <https://developer.mbed.org/>`_
pt_br: Consulte `ibmiotf <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ no `developer.mbed.org <https://developer.mbed.org/>`_

source: The `mBed C++ client library <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ can be used to connect `mBed devices <https://www.mbed.com/en/>`__ like `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ and etc.. to the IoT Platform Cloud service with ease. Although the library uses C++, it still avoids dynamic memory allocations and use of STL functions as the mBed devices sometimes have idiosyncratic memory models which make porting difficult. In any case, the library allows one to make memory use as predictable as possible.
it: La libreria client `mBed C++ <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ può essere utilizzata per connettere facilmente i dispositivi `mBed <https://www.mbed.com/en/>`__ come `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ e ecc.. al servizio IoT Platform Cloud. Sebbene utilizzi C++, la libreria evita comunque le assegnazioni di memoria dinamiche e l'utilizzo delle funzioni STL, in quanto i dispositivi mBed a volte hanno modelli di memoria idiosincratici che rendono difficoltosa la trasposizione. In ogni caso, la libreria consente di rendere l'utilizzo della memoria il più prevedibile possibile.
pt_br: A `biblioteca do cliente do mBed C++ <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTF/>`_ pode ser usada para conectar os `dispositivos mBed <https://www.mbed.com/en/>`__ como o `LPC1768 <https://developer.mbed.org/platforms/mbed-LPC1768/>`__, `FRDM-K64F <https://developer.mbed.org/platforms/FRDM-K64F/>`__ e etc.. ao serviço do IoT Platform Cloud com facilidade. Embora a biblioteca utiliza C++, ele ainda evita as alocações de memória dinâmica e utilização de funções STL como os dispositivos mBed as vezes possuem modelos de memória idiossincrática, que torna a portabilidade difícil. De qualquer forma, a biblioteca permite fazer uso da memória tão previsível quanto possível.

source: Dependencies
it: Dipendenze
pt_br: Dependências

source: `Eclipse Paho MQTT library <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Provides a MQTT client library for mBed devices, check `here <http://www.eclipse.org/paho/clients/c/embedded/>`__ for more information.
it: `Libreria Eclipse Paho MQTT <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Fornisce una libreria client MQTT per i dispositivi mBed, fare clic `qui <http://www.eclipse.org/paho/clients/c/embedded/>`__ per ulteriori informazioni.
pt_br: `Eclipse Paho MQTT library <https://developer.mbed.org/teams/mqtt/code/MQTT/>`__ - Fornece uma biblioteca do cliente MQTT para dispositivos mBed, consulte `aqui <http://www.eclipse.org/paho/clients/c/embedded/>`__ para obter mais informações.

source: `EthernetInterface library <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - A mBed IP library over Ethernet.
it: `Libreria EthernetInterface <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - Una libreria IP mBed su ethernet.
pt_br: `EthernetInterface library <https://developer.mbed.org/users/mbed_official/code/EthernetInterface/>`__ - Uma bibliotecal IP mBed sobre a Ethernet.

source: How to use the library
it: Come utilizzare la libreria
pt_br: Como utilizar a biblioteca

source: Use the `mBed Compiler <https://developer.mbed.org/compiler/>`__ to create your applications using this mBed C++ IBMIoTF Client Library. The mBed Compiler provides a lightweight online C/C++ IDE that is pre-configured to let you quickly write programs, compile and download them to run on your mbed Microcontroller. In fact, you don't have to install or set up anything to get running with mbed.
it: Utilizzare il `Programma di compilazione mBed <https://developer.mbed.org/compiler/>`__ per creare le applicazioni utilizzando questa libreria client IBMIoTF C++ mBed. Il programma di compilazione mBed fornisce una IDE C/C++ online leggera preconfigurata per permettere agli utenti di scrivere rapidamente programmi, di compilarli e scaricarli per eseguirli nel Microcontroller mbed. Infatti, non è necessario eseguire installazioni o configurazioni per iniziare ad utilizzare mbed.
pt_br: Utilize o `Compilador mBed <https://developer.mbed.org/compiler/>`__ para criar seus aplicativos usando esta Biblioteca do Cliente mBed C++ IBMIoTF. O Compilador mBed fornece um ID C/C++ online leve que é pré-configurado para permitir você rapidamente escrever programas, compilar e fazer download para executar em seu Microcontrolador mbed. Na verdade, você não precisa instalar ou configurar nada para conseguir executar o mbed.

source: Refer to the step by step `mBed C++ Client Library for IBM IoT Platform Recipe <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ that shows how one can use this library to connect an ARM mBed NXP LPC 1768 microcontroller to the IoT Platform.
it: Fare riferimento alle istruzioni passo dopo passo relative a `mBed C++ Client Library for IBM IoT Platform <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ che mostrano in che modo è possibile utilizzare questa libreria per connettere un microcontrollore ARM mBed NXP LPC 1768 a IoT Platform.
pt_br: Consulte o passo a passo da ` Biblioteca do Cliente mBed C++ para o IBM IoT Platform Recipe <https://developer.ibm.com/recipes/tutorials/mbed-c-client-library-for-ibm-iot-foundation/>`__ que mostra como é possível usar esta biblioteca para conectar um microcontrolador ARM mBed NXP LPC 1768 ao IoT Platform.

source: Constructor
it: Costruttore
pt_br: Construtor

source: The constructor builds the client instance, and accepts the following parameters:
it: Il costruttore crea l'istanza del client e accetta i seguenti parametri:
pt_br: O construtor compila a instância do cliente e aceita argumentos que contêm os seguintes parâmetros:

source: org - Your organization ID. (This is a required field. In case of quickstart flow, provide org as quickstart.)
it: org - L'ID organizzazione. (Questo è un campo obbligatorio. Nel caso del flusso quickstart, specificare org come quickstart.)
pt_br: org - O ID da organização. (Este é um campo obrigatório. No caso de fluxo de iniciação rápida, forneça org como iniciação rápida.)

source: type - The type of your device. (This is a required field.)
it: type - Il tipo di dispositivo. (Questo è un campo obbligatorio.)
pt_br: type - O tipo do dispositivo. (Este é um campo obrigatório.)

source: id - The ID of your device. (This is a required field.
it: id - L'ID del dispositivo. (Questo è un campo obbligatorio.
pt_br: ID - O ID do dispositivo. (Este é um campo obrigatório.

source: auth-method - Method of authentication (This is an optional field, needed only for registered flow and the only value currently supported is "token").
it: auth-method - Il metodo di autenticazione (Questo è un campo facoltativo, necessario solo per il flusso registrato e l'unico valore attualmente supportato è "token").
pt_br: auth-method - Método de autenticação (Esse é um campo opcional, necessário somente para fluxo registrado e o único valor atualmente suportado é "token").

source: auth-token - API key token (This is an optional field, needed only for registered flow).
it: auth-token - Il token chiave API (Questo è un campo facoltativo, necessario solo per il flusso registrato).
pt_br: auth-token - Token de chave API (Esse é um campo opcional, necessário somente para fluxo registrado).

source: These arguments create definitions which are used to interact with the IoT Platform service.
it: Questi argomenti creano le definizioni utilizzate per interagire con il servizio IoT Platform.
pt_br: Estes argumentos criam definições que são usadas para interagir com o serviço do IoT Platform.

source: The following code block shows how to create a DeviceClient instance to interact with the IoT Platform quickstart service.
it: Il seguente codice di blocco mostra in che modo creare un'istanza DeviceClient per interagire con il servizio IoT Platform quickstart.
pt_br: O bloco de código a seguir mostra como criar uma instância do DeviceClient para interagir com o serviço do IoT Platform Quickstart.

source: As shown above, if the device id is not specified, the DeviceClient uses the MAC address of the device as device id and connects to the IoT Platform. The device code can use getDeviceId() method to retrieve the device id from the DeviceClient instance.
it: Come mostrato sopra, se non è specificato l'ID dispositivo, DeviceClient utilizza l'indirizzo MAC del dispositivo come ID dispositivo e si connette a IoT Platform. Il codice dispositivo può utilizzare il metodo getDeviceId() per richiamare l'ID del dispositivo dall'istanza DeviceClient.
pt_br: Conforme mostrado acima, se o ID do dispositivo não for especificado, o DeviceClient usará o endereço MAC do dispositivo como ID do dispositivo e se conectará ao IoT Platform. O código de dispositivo pode utilizar método getDeviceId() para recuperar o id do dispositivo da instância do DeviceClient.

source: The following code block shows how to create a DeviceClient instance to interact with the IoT Platform Registered organization.
it: Il seguente blocco di codice mostra in che modo creare un'istanza DeviceClient per interagire con l'organizzazione registrata IoT Platform.
pt_br: O bloco de código a seguir mostra como criar uma instância do DeviceClient para interagir com a organização do IoT Platform Registered.

source: Connecting to the IoT Platform
it: Connessione a IoT Platform
pt_br: Conectando-se ao IoT Platform

source: The device can connect to the IoT Platform by calling the connect function on the DeviceClient instance.
it: Il dispositivo può connettersi a IoT Platform richiamando la funzione connect nell'istanza DeviceClient.
pt_br: O dispositivo pode conectar-se ao IoT Platform chamando a função connect na instância de DeviceClient.

source: After the successful connection, the device can publish events to the IoT Platform and listen for commands.
it: Una volta eseguita la connessione correttamente, il dispositivo può pubblicare gli eventi in IoT Platform e mettersi in ascolto dei comandi.
pt_br: Após a conexão bem-sucedida, o dispositivo pode publicar eventos no IoT Plaform e receber comandos.

source: Also, the device can query the status of the connection using the isConnected() method as follows,
it: Inoltre, il dispositivo può eseguire una query sullo stato della connessione utilizzando il metodo isConnected() di seguito riportato,
pt_br: Além disso, o dispositivo pode consultar o status da conexão usando o método isConnected() conforme a seguir,

source: Publishing events
it: Pubblicazione degli eventi
pt_br: Publicando eventos

source: Events are the mechanism by which devices publish data to the IoT Platform. The device controls the content of the event and assigns a name for each event it sends.
it: Gli eventi sono il meccanismo attraverso cui i dispositivi pubblicano i dati in IoT Platform. Il dispositivo controlla il contenuto dell'evento e assegna un nome per ogni evento inviato.
pt_br: Eventos são o mecanismo pelo qual dispositivos publicam dados no IoT Platform. O dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.

source: When an event is received by the IBM IoT Platform the credentials of the connection on which the event was received are used to determine from which device the event was sent. With this architecture it is impossible for a device to impersonate another device.
it: Una volta che IBM IoT Platform riceve un evento, vengono utilizzate le credenziali della connessione su cui si è ricevuto l'evento al fine di determinare da quale dispositivo l'evento è stato inviato. Con questa architettura è impossibile per un dispositivo impersonare un altro dispositivo.
pt_br: Quando um evento é recebido pelo IBM IoT Platform, as credenciais da conexão na qual o evento foi recebido são usadas para determinar a partir de qual dispositivo o evento foi enviado. Com essa arquitetura, é impossível para um dispositivo personificar outro dispositivo.

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>`__ defined by the MQTT protocol. By default events will be published as qos level 0.
it: Gli eventi possono essere pubblicati in uno qualsiasi dei tre `livelli di QoS (quality of service) <../messaging/mqtt.html#/>`__ definiti dal protocollo MQTT. Per impostazione predefinita gli eventi verranno pubblicati al livello qos 0.
pt_br: Os eventos podem ser publicados em qualquer um dos três `níveis de qualidade de serviço <../messaging/mqtt.html#/>`__ definidos pelo protocolo MQTT. Por padrão, os eventos serão publicados como qos nível 0.

source: Publish event using default quality of service
it: Pubblicare l'evento utilizzando il qos predefinito
pt_br: Publicar evento usando a qualidade de serviço padrão

source: The below sample shows how to publish various data points of LPC1768 like x,y & z axis, joystick position, current temperature reading and etc.. to IoT Platform in JSON format.
it: L'esempio di seguito riportato mostra in che modo pubblicare vari punti di dati di LPC1768 come gli assi x,y & z, la posizione del joystick, la lettura della temperatura corrente e ecc.. in IoT Platform in formato JSON.
pt_br: A amostra abaixo mostra como publicar vários pontos de dados do LPC1768 como eixos x,y e z, posição do joystick, leitura de temperatura atual e etc.. para o IoT Platform no formato JSON.

source: The complete sample can be found `here <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.
it: L'esempio completo può essere visualizzato `qui <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.
pt_br: A amostra completa pode ser encontrada `aqui <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/file/e58533b6bc6b/src/Main.cpp>`__.

source: Publish event using user-defined quality of service
it: Pubblicare l'evento utilizzando il qos definito dall'utente
pt_br: Publicar evento usando a qualidade de serviço definida pelo usuário

source: Events can be published at higher MQTT quality of service levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt. Also quickstart flow allows only Qos of 0.
it: Gli eventi possono essere pubblicati con livelli di QoS (quality of service) MQTT più elevati, ma tali eventi potrebbero impiegare più tempo rispetto a un livello di QoS pari a 0, a causa della conferma aggiuntiva della ricezione. Inoltre, il flusso quickstart consente solo livelli di Qos pari a 0.
pt_br: Os eventos podem ser publicados em níveis de serviço de qualidade de MQTT superiores, mas esses eventos podem ser mais lentos que o QoS nível 0 por causa da confirmação de recebimento extra. Além disso, o fluxo de iniciação rápida permite apenas Qos de 0.

source: Handling the connection lost error during the event publish
it: Gestione dell'errore a causa della perdita della connessione durante la pubblicazione dell'evento
pt_br: Manipulando o erro de conexão perdida durante a publicação de eventos

source: When the publishEvent() method returns false, one can check the status of the connection and call reConnect() if the connection is lost,
it: Quando il metodo publishEvent() method restituisce il valore false, è possibile verificare lo stato della connessione e chiamare reConnect() se la connessione è stata persa.
pt_br: Quando o método publishEvent() retorna false, é possível verificar o status da conexão e chamar reConnect() se a conexão for perdida,

source: The library does not store the events published during the unconnected state, and hence, the device needs to call the publishEvent() method again to send those events once the connection is reestablished.
it: La libreria non archivia gli eventi pubblicati durante lo stato Non connesso e quindi il dispositivo deve chiamare di nuovo il metodo publishEvent() per inviare questi eventi quando la connessione viene ristabilita.
pt_br: A biblioteca não armazena os eventos publicados durante o estado desconectado, portanto, o dispositivo precisa chamar o método publishEvent() novamente para enviar esses eventos depois que a conexão é restabelecida.

source: Handling commands
it: Gestione dei comandi
pt_br: Manipulando comandos

source: When the device client connects, it automatically subscribes to any commands for this device. To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
it: Quando il client del dispositivo si connette, effettua automaticamente la sottoscrizione a qualsiasi comando per questo dispositivo. Per elaborare comandi specifici è necessario registrare un metodo di callback del comando. I messaggi vengono restituiti come un'istanza della classe comando che ha le seguenti proprietà:
pt_br: Quando o cliente do dispositivo se conecta, ele automaticamente assina todos os comandos para esse dispositivo. Para processar comandos específicos, você precisa registrar um método de retorno de chamada de comando. As mensagens são retornadas como uma instância da classe Comando, que possui as seguintes propriedades:

source: command - name of the command invoked
it: command - il nome del comando richiamato
pt_br: comando - nome do comando chamado

source: format - e.g json, xml
it: format - il formato, ad es. json, xml
pt_br: formato - por exemplo, json, xml

source: payload
pt_br: carga útil

source: Following code defines a sample command callback function that processes the LED blink interval command from the application and adds the same to the DeviceClient instance.
it: Il seguente codice definisce una funzione di callback del comando di esempio che elabora il comando dell'intervallo di lampeggiamento del LED dall'applicazione e aggiunge la stessa all'istanza DeviceClient.
pt_br: O código a seguir define uma amostra de função de retorno de chamada de comando de amostra que processa o comando do intervalo intermitente de LED a partir do aplicativo e inclui o mesmo para a instância do DeviceClient.

source: The 'client.yield()' function must be called periodically to receive commands.
it: La funzione 'client.yield()' deve essere richiamata periodicamente per ricevere comandi.
pt_br: A função 'client.yield()' deve ser chamada periodicamente para receber comandos.

source: Disconnect Client
it: Disconnetti client
pt_br: Desconectar Cliente

source: To disconnect the client and release the connections, run the following code snippet.
it: Per disconnettere il client e rilasciare le connessioni, utilizzare il seguente frammento di codice.
pt_br: Para desconectar o cliente e liberar as conexões, execute o seguinte fragmento de código.

source: Samples
it: Esempi
pt_br: Amostras

source: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - A Sample code that showcases how to use IBMIoTF client library to connect the mbed LPC1768 or FRDM-K64F devices to the IBM Internet of Things Cloud service.
it: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - Un codice di esempio che mostra come utilizzare la libreria client IBMIoTF per connettere i dispositivi LPC1768 o FRDM-K64F mbed al servizio Cloud di IBM Internet of Things.
pt_br: `IBMIoTClientLibrarySample <https://developer.mbed.org/teams/IBM_IoT/code/IBMIoTClientLibrarySample/>`__ - Um código de amostra que demonstra como usar a biblioteca do cliente IBMIoTF para conectar os dispositivos mbed LPC1768 ou FRDM-K64F ao serviço do IBM Internet of Things Cloud.
