Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/device_model.po
Languages: it, ja, zh_cn, zh_tw

source: Device Model
it: Modello dispositivo
ja: デバイス・モデル
zh_cn: 设备模型
zh_tw: 裝置模型

source: The device model describes the metadata and management characteristics of a device. The device database in the Watson IoT platform is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the Watson IoT platform, the device database is updated, making the information available to applications.
it: Il modello dispositivo descrive le caratteristiche di gestione e metadati di un dispositivo. Il database del dispositivo in Watson IoT platform è l'origine principale delle informazioni sul dispositivo. Le applicazioni e i dispositivi gestiti sono in grado di inviare aggiornamenti al database come un'ubicazione o l'avanzamento di un aggiornamento firmware. Una volta che Watson IoT platform ha ricevuto questi aggiornamenti, il database del dispositivo viene aggiornato, rendendo le informazioni disponibili alle applicazioni.
ja: デバイス・モデルとは、デバイスのメタデータおよび管理特性を記述するものです。Watson IoT Platform において、デバイス・データベースはデバイス情報のマスター・ソースです。アプリケーションおよび管理対象デバイスは、場所やファームウェア更新の進行状況などの更新情報をデータベースに送信できます。Watson IoT Platform がこのような更新情報を受け取ると、デバイス・データベースが更新され、アプリケーションでそれらの情報を使用できるようになります。
zh_cn: 设备模型描述了设备的元数据和管理特征。Watson IoT Platform 中的设备数据库是设备信息的主要来源。应用程序和受管设备可以向数据库发送更新（例如，位置或固件更新进度）。Watson IoT Platform 收到这些更新后，设备数据库将进行更新，这样，应用程序便可以使用这些信息。
zh_tw: 裝置模型說明裝置的 meta 資料及管理性質。Watson IoT Platform 中的裝置資料庫是裝置資訊的主要來源。應用程式及受管理裝置能夠傳送更新至資料庫，如：位置或韌體更新的進度。Watson IoT Platform 接收到這些更新之後，即會更新裝置資料庫，讓資訊可供應用程式使用。

source: With the exception of the management extension, the entire device model is available for both managed and unmanaged devices. However, an unmanaged device can not directly update its device model in the database.
it: Ad eccezione dell'estensione di gestione, l'intero modello dispositivo è disponibile per entrambi i dispositivi gestiti e non gestiti. Tuttavia, un dispositivo non gestito non può aggiornare direttamente il suo modello di dispositivo nel database.
ja: 管理拡張を除き、デバイス・モデルはすべて、管理対象デバイスでも非管理対象デバイスでも使用可能です。ただし、非管理対象デバイスからデータベース内のデバイス・モデルを直接更新することはできません。
zh_cn: 除了管理扩展外，受管设备和非受管设备都可以使用整个设备模型。但是，非受管设备不能直接在数据库中更新其设备模型。
zh_tw: 除了管理延伸規格外，整個裝置模型都可供受管理及未受管理的裝置使用。不過，未受管理的裝置無法直接更新其在資料庫中的裝置模型。

source: Device Identification
it: Identificazione dispositivo
ja: デバイス ID
zh_cn: 设备标识
zh_tw: 裝置識別

source: Every device has a typeId and deviceId attribute. Typically, the typeId represents the model of your device, whilst the deviceId can represent its serial number. Within your Watson IoT platform organization, the combination of typeId and deviceId must be unique for each device.
it: Ciascun dispositivo dispone di un attributo typeId e deviceId. Generalmente, il typeId rappresenta il modello del dispositivo, mentre il deviceId può rappresentare il suo numero di serie. Nell'ambito dell'organizzazione Watson IoT platform, la combinazione di typeId e deviceId deve essere univoca per ogni dispositivo.
ja: すべてのデバイスには typeId 属性と deviceId 属性があります。通常、typeId はデバイスのモデルを表し、deviceId はデバイスのシリアル番号を表します。typeId および deviceId の組み合わせは、Watson IoT Platform 組織内で、デバイスごとに固有である必要があります。
zh_cn: 每个设备都具有 typeId 和 deviceId 属性。通常，typeId 表示设备的型号，deviceId 表示其序列号。在 Watson IoT Platform 组织内，typeId 和 deviceId 的组合对于每个设备必须唯一。
zh_tw: 每一個裝置都有 typeId 及 deviceId 屬性。一般而言，typeId 代表裝置的型號，而 deviceId 可代表其序號。在 Watson IoT Platform 組織內，每一個裝置的 typeId 及 deviceId 的組合都必須是唯一的。

source: In addition, the Watson IoT platform constructs a further identifier for each device based on your organizationId, the device's typeId and the device's deviceId. This identifier - the clientId - allows you to identify unequivocally an individual device.
it: Inoltre, Watson IoT platform crea un ulteriore identificativo per ogni dispositivo in base a organizationId, typeId e deviceId del dispositivo. Questo identificativo – il clientId – consente di identificare inequivocabilmente un singolo dispositivo.
ja: さらに、Watson IoT Platform は、organizationId、デバイスの typeId および deviceId に基づいて各デバイスの ID を作成します。この ID (clientId) により、個別のデバイスを明確に識別できます。
zh_cn: 此外，Watson IoT Platform 根据您的 organizationId、设备的 typeId 和设备的 deviceId 为每个设备另外构造一个标识。此标识 (clientId) 使您能够明确地识别单个设备。
zh_tw: 此外，Watson IoT Platform 會根據您的 organizationId、裝置的 typeId 及裝置的 deviceId，進一步建構每一個裝置的 ID。這個 ID - clientId - 可讓您明確地識別個別裝置。

source: The characters which can be used in these identifiers are restricted so they can be used straightforwardly in communication protocols and REST APIs. There are a number of optional device identifiers for use with the device management protocol. These identifiers are:
it: I caratteri che è possibile utilizzare in questi identificativi sono limitati, così possono essere utilizzati con sicurezza in protocolli di comunicazione e API REST. Ci sono una serie di identificativi di dispositivo facoltativi da utilizzare con il protocollo di gestione dispositivo. Questi identificativi sono:
ja: 通信プロトコルおよび REST API でそのまま使用できるように、これらの ID で使用可能な文字は制限されています。デバイス管理プロトコルで使用するためのオプションのデバイス ID が数多く存在します。それらの ID を以下に示します。
zh_cn: 这些标识中可使用的字符受到限制，因此可以在通信协议和 REST API 中直接使用这些标识。下面是一些可用于设备管理协议的可选设备标识。这些标识包括：
zh_tw: 在這些 ID 中可使用的字元有限，因此可在通訊協定及 REST API 中直接使用。有許多選用的裝置 ID 可與裝置管理通訊協定搭配使用。這些 ID 如下：

source: For more information on the identifiers and descriptions of their comparative identifiers in other device management standards, see Device Model Attributes Reference.
it: Per ulteriori informazioni sugli identificativi e le descrizioni dei loro identificativi comparativi in altri standard di gestione dispositivo, consultare il riferimento Attributi modello dispositivo.
ja: ID の詳細および他のデバイス管理規格の同等の ID については、「デバイス・モデルの属性参照」を参照してください。
zh_cn: 有关这些标识的更多信息以及有关它们在其他设备管理标准中的同等标识的描述，请参阅《设备模型属性参考》。
zh_tw: 如需 ID 以及在其他裝置管理標準中的比較 ID 的說明，請參閱「裝置模型屬性參考手冊」。

source: Identifiers and Device Type
it: Identificativi e tipo di dispositivo
ja: ID とデバイス・タイプ
zh_cn: 标识和设备类型
zh_tw: ID 與裝置類型

source: Each device connected to the Watson IoT platform is associated with a device type. Device types are intended to be groups of devices which share characteristics or behaviour.
it: Ogni dispositivo connesso a Watson IoT platform viene associato ad un tipo di dispositivo. I tipi di dispositivo sono gruppi di dispositivi che condividono le stesse caratteristiche o comportamento.
ja: Watson IoT Platform に接続されたデバイスはすべて、デバイス・タイプと関連付けられます。デバイス・タイプとは、特性や振る舞いが同じデバイスをグループ化するためのものです。
zh_cn: 连接到 Watson IoT Platform 的每个设备都与设备类型关联。设备类型是具有相同特征或行为的设备组。
zh_tw: 每一個連接至 Watson IoT Platform 的裝置都會與一種裝置類型相關聯。裝置類型是指共用性質或行為的裝置群組。

source: A device type has a set of attributes. When a device is added to the Watson IoT platform, the attributes in its device type are used as a template overridden by device-specific attributes. For example, the device type could have a value for the ``deviceInfo.fwVersion`` attribute reflecting the firmware version at the time of manufacture, and this value would be copied from the device type into the devices as they are added. However, if a device was added which already had a value for ``deviceInfo.fwVersion``, it would not be overridden by the device type.
it: Un tipo di dispositivo dispone di una serie di attributi. Quando viene aggiunto un dispositivo a Watson IoT platform, gli attributi nel relativo tipo di dispositivo vengono utilizzati come un modello sostituito da attributi specifici del dispositivo. Ad esempio, il tipo di dispositivo può avere un valore per l'attributo ``deviceInfo.fwVersion`` che riflette la versione del firmware al momento della produzione, e questo valore sarà copiato dal tipo di dispositivo ai dispositivi quando vengono aggiunti. Tuttavia, se è stato aggiunto un dispositivo che aveva già un valore per ``deviceInfo.fwVersion``, non viene sostituito dal tipo di dispositivo.
ja: デバイス・タイプには一連の属性があります。デバイスを Watson IoT Platform に追加すると、そのデバイス・タイプの属性がテンプレートとして使用されます (これらはデバイス固有の属性によって上書きされます)。例えば、デバイス・タイプに、製造時のファームウェア・バージョンを表す ``deviceInfo.fwVersion`` 属性の値があり、デバイスの追加時にこの値がデバイス・タイプからデバイスにコピーされるとします。ただし、``deviceInfo.fwVersion`` の値を既に持つデバイスが追加された場合に、デバイス・タイプがその値を上書きすることはありません。
zh_cn: 设备类型具有一组属性。向 Watson IoT Platform 添加设备时，其设备类型中的属性用作设备特定属性覆盖的模板。例如，设备类型的“deviceInfo.fwVersion”属性可以有一个值来反映制造时的固件版本，在添加设备时此值将从设备类型复制到设备中。但是，如果所添加设备的“deviceInfo.fwVersion”属性已有一个值，那么该属性就不会被设备类型覆盖。
zh_tw: 裝置類型有一組屬性。當裝置新增至 Watson IoT Platform 時，其裝置類型中的屬性會用來作為範本，再置換成裝置專屬的屬性。例如，裝置類型可以有 ``deviceInfo.fwVersion`` 屬性的值，反映製造時的韌體版本；這個值可能是在新增裝置時，從裝置類型複製到裝置中。不過，如果新增裝置時，其已經有 ``deviceInfo.fwVersion`` 的值，則不會被裝置類型置換掉。

source: When a device type is updated, future registered devices will reflect the modified device type template. However, existing devices of this device type are unaffected and remain unchanged.
it: Quando un tipo di dispositivo viene aggiornato, i futuri dispositivi registrati rifletteranno il modello del tipo di dispositivo modificato. Tuttavia, i dispositivi esistenti di questo tipo di dispositivo non vengono influenzati e restano immutati.
ja: デバイス・タイプが更新されると、将来登録されるデバイスには、変更されたデバイス・タイプのテンプレートが反映されます。ただし、そのデバイス・タイプの既存のデバイスは影響を受けず、変更されることはありません。
zh_cn: 更新设备类型后，将来注册的设备将反映出修改后的设备类型模板。但是，此设备类型的现有设备将不受影响并保持不变。
zh_tw: 當裝置類型更新時，未來登錄的裝置將會反映修改後的裝置類型範本。不過，這種裝置類型的現有裝置並不受影響，而且會維持不變。

source: Attributes
it: Attributi
ja: 属性
zh_cn: 属性
zh_tw: 屬性

source: The table below shows the list of attributes which can apply to devices in the Watson IoT platform. Additionally, italicized attributes can also apply to device types.
it: La tabella riportata di seguito mostra l'elenco di attributi che è possibile applicare ai dispositivi in Watson IoT platform. Inoltre, anche gli attributi in corsivo possono essere applicati ai tipi di dispositivo.
ja: 下の表は、Watson IoT Platform でデバイスに適用できる属性のリストを示しています。さらに、イタリック体の属性はデバイス・タイプにも適用できます。
zh_cn: 下表显示可应用于 Watson IoT Platform 中的设备的属性列表。此外，以斜体显示的属性还可适用于设备类型。
zh_tw: 下表顯示可在 Watson IoT Platform 中套用至裝置的屬性清單。此外，以斜體表示的屬性也可套用至裝置類型。

source: API/DMA: Can be updated by API/Device Management Agent
it: API/AGD: Può essere aggiornato da API/Agent gestione dispositivo
ja: API/DMA: API/デバイス管理エージェントによって更新可能
zh_cn: API/DMA：可由 API/设备管理代理程序更新
zh_tw: API/DMA：可透過 API/裝置管理代理程式更新

source: R: Read only
it: R: Sola lettura
ja: R: 読み取り専用
zh_cn: R：只读
zh_tw: R：唯讀

source: W: Write and read
it: W: Scrittura e lettura
ja: W: 読み取りおよび書き込み
zh_cn: W：读写
zh_tw: W：讀寫

source: A: Append
it: A: Accoda
ja: A: 付加
zh_cn: A：附加
zh_tw: A：附加

source: Attribute
it: Attributo
ja: 属性
zh_cn: 属性
zh_tw: 屬性

source: Type
it: Tipo
ja: タイプ
zh_cn: 类型
zh_tw: 類型

source: Description
it: Descrizione
ja: 説明
zh_cn: 描述
zh_tw: 說明

source: string
it: stringa
ja: 文字列
zh_cn: 字符串
zh_tw: 字串

source: The client ID used with MQTT connections
it: L'ID client utilizzato con le connessioni MQTT
ja: MQTT 接続で使用されるクライアント ID
zh_cn: 用于 MQTT 连接的客户机标识
zh_tw: 與 MQTT 連線搭配使用的用戶端 ID

source: Device type
it: Tipo di dispositivo
ja: デバイス・タイプ
zh_cn: 设备类型
zh_tw: 裝置類型

source: Device ID
it: ID dispositivo
ja: デバイス ID
zh_cn: 设备标识
zh_tw: 裝置 ID

source: Class of device ("Device" or "Gateway")
it: Classe del dispositivo ("Device" o "Gateway")
ja: デバイスのクラス (「デバイス」または「ゲートウェイ」)
zh_cn: 设备的类（“设备”或“网关”）
zh_tw: 裝置的類別（「裝置」或「閘道」）

source: Type ID of the gateway this device is using
it: ID tipo del gateway che il dispositivo sta utilizzando
ja: このデバイスが使用するゲートウェイのタイプ ID
zh_cn: 此设备使用的网关的类型标识
zh_tw: 此裝置正在使用之閘道的類型 ID

source: Device ID of the gateway this device is using
it: ID dispositivo del gateway che questo dispositivo sta utilizzando
ja: このデバイスが使用するゲートウェイのデバイス ID
zh_cn: 此设备使用的网关的设备标识
zh_tw: 此裝置正在使用之閘道的裝置 ID

source: boolean
ja: ブール値
zh_cn: 布尔型
zh_tw: 布林

source: Whether the device has an alert
it: Se il dispositivo ha un avviso
ja: デバイスにアラートが存在するかどうか
zh_cn: 设备是否有警报
zh_tw: 裝置是否有警示

source: The serial number of the device
it: Il numero di serie del dispositivo
ja: デバイスのシリアル番号
zh_cn: 设备的序列号
zh_tw: 裝置的序號

source: The manufacturer of the device
it: Il produttore del dispositivo
ja: デバイスの製造メーカー
zh_cn: 设备的制造商
zh_tw: 裝置的製造商

source: The model of the device
it: Il modello del dispositivo
ja: デバイスのモデル
zh_cn: 设备的型号
zh_tw: 裝置的型號

source: The class of the device
it: La classe del dispositivo
ja: デバイスのクラス
zh_cn: 设备的种类
zh_tw: 裝置的類別

source: The descriptive name of the device
it: Il nome descrittivo del dispositivo
ja: デバイスの記述名
zh_cn: 设备的描述性名称
zh_tw: 裝置的敘述性名稱

source: The firmware version currently known to be on the device
it: La versione del firmware che correntemente è noto sia sul dispositivo
ja: デバイスの現在既知のファームウェア・バージョン
zh_cn: 设备上当前已知的固件版本
zh_tw: 裝置上目前已知的韌體版本

source: The hardware version of the device
it: La versione hardware del dispositivo
ja: デバイスのハードウェア・バージョン
zh_cn: 设备的硬件版本
zh_tw: 裝置的硬體版本

source: The descriptive location, such as a room or building number, or a geopgraphical region
it: L'ubicazione descrittiva, ad esempio un numero di stanza o edificio, o un'area geografica
ja: 部屋番号や建物番号、地理的領域などの場所の説明
zh_cn: 描述性位置（例如，房间号、建筑物门牌号或地理区域）
zh_tw: 敘述性位置（如：房間號碼或門牌號碼），或地理區域

source: complex
it: complesso
ja: 複合
zh_tw: 複式

source: Free-form metadata
it: Metadati in formato libero
ja: フリー・フォームのメタデータ
zh_cn: 自由格式元数据
zh_tw: 開放式 meta 資料

source: ID that added the device
it: ID che ha aggiunto il dispositivo
ja: デバイスを追加した ID
zh_cn: 添加此设备时所用的标识
zh_tw: 新增裝置的 ID

source: ISO8601 date-time: Date and time the device was added
it: Data-ora ISO8601: La data e l'ora in cui il dispositivo è stato aggiunto
ja: ISO8601 日時: デバイスが追加された日時
zh_cn: ISO8601 日期时间：添加设备时的日期和时间
zh_tw: ISO8601 日期時間：新增裝置的日期和時間

source: URI of diag extension for error codes, if present
it: L'URI dell'estensione diag per codici di errore, se presente
ja: エラー・コードの診断拡張の URI (存在する場合)
zh_cn: 错误代码诊断扩展的 URI（如果有）
zh_tw: 錯誤碼的診斷延伸規格 URI（如果存在的話）

source: URI of diag extension for logs, if present
it: L'URI dell'estensione diag per log, se presente
ja: ログの診断拡張の URI (存在する場合)
zh_cn: 日志诊断扩展的 URI（如果有）
zh_tw: 日誌的診斷延伸規格 URI（如果存在的話）

source: URI of location extension, if present
it: L'URI dell'estensione ubicazione, se presente
ja: ロケーション拡張の URI (存在する場合)
zh_cn: 位置扩展的 URI（如果有）
zh_tw: 位置延伸規格的 URI（如果存在的話）

source: URI of mgmt extension, is present
it: L'URI dell'estensione mgmt, se presente
ja: 管理拡張の URI (存在する場合)
zh_cn: mgmt 扩展的 URI（如果有）
zh_tw: 管理延伸規格的 URI（如果存在的話）

source: Extended Attributes
it: Attributi estesi
ja: 拡張属性
zh_cn: 扩展属性
zh_tw: 延伸屬性

source: In addition to core attributes listed above, there are additional attributes which are treated as extensions to the core device model. Simple queries about the device return information from the core device model, but not the extensions. Information from the extensions must be specifically requested.
it: Oltre agli attributi principali elencati in precedenza, vi sono ulteriori attributi che vengono trattati come estensioni del modello di dispositivo principale. Query semplici sul dispositivo restituiscono informazioni dal modello di dispositivo principale, ma non le estensioni. Le informazioni dalle estensioni devono essere specificamente richieste.
ja: 上記のコア属性に加えて、コア・デバイス・モデルの拡張として扱われる追加属性があります。デバイスに関する簡単な照会では、このような拡張ではなくコア・デバイス・モデルの情報が返されます。拡張の情報は、特別な方法で要求する必要があります。
zh_cn: 除了上述核心属性外，还提供了一些其他属性，这些属性可视为是对核心设备模型的扩展。关于设备的简单查询将返回核心设备模型（而不是扩展）中的信息。必须发出专门的请求，才会返回扩展中的信息。
zh_tw: 除了上述核心屬性之外，還有其他屬性也被視為核心裝置模型的延伸規格。與裝置相關的簡單查詢會從核心裝置模型傳回資訊，但不會傳回延伸規格。來自延伸規格的資訊必須明確要求。

source: Extension Name
it: Nome estensione
ja: 拡張名
zh_cn: 扩展名
zh_tw: 延伸名稱

source: Prefix of attributes
it: Prefisso di attributi
ja: 属性の接頭部
zh_cn: 属性前缀
zh_tw: 屬性的字首

source: Purpose
it: Scopo
ja: 目的
zh_cn: 用途
zh_tw: 目的

source: Diagnostics
it: Diagnostica
ja: 診断
zh_cn: 诊断
zh_tw: 診斷

source: diag
zh_cn: 诊断
zh_tw: 診斷

source: Error logs and diagnostic information
it: Log degli errori e informazioni di diagnostica
ja: エラー・ログおよび診断情報
zh_cn: 错误日志和诊断信息
zh_tw: 錯誤日誌與診斷資訊

source: Location
it: Ubicazione
ja: ロケーション
zh_cn: 位置
zh_tw: 位置

source: location
it: ubicazione
zh_cn: 位置
zh_tw: 位置

source: Location of the device, potentially updated regularly
it: L'ubicazione della periferica, potenzialmente aggiornata regolarmente
ja: デバイスの場所 (定期的に更新される可能性がある)
zh_cn: 设备位置（可能会定期更新）
zh_tw: 裝置的位置，可能會定期更新

source: Device management
it: Gestione dispositivo
ja: デバイス管理
zh_cn: 设备管理
zh_tw: 裝置管理

source: mgmt
zh_tw: 管理

source: Device management actions, e.g. firmware update
it: Azioni di gestione dispositivo, ad esempio aggiornamento firmware
ja: デバイス管理アクション (ファームウェア更新など)
zh_cn: 设备管理操作（如固件更新）
zh_tw: 裝置管理動作，例如：韌體更新

source: Diagnostics Extension
it: Estensione diagnostica
ja: 診断拡張
zh_cn: 诊断扩展
zh_tw: 診斷延伸規格

source: The diagnostics attributes are optional, and only present for devices with error log information. These attributes are intended for diagnosing device problems, not troubleshooting connectivity to the Watson IoT platform. In order to retrieve the information in these attributes, it must be queried separately, because the information stored in these attributes could potentially be very large.
it: Gli attributi di diagnostica sono facoltativi e presenti solo per i dispositivi con informazioni di log degli errori. Questi attributi sono pensati per la diagnosi dei problemi del dispositivo, non per la risoluzione dei problemi di connettività a Watson IoT platform. Per poter richiamare le informazioni in questi attributi, devono essere interrogate separatamente, perché le informazioni memorizzate in tali attributi possono essere molto grandi.
ja: 診断属性はオプションであり、エラー・ログ情報が存在するデバイスにのみ存在します。これらの属性は、Watson IoT Platform への接続をトラブルシューティングするためではなく、デバイスの問題を診断するためのものです。これらの属性の情報を取得するには、属性を個別に照会する必要があります。これらの属性に保管されている情報は非常に大きい可能性があるためです。
zh_cn: 诊断属性为可选属性，而且只能用于包含错误日志信息的设备。这些属性旨在诊断设备问题，而不是对到 Watson IoT Platform 的连接进行故障诊断。要检索这些属性中的信息，必须单独进行查询，因为这些属性中可能存储了大量的信息。
zh_tw: 診斷屬性是選用的，只有含錯誤日誌資訊的裝置有這些屬性。這些屬性的目的是要診斷裝置問題，而非針對 Watson IoT Platform 的連線功能進行疑難排解。為了擷取這些屬性中的資訊，其必須分開查詢，因為這些屬性中儲存的資訊可能非常大。

source: Diagnostic log information is an array of entries which can have entries appended using an API, however, this can cause earlier entries to be lost, to keep the size of diagnostic logs manageable. Each entry consists of a message, an indication of severity, a timestamp and an optional byte-array of data.
it: Le informazioni del log di diagnostica sono una schiera di voci che possono avere voci accodate utilizzando l'API, tuttavia, ciò può provocare la perdita di voci precedenti, al fine di mantenere gestibile la dimensione dei log di diagnostica. Ogni voce consiste di un messaggio, un'indicazione di severità, una registrazione data/ora e una schiera byte di dati facoltativa.
ja: 診断ログ情報は、API を使用して付加できる項目を持つ配列ですが、付加すると、診断ログを管理可能なサイズに維持するために古い項目が失われる可能性があります。各項目には、メッセージ、重大度の目安、タイム・スタンプ、およびオプションでデータのバイト配列が含まれます。
zh_cn: 诊断日志信息是一个由众多条目组成的数组，它可以包含使用 API 附加的条目，但是，为了便于管理诊断日志的大小，可能会丢失较早的条目。每个条目均由消息、严重性指示符、时间戳记和可选的数据字节数组组成。
zh_tw: 診斷日誌資訊是個項目的陣列，其可利用 API 來附加項目；不過，這可能會導致之前的項目遺失，使得診斷日誌維持在可管理的大小。每一個項目都包含一則訊息、嚴重性指示、時間戳記，以及選用的資料位元組陣列。

source: array of integer(s)
it: schiera di numeri interi
ja: 整数の配列
zh_cn: 整数数组
zh_tw: 整數的陣列

source: Array of error codes
it: Schiera di codici di errore
ja: エラー・コードの配列
zh_cn: 错误代码数组
zh_tw: 錯誤碼的陣列

source: array
it: schiera
ja: 配列
zh_cn: 数组
zh_tw: 陣列

source: Array of diagnostic data
it: Schiera di dati diagnostici
ja: 診断データの配列
zh_cn: 诊断数据数组
zh_tw: 診斷資料的陣列

source: Diagnostic message
it: Messaggio di diagnostica
ja: 診断メッセージ
zh_cn: 诊断消息
zh_tw: 診斷訊息

source: ISO8601 date-time: Date and time of log entry
it: Data-ora ISO8601: La data e l'ora della voce di log
ja: ISO8601 日時: ログ・エントリーの日時
zh_cn: ISO8601 日期时间：日志条目的日期和时间
zh_tw: ISO8601 日期時間：日誌項目的日期和時間

source: byte: Diagnostic data, base-64 encoded
it: byte: dati diagnostici, codificato base-64
ja: byte: 診断データ、Base 64 エンコード
zh_cn: 字节：诊断数据，Base-64 编码
zh_tw: 位元組：診斷資料，Base-64 編碼

source: number
it: numero
ja: 数値
zh_cn: 数字
zh_tw: 數字

source: Severity of message, 0: informational, 1: warning, 2: error
it: Severità del messaggio, 0: informativo, 1: avvertenza, 2: errore
ja: メッセージの重大度。0: 通知、1: 警告、2: エラー
zh_cn: 消息的严重性（0：参考，1：警告，2：错误）
zh_tw: 訊息嚴重性，0：參考資訊，1：警告，2：錯誤

source: Location Extension
it: Estensione ubicazione
ja: ロケーション拡張
zh_cn: 位置扩展
zh_tw: 位置延伸規格

source: These attributes are optional and only present for devices with location information. The location information is stored separately in order to allow the use of storage mechanisms better suited to dynamic information in the event of frequently updated information, for example, in the case of a mobile device.
it: Questi attributi sono facoltativi e presenti solo per i dispositivi con informazioni di ubicazione. Le informazioni di ubicazione vengono archiviate separatamente per consentire l'uso di meccanismi di archiviazione più adatti alle informazioni dinamiche in caso di informazioni aggiornate di frequente, ad esempio, nel caso di un dispositivo mobile.
ja: これらの属性はオプションであり、ロケーション情報を持つデバイスにのみ存在します。ロケーション情報は、モバイル・デバイスなどのように情報が頻繁に更新される場合に、動的な情報に適したストレージ・メカニズムを使用できるように、個別に保管されます。
zh_cn: 这些属性为可选属性，而且只能用于包含位置信息的设备。位置信息都单独进行存储，其目的是为了能够使用更适合动态信息（当频繁更新信息时，例如使用移动设备时）的存储机制。
zh_tw: 這些屬性是選用的，只有含位置資訊的裝置有這些屬性。位置資訊會分開儲存，以讓使用儲存體機制時更適合經常更新的動態資訊，例如：行動式裝置的資訊。

source: For solutions which place significant importance on frequent location updates, it is expected that the location would be treated as part of the device's event payload, enabling higher update rates, simple historical storage, and analytics.
it: Per soluzioni che pongono significativa importanza su frequenti aggiornamenti di ubicazione, è previsto che l'ubicazione sia trattata come parte del payload eventi del dispositivo, consentendo maggiore velocità di aggiornamento, spazio di archiviazione cronologica semplice e analisi.
ja: 頻繁にロケーションを更新することが重要なソリューションでは、ロケーションをデバイスのイベント・ペイロードの一部として扱う必要があります。これにより、更新頻度を上げ、履歴保管や分析を単純化できます。
zh_cn: 对于侧重于处理频繁位置更新的解决方案，位置将被视为是设备事件有效内容的一部分，从而提高更新率、简化历史存储并支持分析。
zh_tw: 如果經常更新位置非常重要，解決方案是位置應該被視為裝置事件內容的一部分，以提高更新率、簡化儲存歷程以及分析。

source: Longitude in decimal degrees using WGS84
it: Longitudine in gradi decimali utilizzando WGS84
ja: WGS84 を使用した経度 (10 進度数)
zh_cn: 使用 WGS84 的经度（以十进制度为单位）
zh_tw: 經度，使用 WGS84 的十進位制

source: Latitude in decimal degrees using WGS84
it: Latitudine in gradi decimali utilizzando WGS84
ja: WGS84 を使用した緯度 (10 進度数)
zh_cn: 使用 WGS84 的纬度（以十进制度为单位）
zh_tw: 緯度，使用 WGS84 的十進位制

source: Elevation in metres using WGS84
it: Altitudine in metri utilizzando WGS84
ja: WGS84 を使用した高度 (メートル)
zh_cn: 使用 WGS84 的海拔高度（以米为单位）
zh_tw: 海拔高度，使用 WGS84 的公尺數

source: ISO8601 date-time: Date and time of location measurement
it: Data-ora ISO8601: La data e l'ora della misurazione ubicazione
ja: ISO8601 日時: ロケーション測定の日時
zh_cn: ISO8601 日期时间：位置的测量日期和时间
zh_tw: ISO8601 日期時間：測量位置的日期和時間

source: ISO8601 date-time: Date and time
it: Data-ora ISO8601: La data e l'ora
ja: ISO8601 日時: 日時
zh_cn: ISO8601 日期时间：日期和时间
zh_tw: ISO8601 日期時間：日期和時間

source: Accuracy of the position in metres
it: Accuratezza della posizione in metri
ja: 位置の精度 (メートル)
zh_cn: 位置的精度（以米为单位）
zh_tw: 位置的正確性（公尺）

source: Device Management Extension
it: Estensione Gestione dispositivo
ja: デバイス管理拡張
zh_cn: 设备管理扩展
zh_tw: 裝置管理延伸規格
