Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/device_model.po
Languages: it, ja, zh_cn, zh_tw

source: The ``mgmt.`` attributes are only present for managed devices. When a managed device becomes dormant, it becomes unmanaged and the ``mgmt.`` attributes are deleted. The ``mgmt.`` attributes are set by the Watson IoT platform as a result of processing device management requests. These attributes cannot be directly written using the API.
it: Gli attributi ``mgmt.`` sono presenti solo per i dispositivi gestiti. Quando un dispositivo gestito diventa inattivo, esso diventa non gestito e gli attributi ``mgmt.`` sono eliminati. Attributo ``mgmt.`` gli attributi vengono impostati da Watson IoT platform come risultato dell'elaborazione delle richieste di gestione dispositivo. Questi attributi non possono essere scritti direttamente utilizzando l'API.
ja: ``mgmt.`` 属性は管理対象デバイスにのみ存在します。管理対象デバイスが休止されると、そのデバイスは非管理対象になり、``mgmt.`` 属性は削除されます。``mgmt.`` 属性は、デバイス管理リクエストを処理した結果として Watson IoT Platform によって設定されます。この属性を API を使用して直接作成することはできません。
zh_cn: “mgmt.”属性只能用于受管设备。受管设备在停止后会变为非受管设备，“mgmt.”属性将被删除。处理设备管理请求后，Watson IoT Platform 会设置“ mgmt.”属性。不能使用 API 直接写入这些属性。
zh_tw: 只有受管理裝置有 ``mgmt.`` 屬性。當受管理裝置變成休眠時，即成為未受管理的裝置，並會刪除 ``mgmt.`` 屬性。在處理裝置管理要求之後，Watson IoT Platform 即會設定 ``mgmt.`` 屬性。這些屬性不能直接使用 API 撰寫。

source: Devices have a management lifecycle, defined by their status as managed devices. The device management agent on the device is responsible for sending a Manage Device request using the device management protocol. To deal with defunct devices in large device populations, a managed device can be set to send a Manage Device request regularly, allowing the Watson IoT platform to notice when a device has become dormant. To facilitate this functionality, the Manage Device request has an optional lifetime parameter, When the Watson IoT platform receives a Manage Device request with a lifetime, it calculates the time before which another Manage Device request is required and stores it in the "mgmt.dormantDateTime" attribute.
it: I dispositivi dispongono di un ciclo di vita di gestione, definito dal loro stato come dispositivi gestiti. L'agent di gestione dispositivo sul dispositivo è responsabile dell'invio di una richiesta Gestisci dispositivo utilizzando il protocollo di gestione dispositivo. Per gestire dispositivi inattivi in vasti insiemi di dispositivi, è possibile impostare un dispositivo gestito per inviare regolarmente una richiesta Gestisci dispositivo, consentendo a Watson IoT platform di rilevare quando un dispositivo è divenuto inattivo. Per facilitare questa funzionalità, la richiesta Gestisci dispositivo dispone di un parametro facoltativo di durata. Quando Watson IoT platform riceve una richiesta del tipo Gestisci dispositivo con una durata, calcola il tempo prima del quale avviene un'altra richiesta simile e lo memorizza nell'attributo "mgmt.dormantDateTime".
ja: デバイスには、管理対象デバイスのステータスで定義される管理ライフサイクルがあります。デバイス管理プロトコルを使用して「デバイスを管理」リクエストを送信するのは、デバイス上のデバイス管理エージェントです。デバイスが多数存在する環境で機能不良デバイスに対処するために、「デバイスを管理」リクエストを定期的に送信するように管理対象デバイスを設定することができます。これにより、デバイスが休止したことを Watson IoT Platform が検知できるようになります。この機能を活用するために、「デバイスを管理」リクエストにはオプションのライフタイム・パラメーターが用意されています。Watson IoT Platform は、ライフタイムが指定された「デバイスを管理」リクエストを受け取ると、次の「デバイスを管理」リクエストが必要になるまでの時間を計算し、その時間を "mgmt.dormantDateTime" 属性に保管します。
zh_cn: 设备有一个管理生命周期，按其状态被定义为受管设备。设备上的设备管理代理程序负责使用设备管理协议发送“管理设备”请求。要在设备众多的情况下处理失效的设备，可以将受管设备设置为定期发送“管理设备”请求，从而使 Watson IoT Platform 能够在设备休眠时发出通知。为促进此功能，“管理设备”请求具有可选的生命周期参数，当 Watson IoT Platform 接收到具有生命周期的“管理设备”请求时，它会计算需要另一个“管理设备”请求之前的时间，并将此时间存储在“mgmt.dormantDateTime”属性中。
zh_tw: 裝置有管理生命週期，並依照其狀態定義為受管理裝置。裝置上的裝置管理代理程式會負責使用裝置管理通訊協定來傳送「管理裝置」要求。若要處理大量裝置群中已失效的裝置，可以設定受管理裝置來定期傳送「管理裝置」要求，讓 Watson IoT Platform 注意到裝置已變成休眠。為了方便執行這項功能，「管理裝置」要求有一個選用的生命期限參數；當 Watson IoT Platform 接收到含有生命期限的「管理裝置」要求時，其會計算需要另一個「管理裝置」要求之前的時間，並將它儲存在 "mgmt.dormantDateTime" 屬性中。

source: Whether the device has become dormant
it: Se il dispositivo è diventato inattivo
ja: デバイスが休止になったかどうか
zh_cn: 设备是否已停止
zh_tw: 裝置是否已變成休眠

source: ISO8601 date-time: Date and time at which the managed device will become dormant
it: Data-ora ISO8601: La data e l'ora in cui il dispositivo gestito diventerà inattivo
ja: ISO8601 日時: 管理対象デバイスが休止になる日時
zh_cn: ISO8601 日期时间：受管设备变为停止的日期和时间
zh_tw: ISO8601 日期時間：受管理裝置變成休眠的日期和時間

source: ISO8601 date-time: Date and time of last activity, updated periodically
it: Data-ora ISO8601: La data e l'ora dell'ultima attività, aggiornata periodicamente
ja: ISO8601 日時: 最後のアクティビティーの日時 (定期的に更新される)
zh_cn: ISO8601 日期时间：上一次定期更新活动的日期和时间
zh_tw: ISO8601 日期時間：前次活動的日期和時間，定期更新

source: Whether the device supports Reboot and Factory Reset actions
it: Indica se il dispositivo supporta le azioni Riavvia e Reimpostazione alle impostazioni di fabbrica
ja: デバイスがリブートおよび工場出荷時設定へのリセットのアクションをサポートするかどうか
zh_cn: 设备是否支持“重新引导”和“恢复工厂设置”操作
zh_tw: 裝置是否支援「重新啟動」及「重設為原廠設定」動作

source: Whether the device supports Firmware Download and Firmware Update actions
it: Indica se il dispositivo supporta le azioni Scaricamento firmware e Aggiornamento firmware
ja: デバイスがファームウェア・ダウンロードおよびファームウェア更新のアクションをサポートするかどうか
zh_cn: 设备是否支持“固件下载”和“固件更新”操作
zh_tw: 裝置是否支援「韌體下載」及「韌體更新」動作

source: The version of the firmware on the device
it: La versione del firmware sul dispositivo
ja: デバイスのファームウェア・バージョン
zh_cn: 设备上的固件版本
zh_tw: 裝置上的韌體版本

source: The name of the firmware to be used on the device
it: Il nome del firmware da utilizzare sul dispositivo
ja: デバイスで使用するファームウェアの名前
zh_cn: 设备上要使用的固件的名称
zh_tw: 裝置上使用的韌體名稱

source: The URI from which the firmware image can be downloaded
it: L'URI da cui può essere scaricata l'immagine del firmware
ja: ファームウェア・イメージをダウンロードできる URI
zh_cn: 可从其中下载固件映像的 URI
zh_tw: 可下載韌體映像檔的 URI

source: The verifier such as a checksum for the firmware image to validate its integrity
it: Il verificatore, ad esempio un checksum per l'immagine del firmware per convalidarne l'integrità
ja: ファームウェア・イメージの整合性を検証するためのチェックサムなどのベリファイヤー
zh_cn: 用于验证完整性的固件映像验证器（如校验和）
zh_tw: 韌體映像檔用來驗證其完整性的驗證器（如：總和檢查）

source: Indicates the state of firmware download
it: Indica lo stato dello scaricamento del firmware
ja: ファームウェア・ダウンロードの状態を示します
zh_cn: 指示固件下载状态
zh_tw: 指出韌體下載的狀態

source: Indicates the status of the update
it: Indica lo stato dell'aggiornamento
ja: 更新の状況を示します
zh_cn: 指示更新状态
zh_tw: 指出更新的狀態

source: ISO8601 date-time: Date of last update
it: Data-ora ISO8601: La data dell'ultimo aggiornamento
ja: ISO8601 日時: 最後の更新の日付
zh_cn: ISO8601 日期时间：上次更新的日期
zh_tw: ISO8601 日期時間：前次更新的日期

source: DMA
it: AGD
