Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/dashboard.po
Languages: de, it, zh_cn

source: Connecting and Using a Gateway Device using the IoT Platform Dashboard
de: Gateway-Gerät mithilfe des Dashboards von IoT Platform verbinden und verwenden
it: Connessione ed utilizzo di un dispositivo gateway utilizzando il dashboard IoT Platform
zh_cn: 使用 IoT Platform 仪表板连接并使用网关设备

source: This task describes the process of connecting a gateway device, which connects itself, and devices behind the gateway, and sends data from itself and devices behind it to the IoT Platform.
de: In dieser Task wird der Verbindungsprozess für ein Gateway-Gerät beschrieben, das Geräte hinter dem Gateway mit dem Gateway-Gerät verbindet und Daten des Gateway-Geräts sowie Daten von hinter dem Gateway liegenden Geräten an IoT Platform sendet.
it: Questa attività descrive il processo di connessione di un dispositivo gateway che connette se stesso e i dispositivi dietro al gateway e invia i dati da se stesso e dai dispositivi dietro di esso a IoT Platform.
zh_cn: 此任务描述连接网关设备（网关设备自行连接）和网关背后设备的过程，并将数据从其自身及其背后的设备发送到 IoT Platform。

source: Gateways can also subscribe to commands on behalf of devices connected to the gateway.
de: Gateways können Befehle im Namen von Geräten subskribieren, die mit dem Gateway verbunden sind.
it: I gateway possono inoltrare i comandi per conto dei dispositivi ad essi connessi.
zh_cn: 网关也可代表连接到网关的设备预订命令。

source: Prerequisites
de: Voraussetzungen
it: Prerequisiti
zh_cn: 先决条件

source: This task assumes that you already have an IoT Platform organization.
de: Diese Task setzt voraus, dass Sie bereits über eine IoT Platform-Organisation verfügen.
it: Questa attività presuppone che già si possiede un'organizzazione IoT Platform.
zh_cn: 此任务假设您已具有 IoT Platform 组织。

source: Procedure
de: Vorgehensweise
it: Procedura
zh_cn: 过程

source: Creating a device type for your gateway: A gateway has more rights than a normal device, and can send and receive device data on behalf of other devices.
de: Gerätetyp für das Gateway erstellen: Ein Gateway besitzt umfassendere Berechtigungen als ein normales Gerät und kann Gerätedaten im Namen anderer Geräte senden und empfangen.
it: Creazione di un tipo di dispositivo per il gateway: un gateway dispone di maggiori privilegi rispetto ad un normale dispositivo e può inviare e ricevere i dati per conto di altri dispositivi.
zh_cn: 创建网关的设备类型：网关具有比普通设备更多的权利，并可代表其他设备发送和接收设备数据。

source: In your organization dashboard 'Devices' tab, select the 'Device Types' sub-tab. Click 'Create Type'. Click 'Create gateway type', and follow the instructions in the flow, including adding any device properties and metadata. Click 'Create' to complete the flow and create the device type.
de: Wählen Sie im Dashboard 'Geräte' Ihrer Organisation die untergeordnete Registerkarte 'Gerätetypen' aus. Klicken Sie auf 'Typ erstellen'. Klicken Sie auf 'Gateway-Typ erstellen' und führen Sie die Anweisungen in dem Ablauf aus (dies schließt das Hinzufügen von Geräteeigenschaften und Metadaten ein). Klicken Sie auf 'Erstellen', um den Ablauf abzuschließen und den Gerätetyp zu erstellen.
it: Nella scheda 'Dispositivi' del dashboard dell'organizzazione, selezionare la scheda secondaria 'Tipi di dispositivo'. Fare clic su 'Crea tipo'. Fare clic su 'Crea tipo di gateway' e seguire le istruzioni nel flusso, incluso l'aggiunta delle proprietà e dei metadati del dispositivo. Fare clic su 'Crea' per completare il flusso e creare il tipo di dispositivo.
zh_cn: 在组织仪表板的“设备”选项卡中，选择“设备类型”子选项卡。单击“创建类型”。单击“创建网关类型”，并且遵循流程中的指示信息，包括添加任何设备属性和元数据。单击“创建”以完成流程并创建设备类型。

source: To create a gateway device:
de: Gehen Sie wie folgt vor, um ein Gateway-Gerät zu erstellen:
it: Per creare un dispositivo gateway:
zh_cn: 要创建网关设备，请执行以下操作：

source: In your organization dashboard 'Devices' tab, select the 'Browse' sub-tab and click 'Add device'. Select the gateway device type created in the previous step. Follow the 'Add device' flow, entering the mandatory *deviceId* property, and any other optional properties.
de: Wählen Sie auf der Registerkarte 'Geräte' Ihrer Organisation die untergeordnete Registerkarte 'Durchsuchen' aus und klicken Sie auf 'Gerät hinzufügen'. Wählen Sie den Gateway-Gerätetyp aus, den Sie im vorherigen Schritt erstellt haben. Führen Sie den Ablauf 'Gerät hinzufügen' aus und geben Sie dabei die obligatorische Eigenschaft *deviceId* und weitere optionale Eigenschaften ein (soweit erforderlich).
it: Nella scheda 'Dispositivi' del dashboard dell'organizzazione, selezionare la scheda secondaria 'Sfoglia' e fare clic su 'Aggiungi dispositivo'. Selezionare il tipo di dispositivo gateway creato nell'operazione precedente. Seguire il flusso 'Aggiungi dispositivo' immettendo la proprietà obbligatoria *deviceId* e le altre proprietà facoltative.
zh_cn: 在组织仪表板的“设备”选项卡中，选择“浏览”子选项卡，然后单击“添加设备”。选择先前步骤中创建的网关设备类型。遵循“添加设备”流程，输入必需的 *deviceId* 属性和任何其他可选属性。

source: After creating a gateway device, the authentication token provided should be saved for use in configuring the gateway to connect to the IoT Platform.
de: Nach dem Erstellen eines Gateway-Geräts sollte das bereitgestellte Authentifizierungstoken gespeichert werden, damit es zum Konfigurieren des Gateways zum Verbinden mit IoT Platform verwendet werden kann.
it: Una volta creato un dispositivo gateway, il token di autenticazione fornito dovrebbe essere salvato per l'utilizzo nella configurazione del gateway per la connessione a IoT Platform.
zh_cn: 创建网关设备后，应保存所提供的认证令牌，以用于将网关配置为连接到 IoT Platform。

source: Connecting the gateway to the IoT Platform.
de: Gateway mit IoT Platform verbinden
it: Connessione del gateway a IoT Platform.
zh_cn: 将网关连接到 IoT Platform。

source: There are a range of recipes available for connecting devices to the IoT Platform platform. Connecting a gateway requires the same steps as connecting a normal device with one exception. When connecting a normal device, the clientId uses the following format:
de: Es sind verschiedene Verfahren zum Verbinden von Geräten mit IoT Platform verfügbar. Zum Verbinden eines Gateways sind die gleichen Schritte erforderlich wie bei einem normalen Gerät, jedoch mit einem Unterschied. Beim Verbinden mit einem normalen Gerät wird für die Client-ID (clientId) das folgende Format verwendet:
it: Esiste una gamma di istruzioni disponibili per la connessione dei dispositivi a IoT Platform. La connessione di un gateway richiede le stesse procedure utilizzate per la connessione di un dispositivo normale con un'eccezione. Durante la connessione di un dispositivo normale, clientId utilizza il seguente formato:
zh_cn: 有一系列诀窍可用于将设备连接到 IoT Platform。连接网关所需的步骤与连接普通设备相同，仅有一处例外。在连接普通设备时，clientId 使用以下格式：

source: When connecting a gateway device, the clientId replaces ``d`` with ``g``:
de: Beim Verbinden mit einem Gateway-Gerät wird in der Client-ID ``d`` durch ``g`` ersetzt:
it: Durante la connessione di un dispositivo gateway, clientId sostituisce ``d`` con ``g``:
zh_cn: 在连接网关设备时，clientId 将“d”替换为“g”：

source: Set up devices that are connected to the gateway and are to be connected to the IoT Platform:
de: Richten Sie Geräte ein, die mit dem Gateway verbunden sind und mit IoT Platform verbunden werden sollen:
it: Configurare i dispositivi che sono connessi al gateway e devono essere connessi a IoT Platform:
zh_cn: 设置已连接到网关并要连接到 IoT Platform 的设备：

source: Create a device type for the device or devices which are to connect through the gateway. The devices should have *gatewayId* and *gatewayTypeId* properties matching the *deviceId* and *deviceTypeId* of the gateway they are connecting through. Add the devices which are connected to the gateway to the IoT Platform.
de: Erstellen Sie einen Gerätetyp für das Gerät bzw. die Geräte, die über das Gateway verbunden werden sollen. Die Eigenschaften *gatewayId* und *gatewayTypeId* der Geräte sollten mit den Eigenschaften *deviceId* und *deviceTypeId* des Gateways übereinstimmen, über das sie verbunden werden. Fügen Sie das Gerät bzw. die Geräte, die über das Gateway verbunden werden sollen, zu IoT Platform hinzu.
it: Creare un tipo di dispositivo per il dispositivo o i dispositivi che devono essere connessi mediante il gateway. I dispositivi dovrebbero avere le proprietà *gatewayId* e *gatewayTypeId* corrispondenti a *deviceId* e *deviceTypeId* del gateway attraverso cui sono connessi. Aggiungere i dispositivi che tramite il gateway sono connessi a IoT Platform.
zh_cn: 创建要通过网关连接的一个或多个设备的设备类型。设备应具有与其连接所使用的网关的 *deviceId* 和 *deviceTypeId* 匹配的 *gatewayId* 和 *gatewayTypeId* 属性。向 IoT Platform 中添加已连接到网关的设备。

source: The devices connected to the gateway should now be visible in your IoT Platform organization dashboard.
de: Die verbundenen Geräte müssten nun im Dashboard für Ihre IoT Platform-Organisation angezeigt werden.
it: I dispositivi connessi al gateway dovrebbero ora essere visibili nel dashboard dell'organizzazione IoT Platform.
zh_cn: 连接到网关的设备现在应在 IoT Platform 组织仪表板中可视。
