Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java.po
Languages: de, ja, pt_br, zh_cn, zh_tw

source: format - The format of the command payload, currently only JSON format is supported in the Java Client Library.
de: format - Das Format der Nutzdaten für den Befehl. Derzeit wird in der Java-Clientbibliothek nur das JSON-Format unterstützt.
ja: format - コマンド・ペイロードの形式。現在、Java クライアント・ライブラリーでサポートされているのは JSON 形式のみです。
pt_br: format - O formato da carga útil de comando, atualmente apenas o formato JSON é suportado na Biblioteca do Cliente Java.
zh_cn: format - 命令有效内容的格式，当前在 Java 客户机库中仅支持 JSON 格式。
zh_tw: format - 指令內容的格式。「Java 用戶端程式庫」中目前只支援 JSON 格式。

source: command - The name of the command.
de: command - Der Name des Befehls.
ja: command - コマンドの名前。
pt_br: command - O nome do comando.
zh_cn: command - 命令的名称。
zh_tw: command - 指令的名稱。

source: timestamp - The org.joda.time.DateTime when the command is sent.
de: timestamp - Der Zeitpunkt 'org.joda.time.DateTime', an dem der Befehl gesendet wurde.
ja: timestamp - コマンドが送信された org.joda.time.DateTime。
pt_br: timestamp - O org.joda.time.DateTime quando o comando é enviado.
zh_cn: timestamp - 发送命令时的 org.joda.time.DateTime。
zh_tw: timestamp - 傳送指令時的 org.joda.time.DateTime。

source: A sample implementation of the Command callback is shown below,
de: Eine Beispielimplementierung für den Befehls-Callback ist unten angegeben.
ja: コマンド・コールバックの実装例を以下に示します。
pt_br: Uma implementação de amostra do retorno de chamada do Comando é mostrada abaixo,
zh_cn: 以下显示了命令回调的样本实现，
zh_tw: 下面顯示「指令」回呼的範例實作。

source: Once the Command callback is added to the GatewayClient, the processCommand() method is invoked whenever any command is published on the subscribed criteria, The following snippet shows how to add the command call back into GatewayClient instance,
de: Nach dem Hinzufügen des Befehls-Callbacks zum Gateway-Client wird die Methode 'processCommand()' immer dann aufgerufen, wenn ein Befehl für die subskribierten Kriterien publiziert wird. Das folgende Code-Snippet zeigt, wie der Befehls-Callback zum Gateway-Client hinzugefügt wird.
ja: コマンド・コールバックを GatewayClient に追加すると、サブスクライブ基準でコマンドがパブリッシュされるたびに processCommand() メソッドが呼び出されます。コマンド・コールバックを GatewayClient インスタンスに追加するコード・スニペットを以下に示します。
pt_br: Uma vez que o retorno de chamada do Comando é incluído no GatewayClient, o método processCommand() é chamado sempre que algum comando é publicado nos critérios assinados. O fragmento a seguir mostra como incluir o retorno de chamada de comando na instância de GatewayClient,
zh_cn: 一旦将命令回调添加到 GatewayClient，只要根据预订条件发布任何命令，就会调用 processCommand() 方法。以下片段显示如何将命令回调添加到 GatewayClient 实例中，
zh_tw: 「指令」回呼新增至 GatewayClient 之後，每當在已訂閱的準則上發佈任何指令時，即會呼叫 processCommand() 方法。下列 Snippet 顯示如何將指令回呼新增至 GatewayClient 實例中。

source: Overloaded methods are available to control the command subscription.
de: Überladene Methoden sind zur Steuerung der Befehlssubskription verfügbar.
ja: コマンド・サブスクリプションを制御するために、Overloaded メソッドを使用できます。
pt_br: Os métodos sobrecarregados estão disponíveis para controlar a assinatura do comando.
zh_cn: 重载方法可用于控制命令预订。
zh_tw: 超載方法可用來控制指令訂閱。

source: List Devices Connected through the Gateway
de: Über das Gateway verbundene Geräte auflisten
ja: ゲートウェイを経由して接続しているデバイスのリスト
pt_br: Listar Dispositivos Conectados por meio do Gateway
zh_cn: 列出通过网关连接的设备
zh_tw: 列出透過閘道連接的裝置

source: Invoke the method getDevicesConnectedThroughGateway() to retrieve all devices that are connected through the specified gateway(typeId, deviceId) to Watson IoT Platform:
de: Rufen Sie die Methode 'getDevicesConnectedThroughGateway()' auf, um alle Geräte abzurufen, die über das angegebene Gateway 'gateway(typeId, deviceId)' mit Watson IoT Platform verbunden sind:
ja: getDevicesConnectedThroughGateway() メソッドを呼び出すと、指定したゲートウェイ (typeId、deviceId) を経由して Watson IoT Platform に接続しているすべてのデバイスを取得できます。
pt_br: Chame o método getDevicesConnectedThroughGateway() para recuperar todos os dispositivos que estão conectados por meio do gateway especificado (typeId, deviceId) ao Watson IoT Platform:
zh_cn: 调用方法 getDevicesConnectedThroughGateway() 以检索通过指定的 gateway(typeId, deviceId) 连接到 Watson IoT Platform 的所有设备：
zh_tw: 呼叫方法 getDevicesConnectedThroughGateway()，將透過指定的閘道（typeId、deviceId）連接的所有裝置擷取至 Watson IoT Platform：

source: Examples
de: Beispiele
ja: 例
pt_br: Exemplos
zh_cn: 示例
zh_tw: 範例

source: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - This Java project contains 3 samples, which will help one to connect their own Gateway and devices behind the Gateway to IBM Watson Internet of Things Platform. All the samples use the Java Client Library for IBM Watson IoT Platform, that simplifies the Gateway interactions with the Platform.
de: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - Dieses Java-Projekt enthält 3 Beispiele, die veranschaulichen, wie ein eigenes Gateway und die Geräte hinter dem Gateway mit IBM Watson Internet of Things Platform verbunden werden können. Alle Beispiele verwenden die Java-Clientbibliothek für IBM Watson IoT Platform, die die Gateway-Interaktionen mit der Plattform vereinfachen.
ja: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - この Java プロジェクトには 3 つのサンプルが含まれています。これらのサンプルは、独自のゲートウェイおよびゲートウェイの背後のデバイスを IBM Watson Internet of Things Platform に接続するのに役立ちます。すべてのサンプルで、IBM Watson IoT Platform 用 Java クライアント・ライブラリーを使用しています。このライブラリーを使用することで、ゲートウェイとプラットフォームの対話が簡素化されます。
pt_br: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - Este projeto Java contém 3 amostras, que ajudarão a se conectar a seu próprio Gateway e dispositivos por trás do Gateway com o IBM Watson Internet of Things Platform. Todas as amostras usam o Java Client Library for IBM Watson IoT Platform, que simplifica as interações de Gateway com a Platform.
zh_cn: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - 此 Java 项目包含 3 个样本，可帮助用户将自己的网关及网关背后的设备连接到 IBM Watson Internet of Things Platform。所有样本均使用 Java Client Library for IBM Watson IoT Platform 来简化网关与该 Platform 的交互。
zh_tw: `SampleRasPiGateway <https://github.com/ibm-messaging/iot-gateway-samples/tree/master/java/gateway-samples>`__ - 此 Java 專案包含 3 個範例，這些範例會協助任何人將其自己的閘道以及閘道後面的裝置連接至 IBM Watson Internet of Things Platform。所有範例皆會使用適用於 IBM Watson IoT Platform 的 Java 用戶端程式庫，以簡化閘道與平台的互動。

source: Recipes
de: Anleitungen
ja: レシピ
pt_br: Receitas
zh_cn: 配方
zh_tw: 秘訣

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ that explains how to connect your Gateway and devices behind the Gateway to IBM Watson Internet of Things Platform with the sample present in this github project.
de: `Die Anleitung <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ enthält eine Erläuterung dazu, wie ein Gateway und die Geräte hinter dem Gateway mit IBM Watson Internet of Things Platform verbunden werden können, wobei das Beispiel in diesem GitHub-Projekt verwendet wird.
ja: `レシピ <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ を参照してください。このレシピでは、この github プロジェクトにあるサンプルを使用してゲートウェイとゲートウェイの背後のデバイスを IBM Watson Internet of Things Platform に接続する方法を説明しています。
pt_br: Consulte `the recipe <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__ que explica como conectar seu Gateway e os dispositivos por trás do Gateway com o IBM Watson Internet of Things Platform à amostra presente neste projeto github.
zh_cn: 请参阅 `诀窍 <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__，其中解释了如何使用该 GitHub 项目中提供的样本将您的网关及网关背后的设备连接到 IBM Watson Internet of Things Platform。
zh_tw: 請參閱 `秘訣 <https://developer.ibm.com/recipes/tutorials/connect-raspberry-pi-as-gateway-to-watson-iot-platform/>`__，該秘訣會說明如何使用此 github 專案中提供的範例，將閘道以及閘道後面的裝置連接至 IBM Watson Internet of Things Platform。

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ that explains how to connect your Gateway as managed device in IBM Watson Internet of Things Platform and perform one or more device management operations.
de: `Die Anleitung <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ enthält eine Erläuterung dazu, wie das Gateway als verwaltetes Gerät in IBM Watson Internet of Things Platform verbunden werden kann und wie eine oder mehrere Gerätemanagementoperationen ausgeführt werden können.
ja: `レシピ <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ を参照してください。このレシピでは、ゲートウェイを管理対象デバイスとして IBM Watson Internet of Things Platform に接続し、1 つ以上のデバイス管理操作を実行する方法を説明しています。
pt_br: Consulte `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ que explica como conectar seu Gateway como dispositivo gerenciado no IBM Watson Internet of Things Platform e executar uma ou mais das operações de gerenciamento de dispositivo.
zh_cn: 请参阅 `诀窍 <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__，其中解释了如何将网关作为 IBMWatson Internet of Things Platform 中的受管设备进行连接，并执行一个或多个设备管理操作。
zh_tw: 請參閱 `秘訣 <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__，該秘訣會說明如何在 IBM Watson Internet of Things Platform 中將閘道連接為受管理裝置，並執行一項以上的裝置管理作業。
