Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: it

source: The gateway/attached devices needs to set the firmware action flag to true in order for the server to initiate the firmware request. This can be achieved by passing true value for supportFirmwareActions parameter while sending the manage request.
it: Il gateway/dispositivo deve impostare l'indicatore dell'azione firmware su true per consentire al server di avviare la richiesta firmware. Ciò può avvenire passando il valore true per il parametro supportFirmwareActions durante l'invio della richiesta di gestione.

source: The gateway can invoke the following method to inform the server about its firmware support,
it: Il gateway può richiamare il seguente metodo per informare il server del proprio supporto firmware,

source: Similarly, the gateway can invoke the corresponding device method to inform the firmware support of attached devices,
it: In modo simile, il gateway può richiamare il metodo del dispositivo corrispondente per informare il supporto firmware dei dispositivi collegati,

source: Once the support is informed to the DM server, the server then forwards the firmware actions to the gateway for the gateway itself/attached devices.
it: Una volta che il supporto risulta informato sul server DM, questo può inoltrare le azioni firmware sul gateway, per il gateway stesso o per i dispositivi collegati.

source: **3. Create the Firmware Action Handler**
it: **3. Creare il gestore dell'azione firmware**

source: In order to support the Firmware action, the gateway needs to create a handler and add it to managedGateway. The handler must extend a DeviceFirmwareHandler class and implement the following methods:
it: Per supportare l'azione firmware, il gateway deve creare un gestore e aggiungerlo a managedGateway. Il gestore deve estendere una classe DeviceFirmwareHandler e implementare i seguenti metodi:

source: **Note**: There must be only one handler added to the library for both the gateway and attached devices where the firmware download/update requests will be redirected. The implementation must create a thread (possibly a pool of threads) to handle multiple firmware requests at the same time. A sample handler implementation with a threadpool is `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__
it: **Nota**: È necessario aggiungere un solo gestore alla libreria per il gateway ed i dispositivi collegati in cui le richieste di download/aggiornamento del firmware saranno reindirizzate. L'implementazione deve creare un thread (possibilmente un threadpool) per gestire più richieste di firmware simultaneamente. In `<https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`_ viene riportata un'implementazione di esempio del gestore con un threadpool

source: **3.1 Sample implementation of downloadFirmware**
it: **3.1 Implementazione di esempio di downloadFirmware**

source: The implementation must add a logic to download the firmware and report the status of the download via DeviceFirmware object. If the Firmware Download operation is successful, then the state of the firmware to be set to DOWNLOADED and UpdateStatus should be set to SUCCESS.
it: L'implementazione deve aggiungere una logica per scaricare il firmware e notificare lo stato dello scaricamento tramite l'oggetto DeviceFirmware. Se l'operazione di scaricamento del firmware ha esito positivo, lo stato del firmware deve essere impostato su DOWNLOADED e UpdateStatus deve essere impostato su SUCCESS.

source: If an error occurs during Firmware Download the state should be set to IDLE and updateStatus should be set to one of the error status values:
it: Se si verifica un errore durante lo scaricamento del firmware, lo stato deve essere impostato su IDLE e updateStatus deve essere impostato su uno dei valori dello stato di errore:

source: A sample Firmware Download implementation is shown below, (The below code doesn't include the threadpool part, refer to the `github sample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ for the complete implementation of the FirmwareHandler).
it: Di seguito viene riportata un'implementazione di esempio del download di un firmware, (Il seguente codice non include una parte threadpool, fare riferimento all'esempio `github <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ per un'implementazione completa del FirmwareHandler).

source: Gateway can check the integrity of the downloaded firmware image using the verifier and report the status back to IBM Watson Internet of Things Platform. The verifier can be set by the gateway during the startup (while creating the DeviceFirmware Object) or as part of the Download Firmware request by the application. A sample code to verify the same is below:
it: Il gateway può controllare l'integrità dell'immagine del firmware scaricata utilizzando il verificatore e notificare lo stato a IBM Watson Internet of Things Platform. Il verificatore può essere impostato dal gateway durante l'avvio (durante la creazione dell'oggetto DeviceFirmware) oppure come parte della richiesta Scaricamento del firmware da parte dell'applicazione. Un codice di esempio per eseguire la stessa verifica è illustrato di seguito:

source: The complete code can be found in the gateway management sample `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.
it: Il codice completo si trova nell'esempio di gestione gateway `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__.

source: **3.2 Sample implementation of updateFirmware**
it: **3.2 Implementazione di esempio di updateFirmware**

source: The implementation must create a separate thread and add a logic to install the downloaded firmware and report the status of the update via DeviceFirmware object. If the Firmware Update operation is successful, then the state of the firmware should to be set to IDLE and UpdateStatus should be set to SUCCESS.
it: L'implementazione deve creare un thread separato ed aggiungere una logica per installare il firmware scaricato e notificare lo stato dell'aggiornamento tramite l'oggetto DeviceFirmware. Se l'operazione di aggiornamento del firmware ha esito positivo, lo stato del firmware deve essere impostato su IDLE e UpdateStatus deve essere impostato su SUCCESS.

source: If an error occurs during Firmware Update, updateStatus should be set to one of the error status values:
it: Se si verifica un errore durante l'aggiornamento del firmware, updateStatus deve essere impostato su uno dei valori dello stato di errore illustrati di seguito:

source: A sample Firmware Update implementation for a Raspberry Pi device is shown below:
it: Un'implementazione dell'aggiornamento del firmware per un dispositivo Raspberry Pi è illustrata di seguito:

source: **4. Add the handler to ManagedGateway**
it: **4. Aggiungere il gestore a ManagedGateway**

source: The created handler needs to be added to the ManagedGateway instance so that the WIoTP client library invokes the corresponding method when there is a Firmware action request from IBM Watson Internet of Things Platform.
it: Il gestore creato deve essere aggiunto all'istanza ManagedGateway in modo che la libreria client WIoTP invochi il metodo corrispondente quando si verifica una richiesta di azione firmware da IBM Watson Internet of Things Platform.

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ for more information about the Firmware action.
it: Fare riferimento a `questa pagina <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/firmware-actions#firmware-actions>`__ per ulteriori informazioni sull'azione firmware.

source: Device Actions
it: Azioni dispositivo

source: The IBM Watson Internet of Things Platform supports the following device actions:
it: IBM Watson Internet of Things Platform supporta le seguenti azioni dispositivo:

source: Reboot
it: Riavvia

source: Factory Reset
it: Reimpostazione alle impostazioni di fabbrica

source: The gateway needs to do the following activities to support Device Actions for itself and for the attached devices:
it: Il gateway deve completare le seguenti attività per supportare le azioni dispositivo per se stesso e per i dispositivi collegati:

source: **1. Inform server about the Device Actions support**
it: **1. Informare il server del supporto alle azioni dispositivo**

source: In order to perform Reboot or Factory Reset action for itself and attached devices, the gateway needs to inform the IBM Watson Internet of Things Platform about the support first. This can be achieved by passing true value for supportDeviceActions parameter while sending the manage request.
it: Per poter effettuare azioni di riavvio e di ripristino delle impostazioni di fabbrica per se stesso e per i dispositivi collegati, il gateway deve innanzitutto informare IBM Watson Internet of Things Platform del supporto. Ciò può avvenire passando il valore true per il parametro supportDeviceActions durante l'invio della richiesta di gestione.

source: Similarly, the gateway can invoke the corresponding device method to inform the device action support of attached devices,
it: In modo simile, il gateway può richiamare il metodo del dispositivo corrispondente per informare il supporto azione dei dispositivi collegati,

source: Once the support is informed to the DM server, the server then forwards the device action requests to the device.
it: Una volta che il supporto risulta informato sul server DM, questo inoltra le richieste di azioni del dispositivo sul dispositivo.

source: **2. Create the Device Action Handler**
it: **2. Creare il gestore dell'azione dispositivo**

source: In order to support the device action, the gateway needs to create a handler and add it to managedGateway instance. The handler must extend a DeviceActionHandler class and provide implementation for the following methods:
it: Per supportare l'azione dispositivo, il gateway deve creare un gestore e aggiungerlo all'istanza managedGateway. Il gestore deve estendere una classe DeviceActionHandler e fornire l'implementazione dei seguenti metodi:

source: **Note:** There must be only one handler added to the library for both the gateway and attached devices where the device action requests will be redirected. The implementation must create a thread (possibly a pool of threads) to handle multiple device action requests at the same time. A sample handler implementation with a threadpool is `demonstrated here <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
it: **Nota**: È necessario aggiungere un solo gestore alla libreria per il gateway ed i dispositivi collegati in cui le richieste di azione dispositivo saranno reindirizzate. L'implementazione deve creare un thread (possibilmente un threadpool) per gestire più richieste del dispositivo simultaneamente. In `<https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`_ viene riportata un'implementazione di esempio del gestore con un threadpool

source: **2.1 Sample implementation of handleReboot**
it: **2.1 Implementazione di esempio di handleReboot**

source: The implementation must create a separate thread and add a logic to reboot the gateway/attached device and report the status of the reboot via DeviceAction object. Upon receiving the request, the gateway first needs to inform the server about the support(or failure) before proceeding with the actual reboot. And if the sample can not reboot the device or any other error during the reboot, the gateway can update the status along with an optional message. A sample reboot implementation for a Raspberry Pi device is shown below (The below code doesn't include the threadpool part, refer to the `github location <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ for the complete implementation of a sample device action handler).
it: L'implementazione deve creare un thread separato ed aggiungere una logica per riavviare il gateway/dispositivo collegato e notificare lo stato del riavvio tramite l'oggetto DeviceAction. Al momento della ricezione della richiesta, il gateway deve innanzitutto informare il server del supporto (o errore) prima di procedere con l'effettivo riavvio. E se l'esempio non può riavviare il dispositivo o in presenza di qualsiasi altro errore in fase di riavvio, il gateway può aggiornare lo stato ed inviare facoltativamente un messaggio. Di seguito viene riportata un'implementazione di esempio del riavvio di un dispositivo Raspberry Pi, (Il seguente codice non include una parte threadpool, fare riferimento all'ubicazione `github <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ per un'implementazione completa del gestore dell'azione del dispositivo di esempio).

source: The complete code can be found in the device management sample `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.
it: Il codice completo si trova nell'esempio di gestione dispositivo `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__.

source: **2.2 Sample implementation of handleFactoryReset**
it: **2.2 Implementazione di esempio di handleFactoryReset**

source: The implementation must create a separate thread and add a logic to reset the gateway/attached device to factory settings and report the status of the reset via DeviceAction object. Upon receiving the request, the gateway first needs to inform the server about the support(or failure) before proceeding with the actual reset. The skeleton of the Factory Reset implementation is shown below:
it: L'implementazione deve creare un thread separato ed aggiungere una logica per riavviare il gateway/dispositivo collegato e notificare lo stato della reimpostazione tramite l'oggetto DeviceAction. Al momento della ricezione della richiesta, il gateway deve innanzitutto informare il server del supporto (o errore) prima di procedere con l'effettiva reimpostazione. Lo skeleton dell'implementazione della reimpostazione alle impostazioni di fabbrica è illustrato di seguito:

source: **3. Add the handler to ManagedGateway**
it: **3. Aggiungere il gestore a ManagedGateway**

source: The created handler needs to be added to the ManagedGateway instance so that the WIoTP client library invokes the corresponding method when there is a device action request for this gateway or attached devices, from IBM Watson Internet of Things Platform.
it: Il gestore creato deve essere aggiunto all'istanza ManagedGateway in modo che la libreria client WIoTP invochi il metodo corrispondente quando si verifica una richiesta di azione del dispositivo di questo gateway o dei dispositivi collegati da IBM Watson Internet of Things Platform.

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ for more information about the Device Action.
it: Fare riferimento a `questa pagina <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/requests.html#/device-actions-reboot#device-actions-reboot>`__ per ulteriori informazioni sull'azione del dispositivo.

source: Listen for Device attribute changes
it: Ascolto di modifiche dell'attributo dispositivo

source: This WIoTP client library updates the corresponding objects whenever there is an update request from the IBM Watson Internet of Things Platform, these update requests are initiated by the application either directly or indirectly (Firmware Update) via the IBM Watson Internet of Things Platform ReST API. Apart from updating these attributes, the library provides a mechanism where the gateway can be notified whenever a device attribute is updated.
it: Questa libreria client WIoTP aggiorna gli oggetti corrispondenti ogni volta che si verifica una richiesta di aggiornamento da IBM Watson Internet of Things Platform, tali richieste di aggiornamento vengono avviate dall'applicazione direttamente o indirettamente (aggiornamento firmware) tramite l'API ReST di IBM Watson Internet of Things Platform. Oltre ad aggiornare questi attributi, la libreria fornisce un meccanismo tramite il quale il gateway può ricevere notifiche quando viene aggiornato un attributo dispositivo.

source: Attributes that can be updated by this operation are location, metadata, device information and firmware of the gateway/attached devices.
it: Gli attributi che possono essere aggiornati da questa operazione sono l'ubicazione, i metadati, le informazioni del dispositivo ed il firmware del gateway e dei dispositivi collegati.

source: In order to get notified, the gateway needs to add a property change listener on those objects that it is interested.
it: Per ricevere la notifica, il gateway deve aggiungere un listener di modifica delle proprietà sugli oggetti a cui è interessato.

source: Also, the gateway needs to implement the propertyChange() method where it receives the notification. A sample implementation is as follows:
it: Inoltre, il gateway deve implementare il metodo propertyChange() su cui riceve la notifica. Un'implementazione di esempio è illustrata di seguito:

source: Refer to `this page <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ for more information about updating the device attributes.
it: Fare riferimento a `questa pagina <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-device-attributes#update-device-attributes>`__ per ulteriori informazioni sull'aggiornamento degli attributi del dispositivo.

source: Examples
it: Esempi:

source: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - Gateway Device Management(DM) capabilities are demonstrated in this sample by managing the Arduino Uno device through the Raspberry Pi Gateway. If you do not have Raspberry Pi and Arduino UNO, don’t worry, you can still follow the sample to connect your device as a gateway and manage one or more attached devices.
it: `ManagedRasPiGateway <https://github.com/ibm-messaging/gateway-samples/blob/master/java/gateway-samples/src/main/java/com/ibm/iotf/sample/client/gateway/devicemgmt/ManagedRasPiGateway.java>`__ - In questo esempio sono illustrate le funzioni di DM (Device Management) del gateway attraverso la gestione del dispositivo Arduino Uno mediante il gateway Raspberry Pi. Se non si dispone di Raspberry Pi e Arduino UNO, è comunque possibile seguire l'esempio per collegare il proprio dispositivo come gateway e gestire uno o più dispositivi collegati.

source: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - A home gateway sample that manages few attached home devices like, Lights, Switches, Elevator, Oven and OutdoorTemperature.
it: `HomeGatewaySample <https://github.com/ibm-messaging/gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/HomeGatewaySample.java>`__ - Un esempio di gateway home che gestisce pochi dispositivi collegati quali Luci, Interruttori, Ascensore, Forno e Temperatura esterna.

source: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - A sample implementation of FirmwareHandler.
it: `GatewayFirmwareHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayFirmwareHandlerSample.java>`__ - Un'implementazione di esempio di FirmwareHandler.

source: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - A sample implementation of DeviceActionHandler.
it: `GatewayActionHandlerSample <https://github.com/ibm-messaging/iot-gateway-samples/blob/master/java/advanced-gateway-sample/src/main/java/com/ibm/iotf/sample/gateway/GatewayActionHandlerSample.java>`__ - Un'implementazione di esempio di DeviceActionHandler.

source: Recipe
it: Istruzioni specifiche

source: Refer to `the recipe <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ that shows how to connect Raspberry Pi as Managed Gateway to IBM Watson IoT Platform and manage the attached devices. For example, update Arduino Uno device with a new sketch program, reboot Arduino Uno using the Watson IoT Platform device management protocol and etc..
it: Fare riferimento alle istruzioni in <https://developer.ibm.com/recipes/tutorials/raspberry-pi-as-managed-gateway-in-watson-iot-platform-part-1/>`__ che mostrano come collegare Raspberry Pi come dispositivo gestito a IBM Watson IoT Platform per gestire i dispositivi collegati. Ad esempio, aggiornare il dispositivo Arduino Uno con un nuovo programma sketch, riavviare Arduino Uno tramite il protocollo di gestione del dispositivo di Watson IoT Platform e così via.
