Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java_managedgateway.po
Languages: it

source: Java Client Library - Managed Gateway
it: Libreria client Java - Gateway gestito

source: Introduction
it: Introduzione

source: Gateway plays an important role in the device management of devices connected to it. Many of these devices will be too basic to be managed. For a managed device, the device management agent on the gateway acts as a proxy for the connected device. The protocol used by the gateway to manage the connected devices is arbitrary, and there need not be a device management agent on the connected devices. It is only necessary for the gateway to ensure that devices connected to it perform their responsibilities as managed devices, performing any translation and processing required to achieve this. The management agent in gateway will act as more than a transparent tunnel between the attached device and the Watson IoT Platform.
it: Il Gateway ha un ruolo importante nella gestione dei dispositivi ad esso collegati. Molti di questi dispositivi sono troppo essenziali per essere gestiti. Nel caso di un dispositivo gestito, l'agent di gestione dei dispositivi sul gateway funge da proxy per il dispositivo collegato. Il protocollo utilizzato dal gateway per gestire i dispositivi connessi è arbitrario, e non è necessario che sui dispositivi collegati vi sia un agent di gestione dei dispositivi. Esso è necessario solo per il gateway, in modo da assicurare che i dispositivi ad esso collegati svolgano il proprio ruolo di dispositivi gestiti, effettuando tutte le traduzioni e le elaborazioni necessarie allo scopo. L'agent di gestione in un gateway funge più da tunnel trasparente tra i dispositivi collegati e Watson IoT Platform.

source: For example, It is unlikely that a device connected to a gateway will be able to download the firmware itself. In this case, the gateway’s device management agent will intercept the request to download the firmware and perform the download to its own storage. Then, when the device is instructed to perform the upgrade, the gateway’s device management agent will push the firmware to the device and update it.
it: Ad esempio, è improbabile che un dispositivo connesso ad un gateway possa scaricare il firmware. In questo caso, l'agent di gestione dei dispositivi del gateway intercetterà la richiesta di scaricamento del firmware e lo effettuerà nel proprio archivio. Quindi, quando ad un dispositivo viene richiesto di effettuare l'aggiornamento, l'agent di gestione dei dispositivi del gateway effettuerà il push del firmware sul dispositivo aggiornandolo.

source: This section contains information on how gateways (and attached devices) can connect to the Internet of Things Platform Device Management service using Java and perform device management operations like firmware update, location update, and diagnostics update.
it: Questa sezione contiene informazioni su come i gateway (ed i dispositivi collegati) possono connettersi al servizio di gestione dei dispositivi di Internet of Things Platform utilizzando Java ed eseguire operazioni di gestione dispositivo come l'aggiornamento del firmware, l'aggiornamento dell'ubicazione e l'aggiornamento della diagnostica.

source: Create DeviceData
it: Crea DeviceData

source: The `device model <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ describes the metadata and management characteristics of a device or a gateway. The device database in the IBM Watson Internet of Things Platform is the master source of device information. Applications and managed devices are able to send updates to the database such as a location or the progress of a firmware update. Once these updates are received by the IBM Watson Internet of Things Platform, the device database is updated, making the information available to applications.
it: Il `modello del dispositivo <https://docs.internetofthings.ibmcloud.com/reference/device_model.html>`__ descrive i metadati e le caratteristiche di gestione di un dispositivo o di un gateway. Il database del dispositivo in IBM Watson Internet of Things Platform è l'origine principale delle informazioni sul dispositivo. Le applicazioni e i dispositivi gestiti sono in grado di inviare aggiornamenti al database come un'ubicazione o l'avanzamento di un aggiornamento firmware. Dopo che questi aggiornamenti vengono ricevuti da IBM Watson Internet of Things Platform, il database del dispositivo viene aggiornato, rendendo le informazioni disponibili per le applicazioni.

source: The device model in the WIoTP client library is represented as DeviceData and to create a DeviceData one needs to create the following objects,
it: Il modello dispositivo nella libreria client WIoTP è rappresentato come DeviceData e per creare un DeviceData è necessario creare i seguenti oggetti,

source: DeviceInfo (Optional)
it: DeviceInfo (facoltativo)

source: DeviceLocation (Optional, required only if the device wants to be notified about the location set by the application through Watson IoT Platform API)
it: DeviceLocation (Facoltativo, richiesto solo se il dispositivo deve essere informato sull'ubicazione impostata dall'applicazione attraverso l'API Watson IoT Platform)

source: DeviceFirmware (Optional)
it: DeviceFirmware (facoltativo)

source: DeviceMetadata (optional)
it: DeviceMetadata (facoltativo)

source: The following code snippet shows how to create the object DeviceInfo along with DeviceMetadata with sample data:
it: Il seguente frammento di codice mostra come creare l'oggetto DeviceInfo insieme ad un oggetto DeviceMetadata con dati di esempio:

source: The following code snippet shows how to create the DeviceData object with the above created DeviceInfo and DeviceMetadata objects:
it: Il seguente frammento di codice mostra come creare l'oggetto DeviceData con gli oggetti DeviceInfo e DeviceMetadata creati in precedenza:

source: Each gateway and attached devices must have its own DeviceData to represent itself in the Platform. In the case of gateway, the DeviceData will be passed to the library as part of constructing the ManagedGateway instance, and in the case of attached device, the DeviceData will be passed as part of the sendDeviceManageRequest().
it: Ciascun gateway e dispositivo collegato deve avere il proprio DeviceData per essere rappresentato nella Piattaforma. Nel caso di un gateway, il DeviceData verrà trasmesso dalla libreria come parte dell'attività di costruzione dell'istanza ManagedGateway, e nel caso di un dispositivo collegato, il DeviceData verrà trasmesso come parte del sendDeviceManageRequest().

source: Construct ManagedGateway
it: Costruzione di ManagedGateway

source: ManagedGateway - A gateway class that connects the gateway as managed gateway to IBM Watson Internet of Things Platform and enables the gateway to perform one or more Device Management operations for itself and attached devices. Also the ManagedGateway instance can be used to do normal gateway operations like publishing gateway events, attached device events and listening for commands from application.
it: ManagedGateway - Una classe gateway che connette il gateway a IBM Watson Internet of Things Platform come dispositivo gestito e gli consente di eseguire una o più operazioni di gestione dispositivo per se stesso e per i dispositivi collegati. Inoltre, l'istanza ManagedGateway può essere utilizzata per eseguire normali operazioni gateway come la pubblicazione degli eventi gateway e l'ascolto di comandi dall'applicazione.

source: ManagedGateway exposes 2 different constructors to support different user patterns,
it: ManagedGateway presenta 2 diversi costruttori per supportare diversi schemi utente,

source: **Constructor One**
it: **Costruttore Uno**

source: Constructs a ManagedGateway instance by accepting the DeviceData and the following properties,
it: Costruisce un'istanza ManagedGateway accettando DeviceData e le seguenti proprietà,

source: Organization-ID - Your organization ID.
it: Organization-ID - L'ID dell'organizzazione.

source: Gateway-Type - The type of your gateway device.
it: Gateway-Type - Il tipo di dispositivo del gateway.

source: Gateway-ID - The ID of your gateway device.
it: Gateway-ID - L'ID del dispositivo del gateway.

source: Authentication-Method - Method of authentication (The only value currently supported is "token").
it: Authentication-Method - Il metodo di autenticazione (il solo valore attualmente supportato è "token").

source: Authentication-Token - API key token
it: Authentication-Token - Il token della chiave API

source: All these properties are required to interact with the IBM Watson Internet of Things Platform.
it: Tutte queste proprietà sono richieste per interagire con IBM Watson Internet of Things Platform.

source: The following code shows how to create a ManagedGateway instance:
it: Il seguente codice mostra come creare un'istanza ManagedGateway:

source: **Constructor Two**
it: **Costruttore Due**

source: Construct a ManagedGateway instance by accepting the DeviceData and the MqttClient instance. This constructor requires the DeviceData to be created with additional device attributes like Device Type and Device Id as follows:
it: Costruisce un'istanza ManagedGateway accettando DeviceData e l'istanza MqttClient. Questo costruttore richiede che DeviceData sia creato con ulteriori attributi dispositivo, come il tipo di dispositivo e l'ID dispositivo come illustrato di seguito:

source: Note this constructor helps the custom device users to create a ManagedGateway instance with the already created and connected MqttClient instance to take advantage of device management operations. But we recommend the users to use the library for all the device functionalities.
it: Tenere presente che questo costruttore aiuta gli utenti del dispositivo personalizzato a creare un'istanza ManagedGateway con l'istanza MqttClient già creata e connesso per sfruttare le operazioni di gestione dispositivo. Tuttavia, agli utenti è consigliato di utilizzare la libreria per tutte le funzionalità del dispositivo.

source: Manage request - gateway
it: Gestione richieste - gateway

source: The gateway can invoke sendGatewayManageRequest() method to participate in device management activities. The manage request will initiate a connect request internally if the device is not connected to the IBM Watson Internet of Things Platform already:
it: Il gateway può richiamare il metodo sendGatewayManageRequest() per partecipare alle attività di gestione dispositivo. La richiesta di gestione avvierà una richiesta connect internamente se il dispositivo non è già connesso a IBM Watson Internet of Things Platform:

source: As shown, this method accepts following 3 parameters,
it: Come riportato, questo metodo accetta i seguenti 3 parametri,

source: *lifetime* The length of time in seconds within which the gateway must send another **Manage** request in order to avoid being reverted to an unmanaged device and marked as dormant. If set to 0, the managed gateway will not become dormant. When set, the minimum supported setting is 3600 (1 hour).
it: *lifetime* Il periodo di tempo in secondi entro cui il gateway deve inviare un'altra richiesta **Gestisci** per evitare di essere nuovamente trasformato in un dispositivo non gestito e contrassegnato come inattivo. Se impostato su 0, il gateway gestito non diventerà inattivo. Quando è impostato, l'impostazione minima supportata è 3600 (1 ora).

source: *supportFirmwareActions* Tells whether the gateway supports firmware actions or not. The gateway must add a firmware handler to handle the firmware requests.
it: *supportFirmwareActions* Indica se il gateway supporta le azioni firmware o meno. Il gateway deve aggiungere un gestore firmware per gestire le richieste firmware.

source: *supportDeviceActions* Tells whether the gateway supports Device actions or not. The gateway must add a Device action handler to handle the reboot and factory reset requests.
it: *supportDeviceActions* Indica se il gateway supporta le azioni del dispositivo o meno. Il gateway deve aggiungere un gestore di azioni del dispositivo per gestire le richieste di riavvio e di ripristino delle impostazioni di fabbrica.

source: Manage request - attached devices
it: Gestione richieste - dispositivi collegati

source: The gateway can invoke sendDeviceManageRequest() method to make the attached devices participate in the device management activities.
it: Il gateway può richiamare il metodo sendDeviceManageRequest() per far sì che i dispositivi collegati partecipino alle attività di gestione del dispositivo.

source: As shown, this method accepts the details of the attached device apart from the lifetime and device/firmware support parameters. The gateway can also use the overloaded sendDeviceManageRequest() method to specify the DeviceData for the attached device.
it: Come riportato, questo metodo accetta i dettagli del dispositivo collegato tranne che il ciclo di vita ed i parametri di supporto del dispositivo/firmware. Il gateway può anche utilizzare il metodo sendDeviceManageRequest() sottoposto ad overload per specificare il DeviceData del dispositivo collegato.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ for more information about the manage operation.
it: Fare riferimento alla `documentazione <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/manage-device#manage-device>`__ per ulteriori informazioni sull'operazione di gestione.

source: Unmanage request - gateway
it: Annullamento della gestione richieste - gateway

source: A gateway can invoke sendGatewayUnmanageRequet() method when it no longer needs to be managed. The IBM Watson Internet of Things Platform will no longer send new device management requests for this gateway and all device management requests from the gateway (only for the gateway and not for the attached devices) will be rejected other than a **Manage** request.
it: Un gateway può richiamare il metodo sendGatewayUnmanageRequet() quando non è più necessario che sia gestito. IBM Watson Internet of Things Platform non invierà più nuove richieste di gestione del dispositivo per questo gateway e tutte le richieste di gestione dispositivo provenienti dal gateway (solo per il gateway e non per i dispositivi collegati) verranno respinte se diverse dalla richiesta **Gestisci**.

source: Unmanage request - attached devices
it: Annullamento della gestione richieste - dispositivi collegati

source: The gateway can invoke sendDeviceUnmanageRequet() method to move the attached device from managed state to unmanaged state. The IBM Watson Internet of Things Platform will no longer send new device management requests for this device and all device management requests from the gateway for this attached device will be rejected other than a **Manage** request.
it: Il gateway può richiamare il metodo sendDeviceUnmanageRequet() per spostare i dispositivi collegati dallo stato gestito a non gestito. IBM Watson Internet of Things Platform non invierà più nuove richieste di gestione del dispositivo per questo dispositivo e tutte le richieste di gestione dispositivo provenienti dal gateway per questo dispositivo collegato verranno respinte se diverse dalla richiesta **Gestisci**.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ for more information about the Unmanage operation.
it: Fare riferimento alla `documentazione <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/unmanage-device#unmanage-device>`__ per ulteriori informazioni sull'operazione di annullamento della gestione.

source: Location update - gateway
it: Aggiornamento ubicazione - gateway

source: Gateways that can determine their location can choose to notify the IBM Watson Internet of Things Platform about location changes. The gateway can invoke one of the overloaded updateLocation() method to update the location of the device.
it: I gateway che possono determinare la loro ubicazione possono scegliere di notificare a IBM Watson Internet of Things Platform le modifiche di ubicazione. Il gateway può invocare uno dei metodi updateLocation() si cui è stato effettuato l'overload per aggiornare l'ubicazione del dispositivo.

source: Location update - attached devices
it: Aggiornamento ubicazione - collegati

source: The gateway can invoke corresponding device method updateDeviceLocation() to update the location of the attached devices. The overloaded method can be used to specify the measuredDateTime and etc..
it: Il gateway può richiamare il metodo dispositivo updateDeviceLocation() corrispondente per aggiornare l'ubicazione dei dispositivi collegati. Il metodo di cui è stato effettuato l'overload può essere utilizzato per specificare il measuredDateTime ed altro.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ for more information about the Location update.
it: Fare riferimento alla `documentazione <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ per ulteriori informazioni sull'aggiornamento dell'ubicazione.

source: Append/Clear ErrorCodes - gateway
it: Aggiunta/Cancellazione dei ErrorCodes - gateway

source: Gateways can choose to notify the IBM Watson Internet of Things Platform about changes in their error status. The gateway can invoke addErrorCode() method to add the current errorcode to Watson IoT Platform.
it: I gateway possono scegliere di notificare a IBM Watson Internet of Things Platform le modifiche nel proprio stato di errore. Il gateway può richiamare il metodo addErrorCode() per aggiungere l'errorcode corrente a Watson IoT Platform.

source: Also, the ErrorCodes of gateway can be cleared from IBM Watson Internet of Things Platform by calling the clearErrorCodes() method as follows:
it: Inoltre, è possibile eliminare ErrorCodes del gateway da IBM Watson Internet of Things Platform richiamando il metodo clearErrorCodes() come illustrato di seguito:

source: Append/Clear ErrorCodes - attached devices
it: Aggiunta/Cancellazione dei ErrorCodes - dispositivi collegati

source: Similarly, the gateway can invoke the corresponding device method to add/clear the errorcodes of the attached devices,
it: In modo simile, il gateway può richiamare il metodo del dispositivo corrispondente per aggiungere/annullare gli errorcodes dei dispositivi collegati,

source: Append/Clear Log messages - gateway
it: Aggiungi/Elimina messaggi log - gateway

source: Gateways can choose to notify the IBM Watson Internet of Things Platform about changes by adding a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data. The gateways can invoke addGatewayLog() method to send log messages,
it: I gateway possono scegliere di notificare a IBM Watson Internet of Things Platform le modifiche aggiungendo una nuova voce log. La voce di log include messaggi di log, la sua registrazione data/ora e gravità, nonché dati di diagnostica binari codificati base64 facoltativi. I gateway possono richiamare il metodo addGatewayLog() per inviare messaggi,

source: Also, the log messages can be cleared from IBM Watson Internet of Things Platform by calling the clearLogs() method as follows:
it: Inoltre, è possibile eliminare i messaggi di log da IBM Watson Internet of Things Platform richiamando il metodo clearLogs() come illustrato di seguito:

source: Append/Clear Logs - attached devices
it: Aggiunta/Cancellazione dei log - dispositivi collegati

source: Similarly, the gateway can invoke the corresponding device method to add/clear the Logs of the attached devices,
it: In modo simile, il gateway può richiamare il metodo del dispositivo corrispondente per aggiungere/annullare i log dei dispositivi collegati,

source: and to clear the Logs of attached devices, invoke the clearDeviceLogs() method with the details of the attached device,
it: e per cancellare i log dei dispositivi collegati, richiamare il metodo clearDeviceLogs() con i dettagli del dispositivo collegato,

source: The device diagnostics operations are intended to provide information on gateway/device errors, and does not provide diagnostic information relating to the devices connection to the IBM Watson Internet of Things Platform.
it: Le operazioni di diagnostica del dispositivo forniscono informazioni sugli errori di dispositivo e non forniscono informazioni diagnostiche relative alla connessione dispositivo a IBM Watson Internet of Things Platform.

source: Refer to the `documentation <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ for more information about the Diagnostics operation.
it: Fare riferimento alla `documentazione <https://docs.internetofthings.ibmcloud.com/devices/device_mgmt/index.html#/update-location#update-location>`__ per ulteriori informazioni sulle operazioni di diagnostica.

source: Firmware Action
it: Azione Firmware

source: The firmware update process is separated into two distinct actions:
it: Il processo di aggiornamento del firmware è separato in due azioni distinte:

source: Downloading Firmware
it: Scaricamento del firmware

source: Updating Firmware.
it: Aggiornamento del firmware.

source: The gateway needs to do the following activities to support Firmware Action for itself and for the attached devices:
it: Il gateway deve completare le seguenti attività per supportare le azioni firmware per se stesso e per i dispositivi collegati:

source: **1. Construct DeviceFirmware Object (Optional)**
it: **1. Costruire l'oggetto DeviceFirmware (Facoltativo)**

source: In order to perform Firmware action, the gateway can optionally construct a DeviceFirmware object for itself and for attached devices and add it to DeviceData as follows:
it: Per eseguire le azioni firmware, il dispositivo può costruire un oggetto DeviceFirmware per se stesso e per i dispositivi collegati ed aggiungerlo a DeviceData come illustrato di seguito:

source: And in the case of attached devices, the constructed DeviceData can be passed to the library while sending the manage request. i.e
it: E nel caso dei dispositivi collegati, il DeviceData costruito può essere trasmesso alla libreria durante l'invio della richiesta di gestione. ad esempio,

source: The DeviceFirmware object represents the current firmware of the gateway or attached device and will be used to report the status of the Firmware Download and Firmware Update actions to IBM Watson Internet of Things Platform. In case this DeviceFirmware object is not constructed by the gateway, the library creates an empty object and reports the status to Watson IoT Platform.
it: L'oggetto DeviceFirmware rappresenta il firmware corrente del gateway o del dispositivo collegato e verrà utilizzato per notificare lo stato delle azioni Scaricamento del firmware e Aggiornamento del firmware a IBM Watson Internet of Things Platform. Nel caso questo oggetto DeviceFirmware non viene costruito dal gateway, la libreria crea un oggetto vuoto e segnala lo stato a Watson IoT Platform.

source: **2. Inform the server about the Firmware action support**
it: **2. Informare il server riguardo al supporto dell'azione firmware**
