Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/java.po
Languages: de, ja, pt_br, zh_cn, zh_tw

source: Java for Gateway Developers
de: Java für Gateway-Entwickler
ja: ゲートウェイ開発者用の Java
pt_br: Java para Desenvolvedores de Gateway
zh_cn: 面向网关开发人员的 Java
zh_tw: 適用於閘道開發人員的 Java

source: See `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub
de: Siehe `iot-java <https://github.com/ibm-messaging/iot-java>`_ in GitHub
ja: GitHub の `iot-java <https://github.com/ibm-messaging/iot-java>`_ を参照してください。
pt_br: Consulte `iot-java <https://github.com/ibm-messaging/iot-java>`_ no GitHub
zh_cn: 请参阅 GitHub 中的 `iot-java <https://github.com/ibm-messaging/iot-java>`_
zh_tw: 請參閱 GitHub 中的 `iot-java <https://github.com/ibm-messaging/iot-java>`_

source: Constructor
de: Konstruktor
ja: コンストラクター
pt_br: Construtor
zh_cn: 构造方法
zh_tw: 建構子

source: The constructor builds the Gateway client instance, and accepts a Properties object containing the following definitions:
de: Der Konstruktor erstellt die Gateway-Clientinstanz und akzeptiert ein Eigenschaftsobjekt, das die folgenden Definitionen enthält:
ja: コンストラクターは、ゲートウェイ・クライアント・インスタンスを構築し、以下の定義を含むプロパティー・オブジェクトを受け入れます。
pt_br: O construtor constrói a instância do cliente do Gateway e aceita um objeto Propriedades contendo as seguintes definições:
zh_cn: 此构造方法用于构建网关客户机实例，并接受包含以下定义的属性对象：
zh_tw: 建構子可建置「閘道」用戶端實例，並接受包含下列定義的 Properties 物件：

source: org - Your organization ID.
de: org - Ihre Organisations-ID.
ja: org - 組織 ID。
pt_br: org - O ID da organização.
zh_cn: org - 贵组织的标识。
zh_tw: org - 組織 ID。

source: type - The type of your Gateway device.
de: type - Der Typ Ihres Gateway-Geräts.
ja: type - ゲートウェイ・デバイスのタイプ。
pt_br: type - O tipo de seu dispositivo de Gateway.
zh_cn: type - 网关设备的类型。
zh_tw: type -「閘道」裝置的類型。

source: id - The ID of your Gateway.
de: id - Die ID Ihres Gateways.
ja: id - ゲートウェイの ID。
pt_br: id - O ID de seu Gateway.
zh_cn: id - 网关的标识。
zh_tw: id -「閘道」的 ID。

source: auth-method - Method of authentication (The only value currently supported is "token").
de: auth-method - Die Methode der Authentifizierung (der einzige derzeit unterstützte Wert ist "token").
ja: auth-method - 認証方式 (現在サポートされている値は「token」のみ)。
pt_br: auth-method - Método de autenticação (O único valor suportado atualmente é "token").
zh_cn: auth-method - 认证方法（当前唯一支持的值为“token”）。
zh_tw: auth-method - 鑑別的方法（目前唯一支援的值是 "token"）。

source: auth-token - API key token.
de: auth-token - Das API-Schlüsseltoken.
ja: auth-token - API キー・トークン。
pt_br: auth-token - Token de chave da API.
zh_cn: auth-token - API 密钥令牌。
zh_tw: auth-token - API 金鑰記號。

source: The Properties object creates definitions which are used to interact with the Watson Internet of Things Platform module.
de: Das Eigenschaftsobjekt erstellt Definitionen, die zur Interaktion mit dem Watson Internet of Things Platform-Modul verwendet werden.
ja: プロパティー・オブジェクトは、Watson Internet of Things Platform モジュールと対話するための定義を作成します。
pt_br: O objeto Propriedades cria definições que são usadas para interagir com o módulo do Watson Internet of Things Platform.
zh_cn: 属性对象创建用于与 Watson Internet of Things Platform 模块进行交互的定义。
zh_tw: Properties 物件會建立用來與 Watson Internet of Things Platform 模組互動的定義。

source: The following code snippet shows how to construct the GatewayClient instance,
de: Das folgende Code-Snippet zeigt die Vorgehensweise beim Erstellen der GatewayClient-Instanz.
ja: GatewayClient インスタンスを作成するコード・スニペットを以下に示します。
pt_br: O fragmento de código a seguir mostra como construir a instância GatewayClient,
zh_cn: 以下代码片段显示如何构造 GatewayClient 实例，
zh_tw: 下列程式碼 Snippet 顯示如何建構 GatewayClient 實例。

source: Using a configuration file
de: Konfigurationsdatei verwenden
ja: 構成ファイルの使用
pt_br: Usando um arquivo de configuração
zh_cn: 使用配置文件
zh_tw: 使用配置檔

source: Instead of including a Properties object directly, you can use a configuration file containing the name-value pairs for Properties. If you are using a configuration file containing a Properties object, use the following code format.
de: Anstatt ein Eigenschaftsobjekt direkt einzubeziehen, können Sie eine Konfigurationsdatei verwenden, die die Name/Wert-Paare für die Eigenschaften enthält. Wenn Sie eine Konfigurationsdatei verwenden, die ein Eigenschaftsobjekt enthält, verwenden Sie das folgende Codeformat.
ja: プロパティー・オブジェクトを直接組み込む代わりに、プロパティーの名前と値のペアを含む構成ファイルを使用できます。プロパティー・オブジェクトを含む構成ファイルを使用する場合、以下のコード形式を使用してください。
pt_br: Em vez de incluir um objeto Propriedades diretamente, você pode usar um arquivo de configuração contendo os pares nome-valor para Propriedades. Se você estiver usando um arquivo de configuração contendo um objeto Propriedades, use o formato de código a seguir.
zh_cn: 您可以使用包含属性的“名称/值”对的配置文件，而不是直接包含属性对象。如果使用的配置文件包含属性对象，请使用以下代码格式。
zh_tw: 可以使用一個包含 Properties 名稱/值配對的配置檔，而不直接包含 Properties 物件。如果使用的配置檔包含 Properties 物件，請使用下列程式碼格式。

source: The Gateway device configuration file must be in the following format:
de: Die Konfigurationsdatei für ein Gateway-Gerät muss im folgenden Format vorliegen.
ja: ゲートウェイ・デバイス構成ファイルは、以下の形式でなければなりません。
pt_br: O arquivo de configuração de dispositivo de Gateway deve estar no seguinte formato:
zh_cn: 网关设备配置文件必须为以下格式：
zh_tw: 「閘道」裝置配置檔必須為下列格式：

source: Connecting to the Watson Internet of Things Platform
de: Herstellen der Verbindung zu Watson Internet of Things Platform
ja: Watson Internet of Things Platform への接続
pt_br: Conectando-se ao Watson Internet of Things Platform
zh_cn: 正在连接到 Watson Internet of Things Platform
zh_tw: 連接至 Watson Internet of Things Platform

source: Connect to the Watson Internet of Things Platform by calling the *connect* function.
de: Stellen Sie die Verbindung zu Watson Internet of Things Platform her, indem Sie die Funktion *connect* aufrufen.
ja: *connect* 関数を呼び出して Watson Internet of Things Platform に接続します。
pt_br: Conecte-se ao Watson Internet of Things Platform chamando a função *connect*.
zh_cn: 通过调用 *connect* 函数连接到 Watson Internet of Things Platform。
zh_tw: 呼叫 *connect* 函數以連接至 Watson Internet of Things Platform。

source: After the successful connection to the IBM Watson IoT Platform, the Gateway client can perform the following operations,
de: Nachdem die Verbindung zu IBM Watson IoT Platform erfolgreich hergestellt wurde, kann der Gateway-Client die folgenden Operationen ausführen:
ja: IBM Watson IoT Platform への接続に成功すると、ゲートウェイ・クライアントは以下の操作を実行できるようになります。
pt_br: Após a conexão bem-sucedida com o IBM IoT Watson Platform, o cliente de Gateway pode executar as seguintes operações:
zh_cn: 成功连接到 IBM Watson IoT Platform 后，网关客户机可以执行以下操作：
zh_tw: 成功連線至 IBM Watson IoT Platform 之後，「閘道」用戶端可以執行下列作業。

source: Publish events for itself and on behalf of devices connected behind the Gateway.
de: Ereignisse für sich selbst publizieren sowie im Namen von Geräten, die sich hinter dem Gateway befinden
ja: ゲートウェイ自体のイベントをパブリッシュすることも、ゲートウェイの内側に接続しているデバイスの代わりにイベントをパブリッシュすることもできます。
pt_br: Publicar eventos por conta própria e em nome de dispositivos conectados por trás do Gateway.
zh_cn: 为其自身和代表网关背后连接的设备发布事件。
zh_tw: 為本身及代表閘道後面連接的裝置發佈事件。

source: Subscribe to commands for itself and on behalf of devices behind the Gateway.
de: Befehle für sich selbst subskribieren sowie im Namen von Geräten, die sich hinter dem Gateway befinden
ja: ゲートウェイ自体に対するコマンドをサブスクライブすることも、ゲートウェイの内側のデバイスの代わりにコマンドをサブスクライブすることもできます。
pt_br: Assinar comandos por conta própria e em nome de dispositivos por trás do Gateway.
zh_cn: 为其自身和代表网关背后的设备预订命令。
zh_tw: 為本身及代表閘道後面的裝置訂閱指令。

source: Register devices using the Watson IoT Platform API
de: Geräte unter Verwendung der API von Watson IoT Platform registrieren
ja: Watson IoT Platform API を使用してデバイスを登録します。
pt_br: Registrar dispositivos usando a API do Watson IoT Platform
zh_cn: 使用 Watson IoT Platform API 注册设备
zh_tw: 使用 Watson IoT Platform API 登錄裝置

source: There are different ways to register the devices behind the Gateway to IBM Watson IoT Platform,
de: Es gibt verschiedene Vorgehensweisen zum Registrieren der Geräte, die sich hinter dem Gateway zu IBM Watson IoT Platform befinden.
ja: ゲートウェイの内側のデバイスを IBM Watson IoT Platform に登録するには、さまざまな方法があります。
pt_br: Há maneiras diferentes para registrar os dispositivos por trás do Gateway para o IBM Watson IoT Platform,
zh_cn: 将网关背后的设备注册到 IBM Watson IoT Platform 有多种不同方法，
zh_tw: 有不同的方式，可將「閘道」後面的裝置登錄至 IBM Watson IoT Platform。

source: **Auto registration**: The device gets added automatically in IBM Watson IoT Platform when Gateway publishes any event/subscribes to any commands for the devices connected to it.
de: **Automatische Registrierung**: Das Gerät wird automatisch in IBM Watson IoT Platform hinzugefügt, wenn das Gateway ein Ereignis publiziert oder einen Befehl subskribiert, das bzw. der sich auf die mit dem Gateway verbundenen Geräte bezieht.
ja: **自動登録**: ゲートウェイが、ゲートウェイに接続しているデバイスの代わりにイベントのパブリッシュやコマンドのサブスクライブを行うと、そのデバイスが IBM Watson IoT Platform に自動的に追加されます。
pt_br: **Registro Automático**: o dispositivo é incluído automaticamente no IBM Watson IoT Platform quando o Gateway publica qualquer evento/assina quaisquer comandos para os dispositivos conectados a ele.
zh_cn: **自动注册**：当网关为连接到它的设备发布任何事件/预订任何命令时，设备自动添加在 IBM Watson IoT Platform 中。
zh_tw: **自動登錄**：當「閘道」為連接至其中的裝置發佈任何事件/訂閱任何指令時，裝置會自動新增在 IBM Watson IoT Platform 中。

source: **API**: The Watson IoT Platform API can be used to register the devices to the Watson IoT Platform.
de: **API**: Die API von Watson IoT Platform kann verwendet werden, um Geräte für Watson IoT Platform zu registrieren.
ja: **API**: Watson IoT Platform API を使用して、Watson IoT Platform にデバイスを登録できます。
pt_br: **API**: O Watson IoT Platform API pode ser usado para registrar os dispositivos no Watson IoT Platform.
zh_cn: **API**：Watson IoT Platform API 可用于将设备注册到 Watson IoT Platform。
zh_tw: **API**：Watson IoT Platform API 可用來將裝置登錄至 Watson IoT Platform。

source: The Watson IoT Platform API can be used to register the devices (that are connected to the Gateway) to the Watson IoT Platform. The APIClient simplifies the interactions with Watson IoT Platform API. Get the APIClient instance by invoking the api() method as follows,
de: Die API von Watson IoT Platform kann zum Registrieren der (mit dem Gateway verbundenen) Geräte für Watson IoT Platform verwendet werden. Der API-Client vereinfacht die Interaktion mit der API von Watson IoT Platform. Rufen Sie die Instanz des API-Clients ab, indem Sie die Methode 'api()' wie folgt aufrufen:
ja: Watson IoT Platform API を使用して、ゲートウェイに接続しているデバイスを Watson IoT Platform に登録できます。APIClient を使用すると、Watson IoT Platform API との対話が簡単になります。APIClient インスタンスを取得するには、api() メソッドを以下のように呼び出します。
pt_br: A API do Watson IoT Platform pode ser usada para registrar os dispositivos (que estão conectados ao Gateway) para a plataforma do Watson IoT. O APIClient simplifica as interações com a API do Watson IoT Platform. Obtenha a instância do APIClient chamando o método api(), conforme a seguir,
zh_cn: Watson IoT Platform API 可用于将设备（连接到网关）注册到 Watson IoT Platform。APIClient 简化与 Watson IoT Platform API 的交互。通过按如下调用 api() 方法可获取 APIClient 实例，
zh_tw: Watson IoT Platform API 可以用來將裝置（連接至「閘道」的裝置）登錄至 Watson IoT Platform。APIClient 可簡化與 Watson IoT Platform API 的互動。請呼叫 api() 方法來取得 APIClient 實例，如下所示。

source: Once you get the handle of APIClient, you can add the devices. Following code snippet shows how to add a device to a Gateway in Watson IoT Platform,
de: Sobald Sie den Handler für den API-Client abgerufen haben, können Sie die Geräte hinzufügen. Das folgende Code-Snippet zeigt, wie ein Gerät zu einem Gateway in Watson IoT Platform hinzugefügt wird.
ja: APIClient のハンドルを取得したら、デバイスを追加できます。Watson IoT Platform でゲートウェイにデバイスを追加するコード・スニペットを以下に示します。
pt_br: Depois de obter o identificador de APIClient, é possível incluir os dispositivos. O fragmento de código a seguir mostra como incluir um dispositivo em um Gateway na Plataforma Watson IoT,
zh_cn: 一旦获取 APIClient 的句柄，即可添加设备。以下代码片段显示如何在 Watson IoT Platform 中向网关添加设备，
zh_tw: 取得 APIClient 的控點之後，就可以新增裝置。下列程式碼 Snippet 會顯示如何將裝置新增至 Watson IoT Platform 中的「閘道」。

source: The gwDeviceId and gwDeviceType are the Gateway properties to which this device will be attached to when its registered.
de: Das Gerät wird beim Registrieren den Gateway-Eigenschaften 'gwDeviceId' und 'gwDeviceType' zugeordnet.
ja: gwDeviceId と gwDeviceType が、登録時にそのデバイスが接続されるゲートウェイのプロパティーです。
pt_br: gwDeviceId e gwDeviceType são as propriedades de Gateway às quais este dispositivo será conectado quando for registrado.
zh_cn: gwDeviceId 和 gwDeviceType 是此设备在注册时将附加到的网关属性。
zh_tw: gwDeviceId 和 gwDeviceType 是此裝置在進行登錄時將連接至其中的「閘道」內容。

source: Publishing events
de: Ereignisse publizieren
ja: イベントのパブリッシング
pt_br: Publicando eventos
zh_cn: 发布事件
zh_tw: 發佈事件

source: Events are the mechanism by which Gateways/devices publish data to the Watson IoT Platform. The Gateway/device controls the content of the event and assigns a name for each event it sends.
de: Ereignisse sind der Mechanismus, mit dem Gateways oder Geräte Daten in Watson IoT Platform publizieren. Das Gateway bzw. Gerät steuert den Inhalt des Ereignisses und ordnet den Namen für jedes von ihm gesendete Ereignis zu.
ja: イベントは、ゲートウェイやデバイスが Watson IoT Platform にデータをパブリッシュするためのメカニズムです。ゲートウェイやデバイスは、イベントのコンテンツを制御し、送信するイベントごとに名前を割り当てます。
pt_br: Eventos são o mecanismo pelo qual Gateways/dispositivos publicam dados na Plataforma Watson IoT. O Gateway/dispositivo controla o conteúdo do evento e designa um nome para cada evento que envia.
zh_cn: 事件是网关/设备将数据发布到 Watson IoT Platform 所采用的机制。网关/设备控制事件的内容，并为其发送的每个事件分配名称。
zh_tw: 事件是「閘道」/裝置藉以將資料發佈到 Watson IoT Platform 的機制。「閘道」/裝置可控制事件的內容，並為它傳送的每一個事件指派一個名稱。

source: **The Gateway can publish events from itself and on behalf of any device connected via the Gateway**.
de: **Das Gateway kann eigene Ereignisse und Ereignisse im Namen aller mit dem Gateway verbundenen Geräte publizieren**.
ja: **ゲートウェイは、ゲートウェイ自体のイベントをパブリッシュすることも、ゲートウェイを経由して接続しているデバイスの代わりにイベントをパブリッシュすることもできます。**
pt_br: **O Gateway pode publicar eventos de si mesmo e em nome de qualquer dispositivo conectado por meio do Gateway**.
zh_cn: **网关可以从其自身和代表通过网关连接的任何设备发布事件**。
zh_tw: **「閘道」可從本身發佈事件，也可代表透過「閘道」連接的任何裝置發佈事件**。

source: When an event is received by the IBM Watson IoT Platform the credentials of the connection on which the event was received are used to determine from which Gateway the event was sent. With this architecture it is impossible for a Gateway to impersonate another device.
de: Wenn ein Ereignis von IBM Watson IoT Platform empfangen wird, werden die Identifikationsdaten der Verbindung, über die das Ereignis empfangen wurde, dazu verwendet, von welchem Gateway das Ereignis gesendet wurde. Diese Architektur macht es für ein Gateway unmöglich, die Identität eines anderen Gateways anzunehmen.
ja: IBM Watson IoT Platform は、イベントを受け取ると、そのイベントを受け取った接続の資格情報に基づいて、イベントの送信元のゲートウェイを特定します。このアーキテクチャーによって、ゲートウェイが別のデバイスの偽名を使用することは不可能になっています。
pt_br: Quando um evento é recebido pelo IBM Watson IoT Platform, as credenciais da conexão na qual o evento foi recebido são usadas para determinar o Gateway pelo qual o evento. Com essa arquitetura, é impossível para um Gateway personificar outro dispositivo.
zh_cn: IBM Watson IoT Platform 接收到事件时，将使用用于接收该事件的连接的凭证来确定从哪个网关发送了该事件。利用此体系结构，可以禁止网关模仿其他设备。
zh_tw: 當 IBM Watson IoT Platform 接收事件時，會使用接收事件的連線認證來判斷是哪個「閘道」傳送了事件。使用此架構，「閘道」就不可能假冒成另一個裝置。

source: Events can be published at any of the three `quality of service levels <../messaging/mqtt.html#/>`__ defined by the MQTT protocol. By default events will be published as qos level 0.
de: Ereignisse können mit jeder der drei 'Servicequalitätsstufen <../messaging/mqtt.html#/>`__, die durch das MQTT-Protokoll definiert sind, publiziert werden. Standardmäßig werden Ereignisse als qos-Stufe 0 publiziert.
ja: イベントは、MQTT プロトコルによって定義された 3 つの `サービスの品質レベル <../messaging/mqtt.html#/>` __ のいずれでもパブリッシュできます。デフォルトで、イベントは qos レベル 0 としてパブリッシュされます。
pt_br: Os eventos podem ser publicados em qualquer um dos três `níveis de qualidade de serviço <../messaging/mqtt.html#/>`__ definidos pelo protocolo MQTT. Por padrão, os eventos serão publicados como qos nível 0.
zh_cn: 可以按 MQTT 协议定义的三个 `服务质量级别 <../messaging/mqtt.html#/>`__ 中的任何一个级别发布事件。缺省情况下，将按 qos 级别 0 发布事件。
zh_tw: 事件可使用 MQTT 通訊協定所定義的三個`服務品質等級<../messaging/mqtt.html#/>`__的其中一個來發佈。依預設，事件會發佈為 qos 等級 0。

source: Publish Gateway event using default quality of service
de: Gateway-Ereignis mit der standardmäßigen Servicequalität publizieren
ja: デフォルトのサービス品質を使用したゲートウェイ・イベントのパブリッシュ
pt_br: Publicar evento do Gateway usando a qualidade de serviço padrão
zh_cn: 使用缺省服务质量发布网关事件
zh_tw: 使用預設服務品質發佈「閘道」事件

source: Publish Gateway event using user-defined quality of service
de: Gateway-Ereignis mit benutzerdefinierter Servicequalität publizieren
ja: ユーザー定義のサービス品質を使用したゲートウェイ・イベントのパブリッシュ
pt_br: Publicar evento do Gateway usando qualidade de serviço definida pelo usuário
zh_cn: 使用用户定义的服务质量发布网关事件
zh_tw: 利用使用者定義的服務品質發佈「閘道」事件

source: Events can be published at higher MQTT quality of service levels, but these events may take slower than QoS level 0, because of the extra confirmation of receipt.
de: Ereignisse könne auf höheren MQTT-Servicequalitätsstufen publiziert werden. Diese Ereignisse können jedoch wegen der zusätzlichen Eingangsbestätigung langsamer als QoS-Stufe 0 sein.
ja: イベントは、より高レベルな MQTT サービスの品質でパブリッシュできますが、余分な受信の確認があるためこれらのイベントは QoS レベル 0 よりも低速になる可能性があります。
pt_br: Os eventos podem ser publicados em níveis de serviço de qualidade de MQTT superiores, mas esses eventos podem ser mais lentos que o QoS nível 0 por causa da confirmação de recebimento extra.
zh_cn: 可在较高的 MQTT 服务质量级别上发布事件，但由于需要额外的接收确认，这些事件的发布可能慢于 QoS 级别 0。
zh_tw: 事件可以用更高的 MQTT 服務品質等級發佈，但這些事件的速度比服務品質等級 0 更慢，因為要進行額外的接收確認。

source: Publishing events from devices
de: Ereignisse von Geräten publizieren
ja: デバイスのイベントのパブリッシュ
pt_br: Publicando eventos a partir de dispositivos
zh_cn: 发布来自设备的事件
zh_tw: 從裝置發佈事件

source: The Gateway can publish events on behalf of any device connected via the Gateway by passing the appropriate typeId and deviceId based on the origin of the event:
de: Das Gateway kann Ereignisse im Namen aller über das Gateway verbundenen Geräte publizieren, indem die zugehörige Typ-ID (typeId) und Geräte-ID (deviceId) auf der Basis des Ereignisursprungs übergeben wird:
ja: ゲートウェイは、イベントの生成元に基づいて適切な typeId と deviceId を渡すことで、ゲートウェイを経由して接続しているデバイスの代わりにイベントをパブリッシュすることができます。
pt_br: O Gateway pode publicar eventos em nome de qualquer dispositivo conectado por meio do Gateway, transmitindo o typeId e deviceId apropriados com base na origem do evento:
zh_cn: 网关可以通过基于事件源传递相应的 typeId 和 deviceId，以代表通过网关连接的任何设备发布事件：
zh_tw: 「閘道」可以代表透過「閘道」連接的任何裝置發佈事件，方法為根據事件的起源傳遞適當的 typeId 和 deviceId：

source: One can use the overloaded publishDeviceEvent() method to publish the device event in the desired quality of service. Refer to `MQTT Connectivity for Gateways <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ documentation to know more about the topic structure used.
de: Mit der überladenen Methode 'publishDeviceEvent()' kann das Geräteereignis mit der gewünschten Servicequalität publiziert werden. Weitere Informationen zu der verwendeten Themenstruktur finden Sie in der Dokumentation `MQTT-Konnektivität für Gateways <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__.
ja: 多重定義の publishDeviceEvent() メソッドを使用して、必要なサービス品質でデバイス・イベントをパブリッシュできます。使用するトピック構造の詳細については、`MQTT ゲートウェイ接続 <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ の資料を参照してください。
pt_br: É possível usar o método publishDeviceEvent() sobrecarregado para publicar o evento de dispositivo na qualidade de serviço desejada. Consulte a documentação `Conectividade de MQTT para Gateways <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ para saber mais sobre a estrutura de tópico usada.
zh_cn: 用户可使用重载的 publishDeviceEvent() 方法发布期望服务质量的设备事件。请参阅 `网关的 MQTT 连接 <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ 文档以了解有关所使用的主题结构的更多信息。
zh_tw: 可以使用超載的 publishDeviceEvent() 方法，發佈所需服務品質中的裝置事件。請參閱 `閘道的 MQTT 連線功能 <https://docs.internetofthings.ibmcloud.com/gateways/mqtt.html>`__ 文件，以進一步瞭解所使用的主題結構。

source: Handling commands
de: Befehle verarbeiten
ja: コマンドの処理
pt_br: Manipulando comandos
zh_cn: 处理命令
zh_tw: 處理指令

source: The Gateway can subscribe to commands directed at the gateway itself and to any device connected via the gateway. When the Gateway client connects, it automatically subscribes to any commands for this Gateway. But to subscribe to any commands for the devices connected via the Gateway, use one of the overloaded subscribeToDeviceCommands() method, for example,
de: Das Gateway kann Befehle subskribieren, die an das Gateway selbst gerichtet sind, oder an Geräte, die über das Gateway verbunden sind. Wenn der Gateway-Client eine Verbindung herstellt, werden automatisch alle Befehle für das betreffende Gateway subskribiert. Verwenden Sie zum Subskribieren von Befehlen für die über das Gateway verbundenen Geräte eine der überladenen Funktionen 'subscribeToDeviceCommands()', wie zum Beispiel:
ja: ゲートウェイは、ゲートウェイ自体に対するコマンドをサブスクライブすることも、ゲートウェイを経由して接続しているデバイスに対するコマンドをサブスクライブすることもできます。ゲートウェイ・クライアントは、接続時に自動的にそのゲートウェイに対するコマンドをサブスクライブします。一方、そのゲートウェイを経由して接続しているデバイスに対するコマンドをサブスクライブするには、多重定義の subscribeToDeviceCommands() メソッドのいずれかを使用します。以下に例を示します。
pt_br: O Gateway pode assinar comandos direcionados no gateway em si e para qualquer dispositivo conectado por meio do gateway. Quando o cliente do Gateway se conecta, ele assina automaticamente quaisquer comandos para esse Gateway. Mas, para assinar todos os comandos para os dispositivos conectados por meio do Gateway, use um dos métodos subscribeToDeviceCommands() sobrecarregados, por exemplo,
zh_cn: 网关可以预订针对网关自身的命令和通过网关连接的任何设备。当网关客户机连接时，它自动预订此网关的任何命令。但要预订通过网关连接的设备的任何命令，请使用重载的 subscribeToDeviceCommands() 方法之一，例如，
zh_tw: 「閘道」可以訂閱閘道本身中指示的指令，以及傳送到透過閘道連接之任何裝置的指令。當「閘道」用戶端連接時，它會自動為此「閘道」訂閱任何指令。但是，若要為透過「閘道」連接的裝置訂閱任何指令，請使用其中一個超載的 subscribeToDeviceCommands() 方法，例如，

source: To process specific commands you need to register a command callback method. The messages are returned as an instance of the Command class which has the following properties:
de: Zum Verarbeiten bestimmter Befehle müssen Sie eine Callback-Methode für Befehle registrieren. Die Nachrichten werden als eine Instanz der Befehlsklasse zurückgegeben, die die folgenden Eigenschaften hat:
ja: 特定のコマンドを処理するには、コマンド・コールバック・メソッドを登録する必要があります。メッセージは、以下のプロパティーを持つ Command クラスのインスタンスとして返されます。
pt_br: Para processar comandos específicos, você precisa registrar um método de retorno de chamada de comando. As mensagens são retornadas como uma instância da classe Comando, que possui as seguintes propriedades:
zh_cn: 要处理特定命令，需要注册命令回调方法。消息将作为 Command 类的实例返回，具有以下属性：
zh_tw: 若要處理特定指令，您必須登錄指令回呼方法。會以「指令」類別的實例傳回訊息，且此類別具有下列內容：

source: deviceType - The device type for which the command is received.
de: deviceType - Der Gerätetyp, für den der Befehl empfangen wird.
ja: deviceType - コマンドを受け取るデバイスのタイプ。
pt_br: deviceType - O tipo de dispositivo para o qual o comando é recebido.
zh_cn: deviceType - 为其接收到命令的设备类型。
zh_tw: deviceType - 接收指令的裝置類型。

source: deviceId - The device id for which the command is received, Could be the Gateway or any device connected via the Gateway.
de: deviceId - Die Geräte-ID, für die der Befehl empfangen wird (dies kann das Gateway oder ein über das Gateway verbundenes Gerät sein).
ja: deviceId - コマンドを受け取るデバイスの ID。ゲートウェイか、ゲートウェイを経由して接続しているデバイスの ID です。
pt_br: deviceId - O ID do dispositivo para o qual o comando é recebido, poderia ser o Gateway ou qualquer dispositivo conectado por meio do Gateway.
zh_cn: deviceId - 为其接收到命令的设备标识，可以是网关或通过网关连接的任何设备。
zh_tw: deviceId - 接收指令的裝置 ID。可以是「閘道」或任何透過「閘道」連接的裝置。

source: payload - The command payload.
de: payload - Die Nutzdaten für den Befehl.
ja: payload - コマンド・ペイロード。
pt_br: payload - A carga útil do comando.
zh_cn: payload - 命令有效内容。
zh_tw: payload - 指令內容。
