Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/mqtt.po
Languages: de, pt_br, zh_tw

source: MQTT Connectivity for Gateways
de: MQTT-Konnektivität für Gateways
pt_br: Conectividade do MQTT para Gateways
zh_tw: 閘道的 MQTT 連線功能

source: MQTT client connection
de: MQTT-Clientverbindung
pt_br: Conexão do cliente MQTT
zh_tw: MQTT 用戶端連線

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for gateways in that organization.
de: Jede registrierte Organisation hat einen eindeutigen Endpunkt, der beim Verbinden von MQTT-Clients für Gateways in dieser Organisation verwendet werden muss.
pt_br: Cada organização registrada possui um terminal exclusivo que deve ser usado ao conectar clientes MQTT para gateways nessa organização.
zh_tw: 每一個已登錄的組織都有唯一的端點，當針對該組織中的閘道連接 MQTT 用戶端時必須使用此端點。

source: In the IoT Platform dashboard, devices and gateways which are connected directly to the IoT Platform display a status icon indicating that they are connected. The dashboard displays devices which are connected indirectly via a gateway as disconnected as it does not have any knowledge of a devices connectivity to the gateway.
de: Im IoT Platform-Dashboard wird für Geräte und Gateways, die direkt mit IoT Platform verbunden sind, ein Statussymbol angezeigt, das angibt, dass eine Verbindung besteht. Geräte, die indirekt über ein Gateway verbunden sind, werden im Dashboard als nicht verbunden angezeigt, da das Dashboard nicht über Informationen zur Konnektivität eines Geräts zum Gateway verfügt.
pt_br: No painel IoT Platform, dispositivos e gateways que estão conectados diretamente ao IoT Platform exibem um ícone de status indicando que eles estão conectados. O painel exibe dispositivos que são conectados indiretamente via um gateway, que desconectado não possui conhecimento de uma conectividade de dispositivos para o gateway.
zh_tw: 在 IoT Platform 儀表板中，直接連接至 IoT Platform 的裝置及閘道會顯示狀態圖示，其指出裝置及閘道是否已連線。儀表板會將透過閘道間接連接的裝置顯示為已中斷連線，因為它不知道裝置與閘道的連線。

source: Unencrypted client connection
de: Nicht verschlüsselte Clientverbindung
pt_br: Conexão do cliente não criptografada
zh_tw: 未加密的用戶端連線

source: Connect on port **1883**
de: Verbindung auf Port **1883** herstellen
pt_br: Conectar à porta **1883**
zh_tw: 在埠 **1883** 連接

source: All information your gateway submits is being sent in plain text (including the authentication credentials for your gateway). We recommend the use of an encrypted connection whenever possible.
de: Alle Informationen, die Ihr Gateway übergibt, werden in einfachem Text gesendet (einschließlich der Authentifizierungsnachweise für Ihr Gateway). Wir empfehlen die Verwendung einer verschlüsselten Verbindung, wann immer möglich.
pt_br: Todas as informações que seu gateway envia estão sendo enviadas em texto simples (incluindo as credenciais de autenticação para seu gateway). Recomendamos o uso de uma conexão criptografada sempre que possível.
zh_tw: 閘道提交的所有資訊將以純文字傳送（包括閘道的鑑別認證）。我們建議盡可能使用加密連線。

source: Encrypted client connection
de: Verschlüsselte Clientverbindung
pt_br: Conexão do cliente criptografada
zh_tw: 已加密的用戶端連線

source: Connect on port **8883** or **443** for websockets. In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
de: Verbindung auf **8883** oder **443** für Websockets herstellen. In vielen Clientbibliotheken müssen Sie das öffentliche Zertifikat des Servers im Pem-Format angeben. Die folgende Datei enthält die gesamte Zertifikatskette für \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
pt_br: Conectar à porta **8883** ou **443** para websockets. Em muitas bibliotecas de clientes, você precisará fornecer um certificado público do servidor no formato pem. O arquivo a seguir contém a sequência de certificados inteira para \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
zh_tw: 針對 Websocket，在埠 **8883** 或 **443** 連接。在許多用戶端程式庫中，您需要以 pem 格式提供伺服器的公用憑證。下列檔案包含 \*.messaging.internetofthings.ibmcloud.com: messaging.pem_ 的整個憑證鏈

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
de: Einige SSL-Clientbibliotheken können keine Platzhalterdomänen handhaben; wenn Sie keine Bibliotheken wechseln können, müssen in diesem Fall die Zertifikatsprüfung inaktivieren.
pt_br: Algumas bibliotecas do cliente SSL demonstraram não manipular domínios com caractere curinga; neste caso, se você não puder mudar as bibliotecas, será necessário desativar a verificação de certificados.
zh_tw: 部分 SSL 用戶端程式庫已表明不處理含萬用字元的網域，在該情況下，如果您無法變更程式庫，則需要關閉憑證檢查。

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
de: Für IoT Platform ist TLS v1.2 erforderlich. Wir empfehlen die folgenden Cipher-Suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 oder AES128-GCM-SHA256 *(ab 1. Juni 2015)*.
pt_br: O IoT Platform requer o TLS v1.2. Sugerimos os seguintes conjuntos de cifras: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 ou AES128-GCM-SHA256 *(a partir de 1 de junho de 2015)*.
zh_tw: IoT Platform 需要 TLS 1.2 版。我們建議使用下列密碼組合：ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256 或 AES128-GCM-SHA256 *（從 2015 年 6 月 1 日開始）*。

source: MQTT client identifier
de: MQTT-Client-ID
pt_br: Identificador de cliente MQTT
zh_tw: MQTT 用戶端 ID

source: A gateway must authenticate using a client ID in the following format:
de: Ein Gateway muss die Authentifizierung mit einer Client-ID im folgenden Format durchführen:
pt_br: Um gateway deve autenticar usando um ID de cliente no seguinte formato:
zh_tw: 閘道必須使用下列格式的用戶端 ID 進行鑑別：

source: **g** idenfities your client as a gateway
de: **g** identifiziert Ihren Client als ein Gateway.
pt_br: **g** identifica seu cliente como um gateway
zh_tw: **g** 將用戶端識別為閘道

source: **orgId** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
de: **orgId** ist Ihre eindeutige Organisations-ID, die beim Registrieren im Service zugeordnet wird. Die Organisations-ID ist eine alphanumerische Zeichenfolge mit 6 Zeichen.
pt_br: **orgId** é seu ID exclusivo da organização, designado quando você se inscreve no serviço. Ele será uma sequência alfanumérica de 6 caracteres.
zh_tw: **orgId** 是唯一的組織 ID，當您註冊服務時會指派該 ID。它將會是一個 6 字元的英數字串。

source: **typeId** is intended to be used as an identifier of the type of gateway connecting, it may be useful to think of this as analogous to a model number.
de: **typeId** dient als Kennung für den Typ des zu verbindenden Gateways. Diese Kennung kann man sich wie eine Modellnummer vorstellen.
pt_br: **typeId** destina-se a ser usado como um identificador do tipo de conexão de gateway, pode ser útil pensar nisso da mesma forma que um número do modelo.
zh_tw: **typeId** 預期作為所要連接之閘道類型的 ID，將其想成類似於型號可能會有幫助。

source: **deviceId** must uniquely identify a gateway device across all gateways of a specific type, it may be useful to think of this as analogous to a serial number.
de: **deviceId** muss ein Gateway-Gerät für alle Gateways eines bestimmten Typs eindeutig identifizieren. Diese ID kann man sich wie eine Seriennummer vorstellen.
pt_br: **deviceId** deve identificar exclusivamente um dispositivo de gateway em todos os gateways de um tipo específico, pode ser útil pensar nisso da mesma forma que um número de série.
zh_tw: **deviceId** 必須能夠在特定類型的所有閘道之間唯一地識別閘道裝置，將其想成類似於序號可能會有幫助。

source: You can use any scheme of your choice when assigning values for ``typeId`` and ``deviceId``, however the following restrictions apply to both:
de: Sie können ein beliebiges Schema verwenden, wenn Sie Werte für ``typeId`` und ``deviceId`` zuweisen; in beiden Fällen gelten jedoch die folgenden Einschränkungen:
pt_br: É possível usar qualquer esquema de sua escolha ao designar valores para ``typeId`` e ``deviceId`, no entanto, as seguintes restrições se aplicam a ambos:
zh_tw: 指派 ``typeId`` 和 ``deviceId`` 的值時，您可以使用自己選擇的任何方法，但兩者都有下列限制：

source: Maximum length of 36 characters
de: Maximale Länge von 36 Zeichen
pt_br: Comprimento máximo de 36 caracteres
zh_tw: 長度上限為 36 個字元

source: Must comprise only alpha-numeric characters (``a-z``, ``A-Z``, ``0-9``) and the following special characters:
de: Darf nur alphanumerische Zeichen (``a - z``, ``A - Z``, ``0 - 9``) und die folgenden Sonderzeichen umfassen:
pt_br: Deve abranger apenas caracteres alfanuméricos (` a-z``, ``A-Z`, ``0-9``) e os seguintes caracteres especiais:
zh_tw: 只能包含英數字元（``a-z``、``A-Z``、``0-9``）和下列特殊字元：

source: dash (``-``)
de: Gedankenstrich (``-``)
pt_br: traço (``-``)
zh_tw: 橫線 (``-``)

source: underscore (``_``)
de: Unterstreichungszeichen (``_``)
pt_br: sublinhado (``_``)
zh_tw: 底線 (``_``)

source: dot (``.``)
de: Punkt (``.``)
pt_br: ponto (``.``)
zh_tw: 句點 (``.``)

source: MQTT authentication
de: MQTT-Authentifizierung
pt_br: Autenticação MQTT
zh_tw: MQTT 鑑別

source: Username
de: Benutzername
pt_br: Nome do usuário
zh_tw: 使用者名稱

source: The service currently only supports token-based authentication for devices, as such there is only one valid username for gateways today.
de: Der Service unterstützt zur Zeit nur die tokenbasierte Authentifizierung für Geräte. Es gibt heute nur einen gültigen Benutzernamen für Gateways.
pt_br: O serviço suporta atualmente apenas a autenticação baseada em token para dispositivos, assim, há apenas um nome de usuário válido para gateways hoje.
zh_tw: 此服務目前只支援裝置的記號型鑑別，因此目前閘道只有一個有效的使用者名稱。

source: A value of ``use-token-auth`` indicates to the service that the authentication token for the gateway will be passed as the password for the MQTT connection.
de: Der Wert ``use-token-auth`` teilt dem Service mit, dass das Authentifizierungstoken für das Gateway als Kennwort für die MQTT-Verbindung übergeben wird.
pt_br: Um valor de ``use-token-auth`` indica ao serviço que o token de autenticação para o gateway será transmitido como a senha para a conexão de MQTT.
zh_tw: ``use-token-auth`` 值向該服務指出閘道的鑑別記號將傳遞作為 MQTT 連線的密碼。

source: Password
de: Kennwort
pt_br: Senha
zh_tw: 密碼

source: When using token based authentication submit the device authentication token as the password when making your MQTT connection.
de: Bei der Verwendung der tokenbasierten Authentifizierung übergeben Sie das Geräteauthentifizierungstoken als Kennwort, wenn Sie Ihre MQTT-Verbindung einrichten.
pt_br: Ao usar a autenticação baseada em token, envie o token de autenticação de dispositivo como a senha ao estabelecer sua conexão MQTT.
zh_tw: 使用記號型鑑別時，請提出裝置鑑別記號作為建立 MQTT 連線時的密碼。

source: Publishing events
de: Ereignisse publizieren
pt_br: Publicando eventos
zh_tw: 發佈事件

source: A gateway can publish events from itself and on behalf of any device connected via the gateway by using the following topic and substituting in the appropriate ``typeId`` and ``deviceId`` based on the intended origin of the event:
de: Ein Gateway kann Ereignisse für sich selbst sowie im Namen beliebiger über das Gateway verbundener Geräte publizieren, indem das folgende Topic verwendet und die zugehörige Typ-ID (``typeId``) und Geräte-ID (``deviceId``) auf der Basis des beabsichtigten Ereignisursprungs ersetzt werden:
pt_br: Um gateway pode publicar eventos de si mesmo e em nome de qualquer dispositivo conectado por meio do gateway usando o tópico a seguir e substituindo no ``typeId`` e ``deviceId`` apropriados com base na origem desejada do evento:
zh_tw: 閘道可從本身以及代表透過「閘道」連接的任何裝置發佈事件，方法為根據預期的事件起源使用下列主題，並在適當的 ``typeId`` 和 ``deviceId`` 中進行替換：

source: Example
de: Beispiel
pt_br: Exemplo:
zh_tw: 範例

source: mygateway
de: meingateway

source: Device 1
de: Gerät 1
pt_br: Dispositivo 1
zh_tw: 裝置 1

source: mydevice
de: meingerät

source: device1
de: gerät1

source: Gateway 1 can publish its own status events: ``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json``
de: Gateway 1 kann eigene Statusereignisse publizieren: ``iot-2/type/meingateway/id/gateway1/evt/status/fmt/json``
pt_br: O Gateway 1 pode publicar seus próprios eventos de status: ``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json``
zh_tw: 「閘道 1」可以發佈自己的狀態事件：``iot-2/type/mygateway/id/gateway1/evt/status/fmt/json``

source: Gateway 1 can publish status events on behalf of Device 1: ``iot-2/type/mydevice/id/device1/evt/status/fmt/json``
de: Gateway 1 kann Statusereignisse im Namen von Gerät 1 publizieren: ``iot-2/type/meingerät/id/gerät1/evt/status/fmt/json``
pt_br: Gateway 1 pode publicar eventos de status em nome do Dispositivo 1: ``iot-2/type/mydevice/id/device1/evt/status/fmt/json``
zh_tw: 「閘道 1」可以代表「裝置 1」發佈狀態事件：``iot-2/type/mydevice/id/device1/evt/status/fmt/json``

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
de: Die Nachrichtennutzdaten sind auf maximal 131072 Byte begrenzt. Größere Nachrichten werden abgelehnt.
pt_br: A carga útil da mensagem é limitada a um máximo de 131072 bytes. Mensagens maiores do que esta serão rejeitadas.
zh_tw: 訊息內容的位元組數上限為 131072 個位元組。大於此上限的訊息將遭到拒絕。

source: Subscribing to commands
de: Befehle subskribieren
pt_br: Assinando comandos
zh_tw: 訂閱指令

source: A gateway can subscribe to commands directed at the gateway itself and to any device connected via the gateway by using the following topic and substituting in the appropriate ``typeId`` and ``deviceId``:
de: Ein Gateway kann Befehle für sich selbst sowie im Namen beliebiger über das Gateway verbundener Geräte subskribieren, indem das folgende Topic verwendet und die zugehörige Typ-ID (``typeId``) und Geräte-ID (``deviceId``) ersetzt wird:
pt_br: Um gateway pode assinar comandos direcionados no gateway em si e para qualquer dispositivo conectado por meio do gateway usando o tópico a seguir e substituindo no ``typeId `` e ``deviceId`` apropriados:
zh_tw: 閘道可以訂閱閘道本身中指示的指令，以及傳送至透過閘道連接之任何裝置的指令，方法為使用下列主題，並在適當的 ``typeId`` 和 ``deviceId`` 中進行替換：

source: The MQTT ``+`` wildcard can be used for ``typeId``, ``deviceId``, ``commandId`` and ``formatString`` to subscribe to multiple command sources.
de: Das MQTT-Platzhalterzeichen ``+`` kann für ``typeId``, ``deviceId``, ``commandId`` und ``formatString`` verwendet werden, um mehrere Befehlsquellen zu subskribieren.
pt_br: O curinga ``+`` do MQTT pode ser usado para ``typeId``, ``deviceId``, ``commandId`` e ``formatString`` para assinar várias fontes de comandos.
zh_tw: MQTT ``+`` 萬用字元可以用於 ``typeId``、``deviceId``、``commandId`` 和 ``formatString``，以訂閱多個指令來源。

source: Gateway 1 can subscribe to commands directed at the gateway: ``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+``
de: Das Gateway 1 kann Befehle subskribieren, die an das Gateway gerichtet sind: ``iot-2/type/meingateway/id/gateway1/cmd/+/fmt/+``.
pt_br: Gateway 1 pode assinar comandos direcionados no gateway: ``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+``
zh_tw: 「閘道 1」可以訂閱閘道中指示的指令：``iot-2/type/mygateway/id/gateway1/cmd/+/fmt/+``

source: Gateway 1 can subscribe to commands sent to Device 1: ``iot-2/type/mydevice/id/device1/cmd/+/fmt/+``
de: Das Gateway 1 kann Befehle subskribieren, die an das Gerät 1 gesendet wurden: ``iot-2/type/meingerät/id/gerät1/cmd/+/fmt/+``.
pt_br: Gateway 1 pode assinar comandos enviados ao Dispositivo 1: ``iot-2/type/mydevice/id/device1/cmd/+/fmt/+``
zh_tw: 「閘道 1」可以訂閱傳送至「裝置 1」的指令：``iot-2/type/mydevice/id/device1/cmd/+/fmt/+``

source: Gateway 1 can subscribe any command sent to devices of type "mydevice": ``iot-2/type/mydevice/id/+/cmd/+/fmt/+``
de: Das Gateway 1 kann jeden Befehl subskribieren, der an Geräte des Typs "meingerät" gesendet wurde: ``iot-2/type/meingerät/id/+/cmd/+/fmt/+``.
pt_br: Gateway 1 pode assinar qualquer comando enviado ao dispositivo do tipo "mydevice": ``iot-2/type/mydevice/id/+/cmd/+/fmt/+``
zh_tw: 「閘道 1」可以訂閱任何傳送至類型為 "mydevice" 之裝置的指令：``iot-2/type/mydevice/id/+/cmd/+/fmt/+``

source: MQTT persistent sessions (cleansession=false) do not roam for devices which connect to gateways. What this means is that if a device connects to gateway A, then later connects to gateway B, it will not receive any messages that had been published to gateway A for that device while it was disconnected. A gateway owns the MQTT client and subscription, not the devices which are connected to the gateway.
de: Persistente MQTT-Sitzungen (cleansession=false) suchen nicht per Roaming nach Geräten, die Verbindungen zu Gateways herstellen. Dies bedeutet Folgendes: Wenn ein Gerät eine Verbindung zu Gateway A und zu einem späteren Zeitpunkt eine Verbindung zu Gateway B herstellt, erhält es keine Nachrichten, die in Gateway A für dieses Gerät publiziert wurden, während es nicht verbunden war. Ein Gateway ist Eigner des MQTT-Clients und der Subskription, nicht der Geräte, die mit dem Gateway verbunden sind.
pt_br: Sessões persistentes de MQTT (cleansession=false) não se movem para dispositivos que se conectam aos gateways. Isso significa que se um dispositivo se conectar ao gateway A, e posteriormente se conectar ao gateway B, ele não receberá nenhuma mensagem publicada para o gateway A desse dispositivo enquanto estiver desconectado. Um gateway possui o cliente e assinatura de MQTT, não os dispositivos que estão conectados ao gateway.
zh_tw: 對於連接至閘道的裝置，MQTT 持續性階段作業 (cleansession=false) 不會漫遊。這意味著如果裝置連接至閘道 A，稍後連接至閘道 B，則在該裝置處於斷線模式時，將不會收到針對該裝置發佈至閘道 A 的任何訊息。閘道擁有 MQTT 用戶端和訂閱，而不是閘道所連接的裝置。

source: Gateway auto-registration
de: Automatische Registrierung für das Gateway
pt_br: Autorregistro de gateway
zh_tw: 閘道自動登錄

source: Gateway devices have the ability to automatically register devices which are connected to them. When a gateway publishes a message or subscribes to a topic on behalf of another device, that device will automatically be registered if it does not already exist.
de: Gateway-Geräte können Geräte, die mit ihnen verbunden werden, automatisch registrieren. Wenn ein Gateway für ein anderes Gerät eine Nachricht publiziert oder ein Topic subskribiert, wird dieses Geräte automatisch registriert, falls es nicht bereits vorhanden ist.
pt_br: Os dispositivos de gateway têm a capacidade de registrar automaticamente os dispositivos que estão conectados a eles. Quando um gateway publica uma mensagem ou assina um tópico em nome de outro dispositivo, esse dispositivo será registrado automaticamente se ainda não existir.
zh_tw: 閘道裝置可以自動登錄與其連接的裝置。在閘道代表其他裝置發佈訊息或訂閱主題時，如果該裝置尚不存在，則會自登錄該裝置。

source: Registration requests from gateway devices are throttled to 128 pending requests at a time. If trying to connect many new devices to a gateway which have not previously been registered, then there may be some delay in the registration of the devices through the gateway.
de: Registrierungsanforderungen von Gateway-Geräten werden auf jeweils 128 anstehende Anforderungen begrenzt. Wenn versucht wird, zahlreiche noch nicht registrierte Geräte mit einem Gateway zu verbinden, kann es zu Verzögerungen bei der Registrierung der Geräte über das Gateway kommen.
pt_br: As solicitações de registro dos dispositivos de gateway são reguladas para 128 solicitações pendentes por vez. Se ao tentar conectar muitos novos dispositivos a um gateway que não foi registrado anteriormente, haverá algum atraso no registro dos dispositivos por meio do gateway.
zh_tw: 來自閘道裝置的登錄要求每次都會節流控制為 128 個擱置要求。如果嘗試將許多新裝置連接至先前並未登錄的閘道，則在透過閘道登錄裝置時可能會存在一些延遲。

source: If the gateway fails to automatically register a device, then it will not attempt to register that device again for a short period of time. Any messages or subscriptions from the failed device will be dropped during that time.
de: Wenn das Gateway ein Gerät nicht automatisch registrieren kann, versucht für einen kurzen Zeitraum nicht erneut, dieses Gerät zu registrieren. Alle Nachrichten oder Subskriptionen des Geräts, für das die Registrierung fehlgeschlagen ist, werden in diesem Zeitraum gelöscht.
pt_br: Se o gateway falhar ao registrar automaticamente um dispositivo, ele não tentará registrar esse dispositivo novamente durante um curto período. Quaisquer mensagens ou assinaturas do dispositivo com falha serão eliminadas durante esse período.
zh_tw: 如果閘道無法自動登錄裝置，則在短時間內不會再次嘗試登錄該裝置。在這段時間內，將會捨棄來自失敗裝置的所有訊息或訂閱。

source: Gateway notifications
de: Gateway-Benachrichtigungen
pt_br: Notificações de gateway
zh_tw: 閘道通知

source: When errors occur during the validation of the publish or subscribe topic, or during automatic registration, a notification will be sent to the gateway device. A gateway can receive these notifications by subscribing to the following topic, substituting in its own ``typeId`` and ``deviceId``:
de: Wenn bei der Validierung des Publizierungs- oder Subskriptionstopics oder bei der automatischen Registrierung Fehler auftreten, wird eine Benachrichtigung an das Gateway-Gerät gesendet. Ein Gateway kann diese Benachrichtigungen erhalten, indem es das folgende Topic subskribiert, wobei eigene Werte für ``typeId`` und ``deviceId`` eingesetzt werden.
pt_br: Quando ocorrerem erros durante a validação do tópico de publicação ou assinatura ou durante o registro automático, uma notificação será enviada ao dispositivo de gateway. Um gateway pode receber essas notificações assinando o tópico a seguir, substituindo em seu próprio ``typeId`` e ``deviceId``:
zh_tw: 如果在驗證發佈或訂閱主題或是自動登錄期間發生錯誤，則會將通知傳送至閘道裝置。閘道可以透過訂閱下列主題來接收這些通知（以它自己的 ``typeId`` 及 ``deviceId`` 進行替換）：

source: Messages received on the notify topic will have the following format:
de: Nachrichten, die über das Benachrichtigungstopic empfangen werden, weisen das folgende Format auf:
pt_br: As mensagens recebidas no tópico de notificação terão o formato a seguir:
zh_tw: 在通知主題中收到的訊息將具有下列格式：

source: Request_Type: Either publish or subscribe
de: Anforderungstyp: Publizierung oder Subskription
pt_br: Request_Type: publicar ou assinar
zh_tw: Request_Type：發佈或訂閱

source: Timestamp: Time in ISO 8601 Format
de: Zeitmarke: Zeit im Format ISO 8601
pt_br: Registro de data e hora: horário no formato ISO 8601
zh_tw: 時間戳記：ISO 8601 格式的時間

source: Topic: The request topic from the gateway
de: Topic: Anforderungstopic des Gateways
pt_br: Tópico: o tópico de solicitação do gateway
zh_tw: 主題：來自閘道的要求主題

source: Device_Type: The device type from the topic
de: Gerätetyp: Gerätetyp des Topics
pt_br: Device_Type: o tipo de dispositivo do tópico
zh_tw: Device_Type：來自主題的裝置類型

source: Device_Id: The device id from the topic
de: Geräte-ID: Geräte-ID des Topics
pt_br: Device_Id: o ID do dispositivo do tópico
zh_tw: Device_Id：來自主題的裝置 ID

source: ClientID: The client id of the request
de: Client-ID: Client-ID der Anforderung
pt_br: ClientID: o ID do cliente da solicitação
zh_tw: ClientID：要求的用戶端 ID

source: RC: The return code
de: RC: Rückgabecode
pt_br: RC: o código de retorno
zh_tw: RC：回覆碼

source: Message: The error message
de: Nachricht: Fehlernachricht
pt_br: Mensagem: a mensagem de erro
zh_tw: 訊息：錯誤訊息

source: Notifications a gateway may receive:
de: Ein Gateway kann die folgenden Benachrichtigungen erhalten:
pt_br: Notificações que um gateway pode receber:
zh_tw: 閘道可能會收到的通知：

source: Topic does not match with any allowed topic rules.
de: Topic entspricht nicht den zulässigen Topicregeln.
pt_br: O tópico não corresponde a nenhuma regra de tópico permitida.
zh_tw: 主題不符合任何容許的主題規則。

source: Device type is not valid.
de: Gerätetyp ist nicht gültig.
pt_br: O tipo de dispositivo não é válido.
zh_tw: 裝置類型無效。

source: Device id is not valid.
de: Gerät ist nicht gültig.
pt_br: O ID do dispositivo não é válido.
zh_tw: 裝置 ID 無效。

source: Maximum number of devices per gateway has been reached.
de: Die maximal zulässige Anzahl von Geräten pro Gateway ist erreicht.
pt_br: O número máximo de dispositivos por gateway foi atingido.
zh_tw: 已達到每個閘道的裝置數上限。
