Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/gateways/mqtt.po
Languages: de, pt_br, zh_tw

source: Maximum number of devices per organization has been reached.
de: Die maximal zulässige Anzahl von Geräten pro Organisation ist erreicht.
pt_br: O número máximo de dispositivos por organização foi atingido.
zh_tw: 已達到每個組織的裝置數上限。

source: Failed to create device due to internal errors.
de: Erstellung des Geräts aufgrund interner Fehler fehlgeschlagen.
pt_br: Falha ao criar o dispositivo devido a erros internos.
zh_tw: 無法建立裝置，因為發生內部錯誤。

source: Managed Gateways
de: Verwaltete Gateways
pt_br: Gateways Gerenciados
zh_tw: 受管理閘道

source: Support for device lifecycle management is optional, the device management protocol used by IoT Platform utilises the same MQTT connection that your gateway already uses for events and command control.
de: Die Unterstützung für das Lebenszyklusmanagement von Geräten ist optional. Das von IoT Platform verwendete Gerätemanagementprotokoll verwendet dieselbe MQTT-Verbindung, die auch Ihr Gateway für Ereignisse und für die Befehlssteuerung verwendet.
pt_br: O suporte para gerenciamento de ciclo de dispositivo é opcional, o protocolo de gerenciamento de dispositivo usado pelo IoT Platform usa a mesma conexão MQTT que seu gateway já usa para eventos e controle de comando.
zh_tw: 裝置生命週期管理的支援是選用項目。IoT Platform 所使用的裝置管理通訊協定會利用您的閘道已對事件及指令控制項使用的同一個 MQTT 連線。

source: Quality of Service Levels and Clean Session
de: Servicequalitätsstufen und bereinigte Sitzung
pt_br: Qualidade de Níveis de Serviço e Sessão de Limpeza
zh_tw: 服務品質等級和清除階段作業

source: Managed gateways can publish messages with Quality of Service (QoS) level of 0 or 1. If QoS 1 is used, messages from the gateway will be queued if necessary. Messages from the gateway must not be retained messages.
de: Verwaltete Gateways können Nachrichten mit der Servicequalitätsstufe (QoS-Stufe) 0 oder 1 publizieren. Wenn QoS 1 verwendet wird, werden die Nachrichten von dem Gateway bei Bedarf in eine Warteschlange gestellt. Die Nachrichten von dem Gateway dürfen nicht aufbewahrte Nachrichten sein.
pt_br: Gateways gerenciados podem publicar mensagens com níveis de Qualidade de Serviço (QoS) 0 ou 1. Se QoS 1 for usado, as mensagens do gateway serão enfileiradas, se necessário. Mensagens do gateway não devem ser mensagens retidas.
zh_tw: 受管理閘道可以發佈「服務品質 (QoS)」等級 0 或 1 的訊息。如果使用 QoS 1，則來自閘道的訊息將會置入佇列（必要的話）。來自閘道的訊息不得是保留的訊息。

source: The IoT Platform publishes requests with a QoS level of 1 to support queuing of messages. In order to queue messages sent while a managed gateway is not connected, the device should use ``cleansession=false``.
de: IoT Platform publiziert Anforderungen mit der Servicequalitätsstufe 1 zur Unterstützung der Warteschlangensteuerung für Nachrichten. Damit Nachrichten, die gesendet wurden, während ein verwaltetes Gateway nicht verbunden war, in die Warteschlange gestellt werden, muss von dem Gerät ``cleansession=false`` verwendet werden.
pt_br: O IoT Platform publica solicitações com um nível de QoS 1 para suportar o enfileiramento de mensagens. Para enfileirar as mensagens enviadas enquanto um gateway gerenciado não está conectado, o dispositivo deve usar ``cleansession=false``.
zh_tw: IoT Platform 會發佈 QoS 等級為 1 的要求，以支援將訊息置入佇列。若要將受管理閘道未連接時傳送的訊息置入佇列，該裝置應該使用 ``cleansession=false``。

source: If your managed gateway uses a durable subscription (cleansession=false) you need to be aware that device management commands sent to your gateway while it is offline will be reported as failed operations, however, when the gateway later connects those requests will be actioned by the gateway.
de: Wenn Ihr verwaltetes Gateway eine permanente Subskription verwendet (cleansession=false), ist zu beachten, dass Gerätemanagementbefehle, die an Ihr Gateway gesendet werden, während es offline ist, als fehlgeschlagene Operationen gemeldet werden. Wenn das Gateway später wieder verbunden ist, werden diese Anforderungen jedoch verarbeitet.
pt_br: Se o seu gateway gerenciado usa uma assinatura durável (cleansession=false), você precisa estar ciente de que os comandos de gerenciamento de dispositivo enviados para seu gateway enquanto ele está off-line serão relatados como operações com falha, no entanto, quando o gateway se conectar posteriormente, essas solicitações serão acionadas pelo gateway.
zh_tw: 如果您的受管理閘道使用可延續訂閱 (cleansession=false)，您需要注意，在閘道離線時傳送至閘道的裝置管理指令將報告為失敗作業，不過，當閘道稍後連接時，閘道將處理那些要求。

source: When handling failures it is important to take this into account if you are using durable subscriptions for your managed gateways.
de: Bei der Fehlerbehandlung ist dies unbedingt zu berücksichtigen, wenn Sie permanente Subskriptionen für Ihre verwalteten Gateways verwenden.
pt_br: Ao manipular falhas, é importante levar isso em conta se você estiver usando assinaturas duráveis para seus gateways gerenciados.
zh_tw: 當處理失敗時，如果您要對受管理閘道使用可延續訂閱，請務必考量此情況。

source: Topics
de: Themen
pt_br: Tópicos
zh_tw: 主題

source: A managed gateway is required to subscribe to two topics to handle requests and responses from IoT Platform:
de: Ein verwaltetes Gateway muss die beiden folgenden Themen subskribieren, um Anforderungen und Antworten von IoT Platform abzuwickeln:
pt_br: Um gateway gerenciado é necessário para assinar dois tópicos para manipular solicitações e respostas a partir do IoT Platform:
zh_tw: 需要受管理閘道訂閱兩個主題，以處理來自 IoT Platform 的要求及回應：

source: The managed gateway will subscribe to device management reponses on ``iotdm-1/type/<typeId>/id/<deviceId>/response/+``
de: Das verwaltete Gateway subskribiert Gerätemanagementantworten in ``iotdm-1/type/<typeId>/id/<deviceId>/response/+``.
pt_br: O gateway gerenciado assinará respostas de gerenciamento de dispositivo em ``iotdm-1/type/<typeId>/id/<deviceId>/response/+``
zh_tw: 受管理閘道將訂閱 ``iotdm-1/type/<typeId>/id/<deviceId>/response/+`` 上的裝置管理回應

source: The managed gateway will subscribe to device management requests on ``iotdm-1/type/<typeId>/id/<deviceId>/+``
de: Das verwaltete Gateway subskribiert Gerätemanagementanforderungen in ``iotdm-1/type/<typeId>/id/<deviceId>/+``.
pt_br: O gateway gerenciado assinará solicitações de gerenciamento de dispositivo em ``iotdm-1/type/<typeId>/id/<deviceId>/+``
zh_tw: 受管理閘道將訂閱 ``iotdm-1/type/<typeId>/id/<deviceId>/+`` 上的裝置管理要求

source: A managed gateway will publish to two topics:
de: Ein verwaltetes Gateway publiziert in den beiden folgenden Themen:
pt_br: Um gateway gerenciado publicará em dois tópicos:
zh_tw: 受管理閘道將發佈至兩個主題：

source: The managed gateway will publish device management responses on ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``
de: Das verwaltete Gateway publiziert Gerätemanagementantworten in ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``.
pt_br: O gateway gerenciado publicará as respostas de gerenciamento de dispositivo em ``iotdevice-1/type/<typeId>/id/<deviceId>/response/``
zh_tw: 受管理閘道將對 ``iotdevice-1/type/<typeId>/id/<deviceId>/response/`` 發佈裝置管理回應

source: The managed gateway will publish device management requests on ``iotdevice-1/type/<typeId>/id/<deviceId>/``
de: Das verwaltete Gateway publiziert Gerätemanagementanforderungen in ``iotdevice-1/type/<typeId>/id/<deviceId>/``.
pt_br: O gateway gerenciado publicará solicitações de gerenciamento de dispositivo em ``iotdevice-1/type/<typeId>/id/<deviceId>/``
zh_tw: 受管理閘道將對 ``iotdevice-1/type/<typeId>/id/<deviceId>/`` 發佈裝置管理要求

source: The gateway is able to process device management protocol messages for both itself and on behalf other connected devices by using the relevant <typeId> and <deviceId>.
de: Das Gateway kann Gerätemanagement-Protokollnachrichten sowohl für sich selbst als auch im Namen anderer verbundener Geräte verarbeiten, indem die entsprechende Typ-ID (<typeId>) und Geräte-ID (<deviceId>) verwendet wird.
pt_br: O gateway é capaz de processar mensagens de protocolo de gerenciamento de dispositivo para si mesmo e em nome de outros dispositivos conectados usando o <typeId> e <deviceId> relevantes.
zh_tw: 閘道能夠使用相關的 <typeId> 和 <deviceId>，為本身以及代表其他連接的裝置處理裝置管理通訊協定訊息。

source: Message Format
de: Nachrichtenformat
pt_br: Formato da Mensagem
zh_tw: 訊息格式

source: All messages are sent in JSON format. There are two types of message.
de: Alle Nachrichten werden im JSON-Format gesendet. Es gibt zwei Arten von Nachrichten.
pt_br: Todas as mensagens são enviadas no formato JSON. Existem dois tipos de mensagens.
zh_tw: 所有訊息都會以 JSON 格式傳送。共有兩種類型的訊息。

source: Request
de: Anforderung
pt_br: Solicitação
zh_tw: 要求

source: Requests are formatted as follows:
de: Anforderungen werden wie folgt formatiert:
pt_br: As solicitações são formatadas da seguinte maneira:
zh_tw: 要求的格式如下：

source: ``d`` carries any data relevant to the request
de: ``d`` enthält alle relevanten Daten für die Anforderung.
pt_br: ``d`` transporta quaisquer dados relevantes para a solicitação
zh_tw: ``d`` 會傳送任何與要求相關的資料

source: ``reqId`` is an identifier of the request, and must be copied into a response. If a response is not required, the field should be omitted.
de: ``reqId`` ist eine Kennung für die Anforderung und muss in eine Antwort kopiert werden. Wenn keine Antwort erforderlich ist, muss das Feld weggelassen werden.
pt_br: ``reqId`` é um identificador da solicitação e deve ser copiado em uma resposta. Caso não seja necessário fornecer uma resposta, o campo deve ser omitido.
zh_tw: ``reqId`` 是要求的 ID，而且必須複製到回應。如果不需要回應，則應該省略該欄位。

source: Response
de: Antwort
pt_br: Resposta
zh_tw: 回應

source: Responses are formatted as follows:
de: Antworten werden wie folgt formatiert:
pt_br: As respostas são formatadas da seguinte maneira:
zh_tw: 回應的格式如下：

source: "rc" is a result code of the original request.
de: "rc" ist ein Ergebniscode der ursprünglichen Anforderung.
pt_br: "rc" é um código de resultado da solicitação original.
zh_tw: "rc" 是原始要求的結果碼。

source: ``message`` is an optional element with a text description of the response code.
de: ``message`` ist ein optionales Element mit einer Textbeschreibung des Antwortcodes.
pt_br: ``message`` é um elemento opcional com uma descrição de texto do código de resposta.
zh_tw: ``message`` 是選用元素，附有回應碼的文字說明。

source: ``d`` is an optional data element accompanying the response.
de: ``d`` ist ein zugehöriges optionales Datenelement für die Antwort.
pt_br: ``d`` é um elemento de dados opcional que acompanha a resposta.
zh_tw: ``d`` 是隨附回應的選用資料元素。

source: ``reqId`` is the request ID of the original request. This is used to correlate responses with requests, and the device needs to ensure that all request IDs are unique. When responding to IoT Platform requests, the correct ``reqId`` value must be sent in the response.
de: ``reqId`` ist die Anforderungs-ID der ursprünglichen Anforderung. Dieses Element wird zum Korrelieren der Antworten mit den Anforderungen verwendet. Von dem Gerät muss sichergestellt werden, dass alle Anforderungs-IDs eindeutig sind. Beim Antworten auf Anforderungen von IoT Platform muss der korrekte Wert für ``reqId`` in der Antwort gesendet werden.
pt_br: ``reqId`` é o ID da solicitação original. Isso é usado para correlacionar respostas com solicitações e o dispositivo precisa assegurar que todos os IDs de solicitação sejam exclusivos. Ao responder às solicitações do IoT Platform, o valor correto de ``reqId`` deve ser enviado na resposta.
zh_tw: ``reqId`` 是原始要求的要求 ID。這是用來建立回應與要求的關聯，且裝置需要確定所有要求 ID 都是唯一的。在回應 IoT Platform 要求時，必須在回應中傳送正確的 ``reqId`` 值。

source: Gateway 1
zh_tw: 閘道 1
