Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/register/index.po
Languages: it, ja

source: Register
it: Registra
ja: 登録

source: Registering for an account on the Watson IoT platform and connecting your first device is simple and will take less than 10 minutes to complete.
it: La registrazione di un account a Watson IoT platform e la connessione del primo dispositivo è semplice e occorreranno meno di 10 minuti per completarla.
ja: Watson IoT Platform のアカウントを登録して最初のデバイスに接続するまで 10 分もかかりません。簡単な作業です。

source: Create a Bluemix Account
it: Creare un account Bluemix
ja: Bluemix アカウントの作成

source: First you will need to `register for a Bluemix account <https://console.ng.bluemix.net/registration/>`_. Once you have verified your e-mail address you should find yourself looking at an empty dashboard:
it: Prima è necessario effettuare la registrazione di un account Bluemix <https://console.ng.bluemix.net/registration/>`_. Una volta verificato l'indirizzo email dovrebbe essere visualizzato un dashboard vuoto.
ja: はじめに `Bluemix アカウントへの登録 <https://console.ng.bluemix.net/registration/>`_ を行う必要があります。 E メール・アドレスが検証されると、空のダッシュボードが表示されます。

source: Choose your Region
it: Scegliere la regione
ja: 地域の選択

source: Now, before you go any further you need to consider data soveriegnty and make a decision as to which of the available regions you want to register your service instance with. Currently the Watson IoT platform is available in two regions:
it: Ora, prima di procedere è necessario considerare la sovranità dei dati e prendere una decisione come per esempio in quale tra le regioni disponibili si desidera registrare l'istanza del servizio. Attualmente Watson IoT platform è disponibile in due regioni:
ja: 先に進む前に、データ主権について検討し、サービス・インスタンスを登録する地域を決定する必要があります。 現在、Watson IoT Platform は以下の 2 つの地域で使用可能です。

source: United Kingom
it: Regno Unito
ja: 英国

source: United States
it: Stati Uniti
ja: 米国

source: Data sovereignty is the concept that information which has been converted and stored in binary digital form is subject to the laws of the country in which it is located.
it: La sovranità dei dati è il concetto secondo cui le informazioni convertite e archiviate in formato digitale binario sono soggette alle leggi del paese in cui sono presenti.
ja: データ主権とは、バイナリー・デジタル形式で変換および保管された情報は、その情報が存在する国の法律に従うという概念です。

source: The region your Watson IoT platform instance will be provisioned in will be determined by the Bluemix region you are using. You can switch Bluemix regions via the controls in the top right corner of the Bluemix dashboard. You can also determine which region are currently have selected by the URL in your browser:
it: La regione in cui verrà fornita l'istanza Watson IoT platform verrà determinata dalla regione Bluemix che si sta utilizzando. È possibile scambiare le regioni Bluemix mediante i controlli nell'angolo in alto a destra del dashboard Bluemix. È possibile determinare quali regioni sono state attualmente selezionate dall'URL nel browser.
ja: Watson IoT Platform インスタンスがプロビジョンされる地域は、使用している Bluemix 地域によって決まります。Bluemix 地域は、Bluemix ダッシュボードの右上隅のコントロールを使用して切り替えることができます。また、現在選択されている地域は、ブラウザーの URL で判別できます。

source: United Kingdom: console.\ **eu-gb**\ .bluemix.net
it: Regno Unito: console.\ **eu-gb**\ .bluemix.net
ja: 英国: console.\ **eu-gb**\ .bluemix.net

source: United States: console.\ **ng**\ .bluemix.net
it: Stati uniti: console.\ **ng**\ .bluemix.net
ja: 米国: console.\ **ng**\ .bluemix.net

source: Provision a Watson IoT platform Service Instance
it: Fornitura di un'istanza del servizio Watson IoT platform
ja: Watson IoT Platform サービス・インスタンスのプロビジョン

source: From anywhere in the Bluemix dashboard click **catalog** in the top navigation, this will take you to a list of all services available on Bluemix.
it: Da qualsiasi dashboard Bluemix fare clic su **catalogo** nel menu di navigazione in alto, questo condurrà ad un elenco di tutti i servizi disponibili in Bluemix.
ja: Bluemix ダッシュボードの任意の場所のトップ・ナビゲーションで **catalog** をクリックすると、Bluemix で使用できるすべてのサービスのリストが表示されます。

source: Type ``Internet of Things`` into the search box at the top of the page to filter out all the other services.
it: Immettere ``Internet of Things`` nella casella di ricerca in alto della pagina per filtrare tutti gli altri servizi.
ja: ページ上部の検索ボックスに「Internet of Things」と入力して、他のすべてのサービスを除外します。

source: Click ``View More`` on the **Watson IoT platform** service tile.
it: Fare clic su ``Visualizza altro`` nel riquadro del servizio **Watson IoT platform** .
ja: **Watson IoT platform** というサービス・タイル上の「詳細の表示」をクリックします。

source: Optionally give your service instance a name (or simply accept the generated name)
it: Facoltativamente assegnare un nome all'istanza del servizio (o semplicemente accettare il nome generato)
ja: オプションで、サービス・インスタンスに名前を付けます (生成された名前を受け入れてもかまいません)。

source: Click ``Create``
it: Fare clic su ``Crea``
ja: 「作成」をクリックします。

source: After a short delay you will find yourself the proud owner of an organization on the IBM Watson IoT platform.
it: Dopo un po' di tempo ci si ritroverà proprietario di un'organizzazione in IBM Watson IoT platform.
ja: しばらくすると、IBM Watson IoT Platform の組織の所有者になったことが分かります。

source: Additional Setup and Experimentation
it: Configurazione e sperimentazione aggiuntiva
ja: その他のセットアップと実験

source: Click the ``Launch Dashboard`` button when viewing your new service instance within Bluemix, this will take you to your Watson IoT platform Dashboard.
it: Fare clic sul pulsante ``Avvia dashboard`` quando si visualizza la nuova istanza del servizio all'interno di Bluemix, ciò condurrà al dashboard Watson IoT platform.
ja: Bluemix で新しいサービス・インスタンスを表示しているときに「ダッシュボードを起動」ボタンをクリックすると、Watson IoT Platform ダッシュボードに移動します。

source: Configure Access
it: Configurare l'accesso
ja: アクセスの構成

source: You are currently accessing the dashboard through a 24 hour access token generated by Bluemix when you clicked ``Launch Dashboard``, when this expires you will need to return to Bluemix and relaunch the dashboard. I think we can all agree it's preferable not to have to do this, so let's promote you to a permanent member of the organization.
it: Attualmente si sta accedendo al dashboard attraverso un token di accesso di 24 ore generato da Bluemix quando si è selezionato ``Avvia dashboard``, quando questo scade sarà necessario ritornare in Bluemix e riavviare il dashboard. Tutti concordiamo che è preferibile non doverlo fare, quindi consentiteci di rendervi un membro permanente dell'organizzazione.
ja: 現在、「ダッシュボードを起動」をクリックしたときに Bluemix によって生成された 24 時間のアクセス・トークンを使用してダッシュボードにアクセスしています。この期限が切れた場合は、Bluemix に戻り、ダッシュボードを再起動する必要があります。この手間を省くために、組織の永久メンバーになることをお勧めします。

source: In the navigation menu select ``Access`` and then ``Guests``, you should see the e-mail address you signed up to Bluemix with in there and the expiration date for your session. Click the ``Promote`` button to set yourself up as a permanent member of the organization, your ID will disappear from the list, and can now be found under ``Access > Members``.
it: Nel menu di navigazione, selezionare ``Accesso`` e quindi ``Ospiti``, dovrebbe essere visualizzato l'indirizzo email con cui ci si è registrati a Bluemix e la data di scadenza della sessione. Fare clic sul pulsante ``Promuovi`` per configurare se stessi come un membro permanente dell'organizzazione, il proprio ID scomparirà dall'elenco e ora è possibile trovarlo , in ``Accesso > Membri``.
ja: ナビゲーション・メニューで、「アクセス」、「ゲスト」の順に選択します。Bluemix に登録した E メール・アドレスと、セッションの期限日付が表示されます。 「プロモート」ボタンをクリックして組織の永久メンバーとしてセットアップします。ID がリストに表示されなくなり、「アクセス > メンバー」の下に表示されるようになります。

source: Connect an Application
it: Connettere un'applicazione
ja: アプリケーションの接続

source: Applications require an ``API key`` to connect to the service. Let's set one up. Navigate to ``Access > API Keys`` and click ``Generate API Key``. Take a note of your ``API Key`` and ``Authentication Token`` - you will need them shortly.
it: Le applicazioni richiedono una ``Chiave API ` per connettersi al servizio. Impostarne una. Passare a ``Accesso > Chiavi API `` e fare clic su ``Genera chiave API``. Annota la ``Chiave API ` e il ``Token di autenticazione`` - a breve serviranno.
ja: アプリケーションがサービスに接続するには、「API キー」が必要です。セットアップしましょう。 「アクセス > API キー」にナビゲートし、「API キーの生成」をクリックします。後で使用するために「API キー」と「認証トークン」をメモしておきます。

source: Now we have an API key we want to run an application, the simpler the better.
it: Ora che disponiamo di una chiave API desideriamo eseguire un'applicazione, meglio se è la più semplice possibile.
ja: API キーを取得したので、できるだけ単純なアプリケーションを実行してみましょう。

source: The Watson IoT platform has client library support for multiple languages, but for the purpose of this getting started tutorial we're going to stick with Python. If you don't already have `Python <https://www.python.org/downloads/>`_ installed now is the time to do so.
it: Watson IoT platform dispone del supporto della libreria client per più linguaggi, ma per lo scopo di questa esercitazione introduttiva stiamo seguendo rigorosamente Python. Se non si dispone già di Python <https://www.python.org/downloads/>`_ installato, ora è il momento di farlo.
ja: Watson IoT Platform では、複数の言語のクライアント・ライブラリーがサポートされていますが、この入門チュートリアルでは Python を使用します。まだ `Python <https://www.python.org/downloads/>`_ がインストールされていない場合は、インストールしてください。

source: Install the latest version of the Watson IoT platform python client library using pip
it: Installare l'ultima versione della libreria client Python Watson IoT platform utilizzando il comando pip
ja: pip を使用して最新バージョンの Watson IoT Platform Python クライアント・ライブラリーをインストールします。

source: Now, create a really simple application that will connect using the API key you just created:
it: Ora, creare un'applicazione realmente semplice che si connetterà utilizzando la chiave API appena creata:
ja: 次に、先ほど作成した API キー を使用して接続する非常に単純なアプリケーションを作成します。

source: When you launch the application you will see nothing overly exciting
it: Quando si avvia l'applicazione non si vedrà nulla di eccessivamente entusiasmante
ja: アプリケーションを起動しても特に面白いものは表示されません。

source: Connect a Device
it: Connettere un dispositivo
ja: デバイスの接続

source: Before we can register a device we have to define a device type. A ``device type`` is intended to represent a group of devices that are identical, it can be useful to think of the ``device type`` as analogous to a model in the traditional model:serial identification scheme. Leave you application running to return to your Watson IoT platform Dashboard and navigate to ``Devices > Device Types``, click ``Create Type`` and enter ``python-sample`` as the name, all other fields are optional, so we're just going to skip past the rest of the options for the device type for now.
it: Prima di poter registrare un dispositivo è necessario definire un tipo di dispositivo. Un ``tipo di dispositivo`` è destinato a rappresentare un gruppo di dispositivi identici, può essere utile pensare al ``tipo di dispositivo`` come simile ad un modello nello schema di identificazione modello:seriale tradizionale. Lasciare l'applicazione in esecuzione per ritornare al dashboard Watson IoT platform e passare a ``Dispositivi > Tipi di dispositivi``, fare clic su ``Crea tipo`` e immettere ``python-sample`` come nome, tutti gli altri campi sono facoltativi, pertanto per il momento ignoriamo il resto delle opzioni per il tipo di dispositivo.
ja: デバイスを登録する前に、デバイス・タイプを定義する必要があります。「デバイス・タイプ」とは、同じデバイスのグループを表します。従来の識別方式「モデル:シリアル」のモデルのようなものと考えることができます。アプリケーションを実行したまま、Watson IoT Platform ダッシュボードに戻って「デバイス > デバイス・タイプ」にナビゲートして「タイプの作成」をクリックし、「python-sample」という名前を入力します。他のフィールドはすべてオプションですので、ここでは、デバイス・タイプの他のオプションはスキップすることにします。

source: Now it's time to register a device of this type, navigate to ``Devices > Browse`` and click ``Add Device``, select the ``python-sample`` device type that we just created and click ``Next``. On the second panel enter a device ID of "MyFirstDevice" and click ``Next`` to continue through the guided creation process until you reach the ``Add`` button.
it: Ora è il momento di registrare un dispositivo di questo tipo, passare a ``Dispositivi > Sfoglia`` e fare clic su ``Aggiungi dispositivo``, selezionare il tipo di dispositivo ``python-sample`` appena creato e fare clic su ``Avanti``. Sul secondo pannello immettere un ID dispositivo di "MyFirstDevice" e fare clic su ``Avanti`` per continuare il processo di creazione guidata fino a quando non si arriva al pulsante ``Aggiungi``.
ja: 次は、このタイプのデバイスを登録します。「デバイス > 参照」にナビゲートして「デバイスの追加」をクリックし、先ほど作成したデバイス・タイプ「python-sample」を選択して「次へ」をクリックします。2 つ目のパネルでデバイス ID「MyFirstDevice」を入力して「次へ」をクリックします。そして、「追加」ボタンが表示されるまで案内に従って作成手順を進めます。

source: Once you click ``Add`` your device is registered and you will be presented with a generated ``authentication token`` for that device.
it: Una volta selezionato ``Aggiungi`` il dispositivo è creato e vi verrà presentato un ``token di autenticazione`` generato per tale dispositivo.
ja: 「追加」をクリックすると、デバイスが登録され、そのデバイス用に生成された「認証トークン」が表示されます。

source: We're now going to take that authentication token and write a totally minimal device client in python.
it: Ora siamo in procinto di acquisire il token di autenticazione e scrivere un client dispositivo totalmente minimale in python.
ja: 次は、この認証トークンを使用して、非常に簡単なデバイス・クライアントを Python で作成します。

source: When executed the device code will generate 10 events .. code::
it: Una volta eseguito il codice del dispositivo genererà 10 eventi .. codice::
ja: デバイス・コードを実行すると、次のように 10 件のイベントが生成されます。

source: Returning to the terminal where your application is running you will be able to see the application is recieving and processing the events submitted by your device in real time.
it: Ritornando al terminale in cui è in esecuzione l'applicazione saremo ancora in grado di visualizzare in tempo reale l'applicazione che sta ricevendo ed elaborando gli eventi inoltrati dal dispositivo.
ja: アプリケーションを実行している端末に戻ると、デバイスから送信されたイベントをアプリケーションがリアルタイムで受信して処理していることが分かります。

source: Finally, if you return to the Watson IoT platform dashboard and scroll down to ``Device Events`` you will be able to see all the events that you just sent.
it: Alla fine, se si ritorna al dashboard Watson IoT platform e si scorre l'elenco ``Eventi dispositivi`` saremo in grado di visualizzare tutti gli eventi appena inviati.
ja: 最後に、Watson IoT Platform ダッシュボードに戻って「デバイス・イベント」までスクロールダウンすると、送信したすべてのイベントが表示されます。

source: You can also examine the content of any of the events by selecting an event from the table.
it: È possibile esaminare il contenuto degli eventi selezionando un evento dalla tabella.
ja: また、この表でイベントを選択して、そのイベントのコンテンツを確認することもできます。
