Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/api.po
Languages: de

source: HTTP API for Applications
de: HTTP-API für Anwendungen

source: The IoT Platform API can be used to interact with your organization in the IoT Platform.
de: Die API von IoT Platform kann zur Interaktion mit Ihrer Organisation in IoT Platform verwendet werden.

source: API Capabilities
de: API-Leistungsmerkmale

source: The IoT Platform API supports the following functionality for applications:
de: Die API von IoT Platform unterstützt die folgende Funktionalität für Anwendungen:

source: View organization details.
de: Anzeigen von Organisationsdetails.

source: Bulk device operations (list all, add, remove).
de: Massengeräteoperationen (alle auflisten, hinzufügen, entfernen).

source: Device type operations (list all, create, delete, view details, update).
de: Operationen mit Gerätetypen (alle auflisten, erstellen, löschen, Details anzeigen, aktualisieren).

source: Device operations (list devices, add, remove, view details, update, view location, view management information).
de: Operationen mit Geräte (Geräte auflisten, hinzufügen, entfernen, Details anzeigen, aktualisieren, Position anzeigen, Managementinformationen anzeigen).

source: Device diagnostic operations (clear log, retrieve logs, add log information, delete logs, get specific log, clear error codes, get device error codes, add an error code).
de: Operationen zur Gerätediagnose (Protokoll löschen, Protokolle abrufen, Protokollinformationen hinzufügen, Protokolle löschen, Spezialprotokolle abrufen, Fehlercodes löschen, Gerätefehlercodes abrufen, Fehlercode hinzufügen).

source: Connection problem determination (list device connection log events).
de: Ermittlung von Verbindungsproblemen (Protokollereignisse für Geräteverbindung auflisten).

source: Historical event retrieval (view events from all devices, view events from a device type, view events for a specific device).
de: Abrufen historischer Ereignisse (Ereignisse aller Geräte anzeigen, Ereignisse aller Gerätetypen anzeigen, Ereignisse für ein bestimmtes Gerät anzeigen).

source: Device management request operations (list device management requests, initiate a request, clear request status, get details of a request, get list of request statuses for each affected device, get request status for a specific device).
de: Anforderungsoperationen für Gerätemanagement (Gerätemanagementanforderungen auflisten, Anforderung initiieren, Anforderungsstatus löschen, Anforderungsdetails abrufen, Liste der Anforderungsstatusarten für jedes betroffene Gerät abrufen, Geräteanforderungsstatus für ein bestimmtes Gerät abrufen).

source: Usage management (retrieve number of active devices over a period of time, retrieve amount of storage used by historical event data, retrieve total amount of data used).
de: Nutzungsverwaltung (Anzahl der aktiven Geräte in einem Zeitraum abrufen, von historischen Ereignisdaten belegten Speicherplatz abrufen, gesamten belegten Speicherplatz abrufen).

source: Publish events on behalf of devices (beta)
de: Ereignisse im Namen von Geräten publizieren (Betaversion).

source: Service status queries (retrieve service statuses for an organization).
de: Servicestatusabfragen (Servicestatusangaben für Organisation abrufen).

source: The current version of the IoT Platform API is `version 2 <../swagger/v0002.html>`_. We strongly recommend that all users build their solutions based on the version 2 APIs.
de: Die aktuelle Version von IoT Platform API ist `Version 2 <../swagger/v0002.html>`_. Es wird dringend empfohlen, dass alle Benutzer die APIs der Version 2 als Basis verwenden, um Ihre Lösungen zu erstellen.

source: `Version 1 <../swagger/v0001.html>`_ of the API is still supported, however it should now be considered a deprecated API, many features listed above are not available in the version 1 API.
de: Die `Version 1 <../swagger/v0001.html>`_ der API wird zwar weiterhin unterstützt, sollte jedoch nicht mehr verwendet werden, da viele der oben aufgeführten Funktionen in Version 1 der API nicht verfügbar sind.

source: Many of the API paths relating to devices have changed.
de: Viele API-Pfade, die Geräte betreffen, haben sich geändert.

source: Version 1 of the API does not support any device type operations, other than listing all device types.
de: Von Version 1 der API werden bis auf die Auflistung aller Gerätetypen keine Operationen für den Gerätetyp unterstützt.

source: Operations related to device management, device management requests, diagnostic information, or location cannot be performed using version 1 of the API.
de: Operationen, die das Gerätemanagement, Gerätemanagementanforderungen, Diagnoseinformationen oder die Position betreffen, können mit Version 1 der API nicht ausgeführt werden.
