Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/mqtt.po
Languages: de, it, zh_cn

source: The IoT Platform service extends the MQTT 3.1.1 specification to provide support for shared subscriptions. Shared subscription can provide simple load balancing functionality for applications. A shared subscription might be needed if a back-end enterprise application can not keep up with the number of messages being published to a specific topic space. For example if many devices were publishing messages that are being processed by a single application. It might be helpful to leverage the load balancing capability of a shared subscription. IoT Platform shared subscription support is limited to non-durable subscriptions only.
de: Der IoT Platform-Service erweitert die Spezifikation MQTT 3.1.1, um Unterstützung für gemeinsam genutzte Subskriptionen bereitzustellen. Von einer gemeinsam genutzten Subskription können einfache Lastausgleichsfunktionen für Anwendungen bereitgestellt werden. Eine gemeinsam genutzte Subskription kann erforderlich sein, wenn die Anzahl der Nachrichten, die für einen bestimmten Topic-Bereich publiziert werden, von der Back-End-Unternehmensanwendung nicht mehr bewältigen werden kann. Beispiel: Viele Geräte publizieren Nachrichten, die von einer einzigen Anwendung verarbeitet werden. Es kann sinnvoll sein, die Lastausgleichsfunktion einer gemeinsam genutzten Subskription zu nutzen. Die Unterstützung für gemeinsam genutzte Subskriptionen in IoT Platform ist ausschließlich auf nicht permanente Subskriptionen beschränkt.
it: Il servizio IoT Platform estende la specifica MQTT 3.1.1 per fornire supporto per le sottoscrizioni condivise. La sottoscrizione condivisa può fornire una funzionalità di bilanciamento del carico semplice per le applicazioni. Una sottoscrizione condivisa può essere necessaria se un'applicazione enterprise di back-end non è in grado di stare al passo con il numero di messaggi pubblicati su uno spazio argomento specifico. Ad esempio, se molti dispositivi stanno pubblicando messaggi che vengono elaborati da una singola applicazione. Potrebbe essere utile avvalersi della funzione di bilanciamento del carico di una sottoscrizione condivisa. Il supporto per la sottoscrizione condivisa IoT Platform è limitato solo a sottoscrizioni non durature.
zh_cn: IoT Platform 服务扩展了 MQTT 3.1.1 规范，以支持共享预订。共享预订可以为应用程序提供简单的负载均衡功能。如果后端企业应用程序处理不了发布到特定主题空间的消息数量，那么可能需要共享预订。例如，当有许多设备发布了消息，而只有一个应用程序来处理这些消息时。此时，使用共享预订的负载均衡功能可能会有帮助。IoT Platform 共享预订支持仅限于非持久预订。

source: A simple example of an auto-scaling application:
de: Einfaches Beispiel einer automatisch skalierten Anwendung:
it: Un semplice esempio di un'applicazione con scala automatica:
zh_cn: 下面是一个简单的自动扩展应用程序示例：

source: client 1 connects as A:abc123:myApplication and subscribes to all device events client 1 will receive 100% of the device events published
de: Client 1 stellt als A:abc123:myApplication eine Verbindung her und subskribiert alle Geräteereignisse; Client 1 empfängt 100 % der publizierten Geräteereignisse.
it: il client 1 si connette come A:abc123:myApplication ed effettau la sottoscrizione a tutti gli eventi dispositivo che il client 1 riceverà, il 100% degli eventi dispositivo pubblicati
zh_cn: 客户机 1 连接为 A:abc123:myApplication 并预订所有设备事件，客户机 1 将收到所有已发布的设备事件

source: client 2 connects as A:abc123:myApplication and subscribes to all device events now, client 1 and client 2 will share all of the events published between them. that is the load is now shared between client 1 and client 2.
de: Client 2 stellt als A:abc123:myApplication eine Verbindung her und subskribiert jetzt alle Geräteereignisse; Client 1 und Client 2 nutzen alle zwischen ihnen publizierten Ereignisse gemeinsam. Somit verteilt sich die Last jetzt auf Client 1 und Client 2.
it: il client 2 si connette come A:abc123:myApplication ed effettau la sottoscrizione a tutti gli eventi dispositivo ora, il client 1 e il client 2 condivideranno tutti gli eventi pubblicati tra di loro. Il carico è ora condiviso tra il client 1 e il client 2.
zh_cn: 现在，客户机 2 连接为 A:abc123:myApplication 并预订所有设备事件，客户机 1 和客户机 2 将共享它们之间发布的所有事件。即，在客户机 1 和客户机 2 之间共享负载。

source: client 3 connects as A:abc123:myApplication and subscribes to all device events now, instance 1, 2 and 3 will process the events shared amongst all three instances
de: Client 3 stellt als A:abc123:myApplication eine Verbindung her und subskribiert jetzt alle Geräteereignisse; Instanz 1, 2 und 3 verarbeiten die Ereignisse, die von allen drei Instanzen gemeinsam genutzt werden.
it: il client 3 si connette come A:abc123:myApplication ed effettau la sottoscrizione a tutti gli eventi dispositivo ora, le istanze 1, 2 e 3 elaboreranno gli eventi condivisi tra tutte e tre le istanze
zh_cn: 现在，客户机 3 连接为 A:abc123:myApplication 并预订所有设备事件，实例 1、2 和 3 将处理它们之间共享的事件。

source: clients 2 and 3 unsubscribe from all device events now, although instance 2 and 3 are still connected to the service, instance 1 will be receiving all device events published
de: Die Clients 2 und 3 beenden jetzt die Subskription aller Geräteereignisse, obwohl Instanz 2 und 3 noch mit dem Service verbunden sind; Instanz 1 empfängt daraufhin alle publizierten Geräteereignisse.
it: i client 2 e 3 annullano la sottoscrizione a tutti gli eventi del dispositivo ora, sebbene le istanze 2 e 3 sono ancora connesse al servizio, l'istanza 1 riceverà tutti gli eventi dispositivo pubblicati
zh_cn: 现在，客户机 2 和 3 取消预订所有设备事件，尽管实例 2 和 3 仍连接到此服务，但只有实例 1 将会收到所有已发布的设备事件
