Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/applications/mqtt.po
Languages: de, it, zh_cn

source: MQTT Connectivity for Applications
de: MQTT-Konnektivität für Anwendungen
it: Connettività MQTT per le applicazioni
zh_cn: 应用程序的 MQTT 连接

source: Client connection
de: Clientverbindung
it: Connessione client
zh_cn: 客户机连接

source: Every registered organization has a unique endpoint which must be used when connecting MQTT clients for applications in that organization.
de: Jede registrierte Organisation hat einen eindeutigen Endpunkt, der beim Verbinden von MQTT-Clients für Anwendungen in dieser Organisation verwendet werden muss.
it: Ogni organizzazione registrata dispone di un endpoint univoco che deve essere utilizzato durante la connessione dei client MQTT per le applicazioni in tale organizzazione.
zh_cn: 每个已注册组织具有唯一端点，在连接该组织中应用程序的 MQTT 客户机时必须使用此端点。

source: Unencrypted client connection
de: Nicht verschlüsselte Clientverbindung
it: Connessione client non codificata
zh_cn: 未加密客户机连接

source: Connect on port **1883**
de: Verbindung auf Port **1883** herstellen
it: Connessione alla porta **1883**
zh_cn: 在端口 **1883** 上连接

source: All information your application submits is being sent in plain text (including the API key and authentication token). We recommend the use of an encrypted connection whenever possible.
de: Alle Informationen, die Ihre Anwendung übergibt, werden in einfachem Text gesendet (einschließlich API-Schlüssel und Authentifizierungstoken). Wir empfehlen die Verwendung einer verschlüsselten Verbindung, wann immer möglich.
it: Tutte le informazioni inoltrate dall'applicazione vengono inviate in testo semplice (incluso la chiave API e il token di autenticazione). Si consiglia di utilizzare una connessione codificata ogni qualvolta sia possibile.
zh_cn: 应用程序提交的所有信息将以明文形式（包括 API 密钥和认证令牌）发送。我们建议尽可能使用加密连接。

source: Encrypted client connection
de: Verschlüsselte Clientverbindung
it: Connessione client codificata
zh_cn: 加密客户机连接

source: Connect on port **8883** or **443** for websockets.
de: Verbindung auf **8883** oder **443** für Websockets herstellen
it: Connessione alla porta **8883** o **443** per websocket.
zh_cn: 针对 Web 套接字，在端口 **8883** 或 **443** 上连接。

source: In many client libraries you will need to provide the server's public certificate in pem format. The following file contains the entire certificate chain for \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
de: In vielen Clientbibliotheken müssen Sie das öffentliche Zertifikat des Servers im Pem-Format angeben. Die folgende Datei enthält die gesamte Zertifikatskette für \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
it: In molte librerie client sarà necessario fornire il certificato pubblico del server nel formato pem. Il seguente file contiene l'intera catena certificato per \*.messaging.internetofthings.ibmcloud.com: messaging.pem_
zh_cn: 在许多客户机库中，您将需要以 pem 格式提供服务器的公用证书。以下文件包含 \*.messaging.internetofthings.ibmcloud.com: messaging.pem_ 的整个证书链

source: Some SSL client libraries have been shown to not handle wildcarded domains, in which case, if you can not change libraries, you will need to turn off certificate checking.
de: Einige SSL-Clientbibliotheken können keine Platzhalterdomänen handhaben; wenn Sie keine Bibliotheken wechseln können, müssen in diesem Fall die Zertifikatsprüfung inaktivieren.
it: È stato notato che alcune librerie client SSL non gestiscono domini con caratteri jolly, nel qual caso, se non è possibile modificare librerie, sarà necessario disattivare il controllo del certificato.
zh_cn: 经证实，一些 SSL 客户机库不会处理带通配符的域，在此情况下，如果无法更改库，那么您将需要关闭证书检查。

source: The IoT Platform requires TLS v1.2. We suggest the following cipher suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 or AES128-GCM-SHA256 *(as of Jun 1 2015)*.
de: Für IoT Platform ist TLS v1.2 erforderlich. Wir empfehlen die folgenden Cipher-Suites: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 oder AES128-GCM-SHA256 *(ab 1. Juni 2015)*.
it: IoT Platform richiede TLS v1.2. Si consigliano le seguenti suite di cifratura: ECDHE-RSA-AES256-GCM-SHA384, AES256-GCM-SHA384, ECDHE-RSA-AES128-GCM-SHA256 o AES128-GCM-SHA256 *(dal 1° giugno 2015)*.
zh_cn: IoT Platform 需要 TLS v1.2。我们建议使用以下密码套件：ECDHE-RSA-AES256-GCM-SHA384、AES256-GCM-SHA384、ECDHE-RSA-AES128-GCM-SHA256 或 AES128-GCM-SHA256 *（自 2015 年 6 月 1 日起）*。

source: MQTT client identifier
de: MQTT-Client-ID
it: Identificativo client MQTT
zh_cn: MQTT 客户机标识

source: An application must authenticate using a client ID in the following format:
de: Eine Anwendung Muss die Authentifizierung mit einer Client-ID im folgenden Format durchführen:
it: Un'applicazione si deve autenticare utilizzando un ID client nel seguente formato:
zh_cn: 应用程序必须使用以下格式的客户机标识进行认证：

source: **a** indicates the client is an application
de: **a** gibt an, dass der Client eine Anwendung ist
it: **a** indica che il client è un'applicazione
zh_cn: **a** 指示客户机为应用程序

source: **org\_id** is your unique 6 character organization ID, assigned when you sign up with the service
de: **org\_id** ist Ihre eindeutige sechsstellige Organisations-ID, die beim Registrieren im Service zugeordnet wird.
it: **org\_id** è l'ID organizzazione univoco composto da 6 caratteri, assegnato quando si effettua la registrazione al servizio
zh_cn: **org\_id** 是在您注册服务时分配的包含 6 个字符的唯一组织标识

source: **app\_id** is a user-defined unique string identifier for this client and must comprise only alpha-numeric characters (a-z, A-Z, 0-9) and the following special characters: dash (-), underscore (\_), dot (.)
de: **app\_id** ist eine benutzerdefinierte eindeutige Zeichenfolge-ID für diesen Client. Sie darf nur alphanumerische Zeichen (a - z, A - Z, 0 - 9) und die folgenden Sonderzeichen enthalten: Gedankenstrich (-), Unterstreichungszeichen (\_), Punkt (.).
it: **app\_id** è un identificativo stringa univoco definito dall'utente per questo client e deve contenere solo caratteri alfanumerici (a-z, A-Z, 0-9) ed i seguenti caratteri speciali: trattino (-), carattere di sottolineatura (\_), punto (.)
zh_cn: **app\_id** 是用户为此客户机定义的唯一字符串标识，必须只能包含字母数字字符（a-z、A-Z 和 0-9）以及以下特殊字符：短划线 (-)、下划线 (\_) 和点 (.)

source: **app\_id** has a maximum length of 36 characters
de: Die maximale Länge für **app\_id** beträgt 36 Zeichen.
it: **app\_id** ha una lunghezza massima di 36 caratteri
zh_cn: **app\_id** 最多包含 36 个字符

source: When connecting to the Quickstart service no authentication is required
de: Beim Verbinden mit dem Quickstart-Service ist keine Authentifizierung erforderlich
it: Quando ci si connette al servizio Quickstart non è richiesta l'autenticazione
zh_cn: 连接到 Quickstart 服务时，不需要任何认证

source: An application does not need to be registered before it can connect
de: Eine Anwendung muss nicht registriert werden, bevor sie eine Verbindung herstellen kann
it: Un'applicazione deve essere registrata prima che sia possibile connetterla
zh_cn: 应用程序不需要进行注册，即可连接

source: Only one MQTT client can connect using any given client ID. As soon as a second client in your organization connects using an **app\_id** that you have already connected the first client will be disconnected.
de: Nur ein MQTT-Client kann die Verbindung unter Verwendung einer angegebenen Client-ID herstellen. Sobald ein zweiter Client in Ihrer Organisation die Verbindung unter Verwendung einer an **app\_id**, die Sie bereits verbunden haben, herstellt, wird die Verbindung beim ersten Client getrennt.
it: Solo un client MQTT può connettersi utilizzando un ID client specificato. Non appena un secondo client nell'organizzazione si connette utilizzando un **app\_id** già connesso, il primo client sarà disconnesso.
zh_cn: 仅一个 MQTT 客户机可使用任何给定客户机标识进行连接。贵组织中另一个客户机使用已连接的 **app\_id** 进行连接后，第一个客户机将立即断开连接。

source: MQTT authentication
de: MQTT-Authentifizierung
it: Autenticazione MQTT
zh_cn: MQTT 认证

source: Applications require an API Key to connect into an organization. When an API Key is registered a token will be generated that must be used with that API key.
de: Anwendungen erfordern einen API-Schlüssel zum Herstellen der Verbindung zu einer Organisation. Wenn ein API-Schlüssel registriert wird, wird ein Token generiert, das diesem API-Schlüssel verwendet werden muss .
it: Le applicazioni richiedono una chiave API per la connessione in un'organizzazione. Quando una chiave API viene registrata, verrà generato un token che deve essere utilizzato con tale chiave API.
zh_cn: 应用程序需要 API 密钥才能连接到组织。注册 API 密钥时，将生成必须与该 API 密钥配合使用的令牌。

source: The API key will look something like this: a-**org\_id**-a84ps90Ajs
de: Der API-Schlüssel sieht in etwa wie folgt aus: a-**org\_id**-a84ps90Ajs
it: La chiave API sarà simile a: a-**org\_id**-a84ps90Ajs
zh_cn: API 密钥将类似于以下内容：a-**org\_id**-a84ps90Ajs

source: The token will look something like this: MP$08VKz!8rXwnR-Q*
de: Das Token sieht in etwa wie folgt aus: MP$08VKz!8rXwnR-Q*
it: Il token sarà simile a: MP$08VKz!8rXwnR-Q*
zh_cn: 令牌将类似于以下内容：MP$08VKz!8rXwnR-Q*

source: When making an MQTT connection using an API key the following applies:
de: Beim Einrichten einer MQTT-Verbindung mit einem API-Schlüssel gilt Folgendes:
it: Quando si effettua una connessione MQTT utilizzando una chiave API si applicano quanto segue:
zh_cn: 使用 API 密钥建立 MQTT 连接时，以下内容适用：

source: MQTT client ID: a:**org\id**:**app\_id**
it: ID client MQTT: a:**org\id**:**app\_id**
zh_cn: MQTT 客户机标识：a:**org\id**:**app\_id**

source: MQTT username must be the API key: a-**org\_id**-a84ps90Ajs
de: Der MQTT-Benutzername muss der API-Schlüssel sein: a-**org\_id**-a84ps90Ajs
it: Il nome utente MQTT deve essere la chiave API: a-**org\_id**-a84ps90Ajs
zh_cn: MQTT 用户名必须为 API 密钥：a-**org\_id**-a84ps90Ajs

source: MQTT password must be the authentication token: MP$08VKz!8rXwnR-Q*
de: Das MQTT-Kennwort muss das Authentifizierungstoken sein: MP$08VKz!8rXwnR-Q*
it: La password MQTT deve essere il token di autenticazione: MP$08VKz!8rXwnR-Q*
zh_cn: MQTT 密码必须为认证令牌：MP$08VKz!8rXwnR-Q*

source: Publishing device events
de: Geräteereignisse publizieren
it: Pubblicazione degli eventi del dispositivo
zh_cn: 发布设备事件

source: An application can publish events as if they came from any registered device.
de: Eine Anwendung kann Ereignisse so publizieren, als ob sie von einem beliebigen, registrierten Gerät stammen
it: Un'applicazione può pubblicare eventi come se venissero da un dispositivo registrato.
zh_cn: 应用程序在发布事件时可将事件视为如同来自任何已注册设备一样。

source: Publish to topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
de: Publizieren in Topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
it: Pubblicare su argomento iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
zh_cn: 发布到主题 iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**

source: You may have a number of devices that are already generating bespoke data that you wish to send to the IoT Platform. One way to get that data into the service would be to write an application that processes the data and publishes it to the IoT Platform.
de: Möglicherweise verfügen Sie über eine Reihe von Geräten, die bereits entsprechende Daten generieren, die Sie an IoT Platform senden möchten. Eine Möglichkeit, die Daten in den Service zu übertragen, ist das Schreiben einer Anwendung, die die Daten verarbeitet und in IoT Platform publiziert.
it: È possibile avere un numero di dispositivi che stanno già generando dati su misura che si desidera inviare a IoT Platform. Un modo che consente l'acquisizione dei dati nel servizio sarebbe scrivere un'applicazione che elabora i dati e li pubblica su IoT Platform.
zh_cn: 您可能有多个设备已在生成您希望发送到 IoT Platform 的定制数据。向此服务提供该数据的一种方式是编写应用程序来处理数据并将其发布到 IoT Platform。

source: The message payload is limited to a maximum of 131072 bytes. Messages larger than this will be rejected.
de: Die Nachrichtennutzdaten sind auf maximal 131072 Byte begrenzt. Größere Nachrichten werden abgelehnt.
it: Il payload dei messaggi è limitato ad un massimo di 131072 byte. I messaggi di dimensioni superiori a questo verranno respinti.
zh_cn: 消息有效内容限制为最长 131072 个字节。将拒绝大于此大小的消息。

source: Publishing device commands
de: Gerätebefehle publizieren
it: Pubblicazione dei comandi del dispositivo
zh_cn: 发布设备命令

source: An application can publish a command to any registered device.
de: Eine Anwendung kann einen Befehl publizieren an jedes registrierte Gerät publizieren.
it: Un'applicazione può pubblicare un comando su qualsiasi dispositivo registrato.
zh_cn: 应用程序可将命令发布到任何已注册设备。

source: Publish to topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
de: Publizieren in Topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
it: Pubblicare su argomento iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
zh_cn: 发布到主题 iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**

source: Subscribing to device events
de: Geräteereignisse subskribieren
it: Sottoscrizione a eventi del dispositivo
zh_cn: 预订设备事件

source: An application can subscribe to events from one or more devices.
de: Eine Anwendung kann Ereignisse von einer oder mehrerer Geräte subskribieren.
it: Un'applicazione può eseguire la sottoscrizione agli eventi da uno o più dispositivi.
zh_cn: 应用程序可预订来自一个或多个设备的事件。

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
de: Subskribieren von Topic iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
it: Sottoscrivere a argomento iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**
zh_cn: 预订主题 iot-2/type/**device\_type**/id/**device\_id**/evt/**event\_id**/fmt/**format\_string**

source: The MQTT "any" wildcard character (+) may be used for any of the following components if you want to subscribe to more than one type of event, or events from more than a single device.
de: Das MQTT-Platzhalterzeichen "any" (+) kann für alle der folgenden Komponenten verwendet werden, wenn Sie mehr als einen Ereignistyp oder Ereignisse aus mehr als einem Gerät subskribieren wollen.
it: È possibile utilizzare il carattere jolly MQTT "any" (+) per tutti i seguenti componenti se si desidera eseguire la sottoscrizione a più di un tipo di evento o a eventi provenienti da più di un dispositivo.
zh_cn: 如果您希望预订多种类型的事件或来自多个设备的事件，那么 MQTT“any”通配符 (+) 可用于以下任何组件。

source: Subscribing to device commands
de: Gerätebefehle subskribieren
it: Sottoscrizione ai comandi del dispositivo
zh_cn: 预订设备命令

source: An application can subscribe to commands being sent to one or more devices.
de: Eine Anwendung kann Befehle subskribieren, die an eine oder mehrere Geräte gesendet werden.
it: Un'applicazione può eseguire la sottoscrizione ai comandi inviati a uno o più dispositivi.
zh_cn: 应用程序可预订将发送到一个或多个设备的命令。

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
de: Subskribieren von Topic iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
it: Sottoscrivere a argomento iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**
zh_cn: 预订主题 iot-2/type/**device\_type**/id/**device\_id**/cmd/**command\_id**/fmt/**format\_string**

source: Subscribing to device status messages
de: Gerätestatusnachrichten subskribieren
it: Sottoscrizione ai messaggi di stato del dispositivo
zh_cn: 预订设备状态消息

source: An application can subscribe to monitor status of one or more devices.
de: Eine Anwendung kann den Überwachungsstatus einer oder mehrerer Geräte subskribieren.
it: Un'applicazione può eseguire la sottoscrizione al monitoraggio dello stato di uno o più dispositivi.
zh_cn: 应用程序可预订一个或多个设备的监视状态。

source: Subscribe to topic iot-2/type/**device\_type**/id/**device\_id**/mon
de: Subskribieren von Topic iot-2/type/**device\_type**/id/**device\_id**/mon
it: Sottoscrivere a argomento iot-2/type/**device\_type**/id/**device\_id**/mon
zh_cn: 预订主题 iot-2/type/**device\_type**/id/**device\_id**/mon

source: The MQTT "any" wildcard character (+) may be used for any of the following components if you want to subscribe to updates from more than one device.
de: Das MQTT-Platzhalterzeichen "any" (+) kann für alle der folgenden Komponenten verwendet werden, wenn Sie Updates aus mehr als einem Gerät subskribieren wollen.
it: È possibile utilizzare il carattere jolly MQTT "any" (+) per tutti i seguenti componenti se si desidera eseguire la sottoscrizione agli aggiornamenti da più di un dispositivo.
zh_cn: 如果您希望预订来自多个设备的更新，那么 MQTT“any”通配符 (+) 可用于以下任何组件。

source: Subscribing to application status messages
de: Anwendungsstatusnachrichten subskribieren
it: Sottoscrizione ai messaggi di stato dell'applicazione
zh_cn: 预订应用程序状态消息

source: An application can subscribe to monitor status of one or more applications.
de: Eine Anwendung kann den Überwachungsstatus einer oder mehrerer Anwendungen subskribieren.
it: Un'applicazione può eseguire la sottoscrizione al monitoraggio dello stato di una o più applicazioni.
zh_cn: 应用程序可预订一个或多个应用程序的监视状态。

source: Subscribe to topic iot-2/app/**app\_id**/mon
de: Subskribieren von Topic iot-2/app/**app\_id**/mon
it: Sottoscrivere a argomento iot-2/app/**app\_id**/mon
zh_cn: 预订主题 iot-2/app/**app\_id**/mon

source: The MQTT "any" wildcard character (+) may be used for **app\_id** if you want to subscribe for updates for all applications.
de: Das MQTT-Platzhalterzeichen "any" (+) kann für **app\_id** verwendet werden, wenn Sie Updates für alle Anwendungen subskribieren wollen.
it: È possibile utilizzare il carattere jolly MQTT "any" (+) per **app\_id** se si desidera effettuare una sottoscrizione agli aggiornamenti per tutte le applicazioni.
zh_cn: 如果您希望预订所有应用程序的更新，那么 MQTT“any”通配符 (+) 可用于 **app\_id**。

source: Quickstart restrictions
de: Quickstart-Einschränkungen
it: Limitazioni di Quickstart
zh_cn: Quickstart 限制

source: If you are writing application code that wants to support use with Quickstart you must take into account the following features present in the registered service that are not supported in Quickstart:
de: Wenn Sie Anwendungscode schreiben, der die Verwendung mit Quickstart unterstützt, müssen Sie die folgenden Funktionen berücksichtigen, die im registrierten Service vorhanden sind und nicht in Quickstart unterstützt werden:
it: Se si sta scrivendo un codice applicazione che vuole supportare l'utilizzo con Quickstart è necessario tener conto delle seguenti funzioni presenti nel servizio registrato che non sono supportate in Quickstart:
zh_cn: 如果您所编写的应用程序代码要支持与 Quickstart 配合使用，那么必须考虑已注册服务中存在而在 Quickstart 中不支持的以下功能：

source: Publishing commands
de: Befehle publizieren
it: Pubblicazione dei comandi
zh_cn: 发布命令

source: Subscribing to commands
de: Befehle subskribieren
it: Sottoscrizione ai comandi
zh_cn: 预订命令

source: Use of the MQTT "any" wildcard character (+) for the following topic components:
de: Verwenden Sie das MQTT-Platzhalterzeichen "any" (+) kann für die folgenden Themenkomponenten:
it: Utilizzare il carattere jolly MQTT "any" (+) per i seguenti componenti argomento:
zh_cn: 将 MQTT“any”通配符 (+) 用于以下主题组件：

source: MQTT connection over SSL
de: MQTT-Verbindung über SSL
it: Connessione MQTT su SSL
zh_cn: 通过 SSL 进行 MQTT 连接

source: Scalable Applications
de: Skalierbare Anwendungen
it: Applicazioni scalabili
zh_cn: 可扩展应用程序

source: You can build scalable applications which will load balance messages across multiple instances of your application by making a few changes to how your application connects to the IoT Platform. Applications taking advantage of this feature must only attempt to make non-durable subscriptions. A bit of experimentation may be needed to understand how many clients are needed for the optimum balance in load.
de: Sie können skalierbare Anwendungen erstellen, die den Nachrichtenlastausgleich für mehrere Instanzen Ihrer Anwendung übernehmen. Dazu sind nur wenige Änderungen an der Vorgehensweise vorzunehmen, mit der Ihre Anwendung die Verbindung zu IoT Platform herstellt. Anwendungen, die die Vorteile dieser Funktion nutzen, dürfen nur versuchen, nicht permanente Subskriptionen zu erstellen. Es kann eine kleine Versuchsreihe erforderlich sein, um zu ermitteln, wie viele Clients für einen optimalen Lastausgleich erforderlich sind.
it: È possibile creare applicazioni scalabili che eseguiranno il bilanciamento del carico dei messaggi tra più istanze dell'applicazione apportando poche modifiche al modo in cui l'applicazione si connette a IoT Platform. Le applicazioni che traggono vantaggio da questa funzione deve solo tentare di effettuare sottoscrizioni non durature. Potrebbero essere necessarie delle prove per capire quanti client sono necessari per il bilanciamento ottimale nel carico.
zh_cn: 通过对应用程序连接 IoT Platform 的方式进行一些更改，您可以构建可扩展应用程序，用于在应用程序的多个实例之间对消息进行负载均衡。使用此功能的应用程序只能进行非持久预订。可能需要进行一些试验，从而确定需要多少个客户机才能实现最佳负载均衡。

source: Supply a client id of the form **A**:**org\_id**:**app\_id**
de: Geben Sie eine Client-ID in folgender Form an: **A**:**org\_id**:**app\_id**
it: Fornire un id client nel formato **A**:**org\_id**:**app\_id**
zh_cn: 提供格式为 **A**:**org\_id**:**app\_id** 的客户机标识

source: **A** indicates the client is a scalable application
de: **A** gibt an, dass der Client eine skalierbare Anwendung ist
it: **A** indica che il client è un'applicazione scalabile
zh_cn: **A** 指示客户机是可扩展应用程序

source: **org\_id** is your unique organization ID, assigned when you sign up with the service. It will be a 6 character alphanumeric string.
de: **org\_id** ist Ihre eindeutige Organisations-ID, die beim Registrieren im Service zugeordnet wird. Die Organisations-ID ist eine alphanumerische Zeichenfolge mit 6 Zeichen.
it: **org\_id** è l'ID organizzazione univoco, assegnato quando ci si registra al servizio. Sarà una stringa di 6 caratteri alfanumerici.
zh_cn: **org\_id** 是在您注册服务时分配的唯一组织标识。它将是 6 字符字母数字字符串。

source: **app\_id** is a user-defined unique string identifier for this client.
de: **app\_id** ist eine benutzerdefinierte, eindeutige Zeichenfolgekennung für diesen Client.
it: **app\_id** è un identificativo stringa univoco definito dall'utente per questo client.
zh_cn: **app\_id** 为此客户机的用户定义的唯一字符串标识。

source: Create a non-durable subscription
de: Nicht permanente Subskription erstellen
it: Creare una sottoscrizione non duratura
zh_cn: 创建非持久预订

source: Only non-durable subscriptions are supported for scalable applications. Please note that the client id must begin with a capital 'A' in order to designated as a scalable application by the IoT Platform. Multiple clients that are part of the scalable application should use the exact same client id.
de: Für skalierbare Anwendungen werden nur nicht permanente Subskriptionen unterstützt. Beachten Sie, dass die Client-ID mit dem Großbuchstaben 'A' beginnen muss, um sie für IoT Platform als skalierbare Anwendung zu kennzeichnen. Mehrere Clients, die Bestandteil der skalierbaren Anwendung sind, müssen exakt dieselbe Client-ID aufweisen.
it: Soltanto le sottoscrizioni non durature sono supportate per le applicazioni scalabili. Tener presente che l'ID client deve iniziare con una A in maiuscolo per poter essere considerato come un'applicazione scalabile da IoT Platform. Più client che fanno parte dell'applicazione scalabile devono utilizzare esattamente lo stesso ID client.
zh_cn: 可扩展应用程序仅支持非持久预订。请注意，客户机标识必须以大写字母“A”开头，才能被 IoT Platform 指定为可扩展应用程序。属于同一个可扩展应用程序的多个客户机应使用完全相同的客户机标识。

source: How It Works
de: Funktionsweise
it: Come funziona
zh_cn: 工作原理
