Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/getting_started/features.po
Languages: de, it, ja, pt_br, zh_cn, zh_tw

source: Feature Overview
de: Funktionen - Überblick
it: Panoramica sulle funzioni
ja: フィーチャーの概要
pt_br: Visão Geral do Recurso
zh_cn: 功能部件概述
zh_tw: 功能概觀

source: Device Registry
de: Geräte-Registry
it: Registrazione dispositivo
ja: デバイス・レジストリー
pt_br: Registro do Dispositivo
zh_cn: 设备注册表
zh_tw: 裝置登錄

source: Manage your inventory, configure security, and store metadata for millions of unique devices. Define device types to represent individual device models and apply default metadata to all devices of that type.
de: Verwalten Sie den Bestand, konfigurieren Sie die Sicherheit und speichern Sie Metadaten für Millionen eindeutiger Geräte. Definieren Sie Gerätetypen für einzelne Gerätemodelle und wenden Sie Standardmetadaten auf alle Geräte des betreffenden Typs an.
it: Gestire l'inventario, configurare la sicurezza e archiviare i metadati per milioni di dispositivi unici. Definire i tipi di dispositivi per rappresentare singoli modelli di dispositivo ed applicare i metadati predefiniti a tutti i dispositivi di tale tipo.
ja: インベントリーを管理したり、セキュリティーを構成したり、何百万もの固有デバイスのメタデータを格納したりできます。個々のデバイス・モデルを表すデバイス・タイプを定義し、そのタイプのすべてのデバイスにデフォルトのメタデータを適用することもできます。
pt_br: Gerencie seu inventário, configure a segurança e armazene metadados para milhões de dispositivos exclusivos. Defina tipos de dispositivo para representar modelos de dispositivo individuais e aplique metadados padrão para todos os dispositivos desse tipo.
zh_cn: 管理库存，配置安全性以及存储数百万唯一设备的元数据。定义设备类型以表示各设备型号，并将缺省元数据应用于该类型的所有设备。
zh_tw: 管理您的庫存、配置安全，以及儲存數以百萬個獨特裝置的 meta 資料。定義裝置類型來代表個別裝置模型，並將預設 meta 資料套用至該類型的所有裝置。

source: Connectivity
de: Konnektivität
it: Connettività
ja: 接続
pt_br: Conectividade
zh_cn: 连接
zh_tw: 連線功能

source: Securely connect your devices, gateways and applications directly to the Watson IoT platform via MQTT. See the section on MQTT in the :ref:`reference material <ref-mqtt>` to learn more about the advantages of using this protocol. Model the data from your device as events and control the flow of events into your applications.
de: Verbinden Sie Ihre Geräte, Gateways und Anwendungen über MQTT sicher und direkt mit Watson IoT Platform. Weitere Informationen zu den Vorteilen der Verwendung dieses Protokolls finden Sie im Abschnitt über MQTT in :ref:`Referenzmaterial <ref-mqtt>`. Modellieren Sie die Daten von Ihrem Gerät als Ereignisse und steuern Sie den Fluss der Ereignisse in Ihre Anwendungen.
it: Connettere in modo sicuro i dispositivi, gateway e applicazioni direttamente a Watson IoT platform tramite MQTT. Consultare la sezione relativa a MQTT in :ref:`reference material <ref-mqtt>` per saperne di più sui benefici dell'utilizzo di questo protocollo. Modellare i dati dal dispositivo come eventi e controllare il flusso di eventi nelle applicazioni.
ja: MQTT を使用してセキュアにデバイス、ゲートウェイ、アプリケーションを Watson IoT Platform に直接接続できます。このプロトコルを使用するメリットの詳細については、:ref:`参照資料<ref-mqtt>` の MQTT のセクションを参照してください。デバイスから送られてくるデータをイベントとしてモデル化し、アプリケーションへのイベントの流れを制御できます。
pt_br: Conecte seus dispositivos, gateways e aplicativos com segurança diretamente à plataforma Watson IoT por meio de MQTT. Consulte a seção sobre MQTT no :ref:`material de referência <ref-mqtt>` para saber mais sobre as vantagens de usar este protocolo. Modele os dados de seu dispositivo como eventos e controle o fluxo de eventos em seus aplicativos.
zh_cn: 通过 MQTT 将设备、网关和应用程序安全地直接连接到 Watson IoT Platform。请参阅 :ref:`参考资料 <ref-mqtt>` 中有关 MQTT 的部分，以了解有关使用此协议的优势的更多信息。将设备中的数据作为事件进行建模，并控制事件进入应用程序的流程。
zh_tw: 透過 MQTT 安全地將您的裝置、閘道和應用程式直接連接至 Watson IoT Platform。請參閱 :ref:`參考資料 <ref-mqtt>` 中有關 MQTT 的小節，以進一步瞭解使用此通訊協定的優點。將來自裝置的資料設計成事件模型，並控制事件進入應用程式的流程。

source: Gateway Support
de: Gateway-Unterstützung
it: Supporto gateway
ja: ゲートウェイ・サポート
pt_br: Suporte de Gateway
zh_cn: 网关支持
zh_tw: 閘道支援

source: In many cases where a direct connection can not be made between the service and a device, the Watson IoT platform allows gateway devices to connect that can provide indirect connectivity for multiple devices.
de: In vielen Fällen kann keine direkte Verbindung zwischen dem Service und einem Gerät hergestellt werden. Watson IoT Platform ermöglicht in diesen Fällen Verbindungen mit Gateway-Geräten, die indirekte Konnektivität für viele Geräte bereitstellen können.
it: In molti casi in cui non è possibile stabilire una connessione diretta tra il servizio ed un dispositivo, Watson IoT platform consente la connessione di dispositivi gateway in grado di fornire la connettività indiretta per più dispositivi.
ja: 多くの場合、サービスとデバイスの間で直接接続を行えないため、Watson IoT platform ではゲートウェイ・デバイスが接続できるようになっており、それによって複数のデバイスの間接接続が可能です。
pt_br: Em muitos casos, quando uma conexão direta não pode ser feita entre o serviço e um dispositivo, a plataforma Watson IoT permite que os dispositivos de gateway se conectem, podendo fornecer conectividade indireta para diversos dispositivos.
zh_cn: 在许多情况下，无法在服务和设备之间进行直接连接，Watson IoT Platform 允许可为多个设备提供间接连接的网关设备进行连接。
zh_tw: 在許多無法在服務與裝置之間建立直接連線的情況下，Watson IoT Platform 可讓閘道裝置進行連接，因為它可為多個裝置提供間接連線功能。

source: Device Management
de: Gerätemanagement
it: Gestione dispositivo
ja: デバイス管理
pt_br: Gerenciamento de Dispositivo
zh_cn: 设备管理
zh_tw: 裝置管理

source: Optionally, allow the Watson IoT platform to manage the lifecycle of your devices by implementing support for the Watson IoT platform's device management protocol in your devices. The means by which the device connects to the service does not affect the device management protocol, which functions the same for directly connected, indirectly connected, and gateway devices.
de: Optional: Verwalten Sie den Lebenszyklus Ihrer Geräte mit Watson IoT Platform, indem Sie die Unterstützung für das Gerätemanagementprotokoll von Watson IoT Platform in Ihren Geräten implementieren. Die Methode, mit der das Gerät die Verbindung zum Service herstellt, hat keine Auswirkungen auf das Gerätemanagementprotokoll, das für direkt bzw. indirekt verbundene Geräte und für Gateway-Geräte gleichermaßen funktioniert.
it: Facoltativamente, consentire a Watson IoT platform di gestire il ciclo di vita dei dispositivi implementando nei dispositivi il supporto per il protocollo di gestione dispositivo di Watson IoT platform . Il modo in cui il dispositivo si connette al servizio non interferisce con il protocollo di gestione dispositivo che funziona nello stesso modo nella connessione diretta, indiretta e tramite dispositivi gateway.
ja: Watson IoT Platform のデバイス管理プロトコルに対するサポートをデバイスに実装して、デバイスのライフサイクルを Watson IoT Platform で管理することもできます。どのような方法でデバイスからサービスに接続しても、デバイス管理プロトコルへの影響はありません。直接接続したデバイスでも、間接接続したデバイスでも、ゲートウェイ・デバイスでも、デバイス管理プロトコルは機能します。
pt_br: Opcionalmente, permita que a plataforma Watson IoT gerencie o ciclo de vida de seus dispositivos implementando o suporte para o protocolo de gerenciamento de dispositivo da plataforma Watson IoT em seus dispositivos. O meio pelo qual o dispositivo se conecta ao serviço não afeta o protocolo de gerenciamento de dispositivo, que funciona da mesma forma para dispositivos conectados diretamente, conectados indiretamente e dispositivos de gateway.
zh_cn: （可选）通过在设备中实现对 Watson IoT Platform 的设备管理协议的支持，允许 Watson IoT Platform 管理设备的生命周期。设备连接到服务所采用的方式不影响设备管理协议，其功能对于直接连接的设备、间接连接的设备和网关设备都相同。
zh_tw: 選擇性地容許 Watson IoT Platform 管理裝置的生命週期，方法為在裝置中實作 Watson IoT Platform 的裝置管理通訊協定支援。裝置藉以連接至服務的方法並不會影響裝置管理通訊協定，其運作方式與直接連接、間接連接和閘道裝置相同。

source: External Service Integration
de: Externe Services integrieren
it: Integrazione del servizio esterno
ja: 外部サービス統合
pt_br: Integração de Serviço Externo
zh_cn: 外部服务集成
zh_tw: 外部服務整合

source: The Watson IoT platform supports integration with external services to bring data and operations supported by other online services into the platform, allowing your application and device developers to seemlessly interact with those services without ever leaving the comfort of the Watson IoT platform APIs.
de: Watson IoT Platform unterstützt die Integration mit externen Services, um Daten und Operationen, die von anderen Onlineservices unterstützt werden, in die Plattform zu übernehmen, und die nahtlose Interaktion der Entwickler mit diesen Services zu ermöglichen, ohne auf den Bedienkomfort der APIs von Watson IoT Platform zu verzichten.
it: Watson IoT platform supporta l'integrazione con servizi esterni per portare dati e operazioni supportati da altri servizi in linea nella piattaforma, consentendo agli sviluppatori delle applicazioni e dei dispositivi di interagire in modo opportuno con tali servizi senza mai rinunciare ai vantaggi delle API Watson IoT platform.
ja: Watson IoT Platform は、他のオンライン・サービスでサポートされているデータや操作をこのプラットフォームに組み込めるように、外部サービスと統合することをサポートしています。このため、アプリケーションやデバイスの開発者は、快適な Watson IoT Platform API を利用しながらそれらのサービスとシームレスに対話できます。
pt_br: A plataforma Watson IoT suporta a integração com serviços externos para trazer dados e operações suportados por outros serviços on-line para a plataforma, permitindo que os desenvolvedores de aplicativos e dispositivos interajam facilmente com esses serviços sem nunca deixar o conforto das APIs da plataforma Watson IoT.
zh_cn: Watson IoT Platform 支持与外部服务的集成，以将其他联机设备支持的数据和操作引入到平台中，从而使应用程序和设备开发人员能够一直轻松利用 Watson IoT Platform API 与这些服务无缝交互。
zh_tw: Watson IoT Platform 支援與外部服務整合，以將其他線上服務支援的資料及作業帶入平台，如此可讓您的應用程式和裝置開發人員無縫地與那些服務互動，而無需離開舒適的 Watson IoT Platform API。

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
de: Diese Funktion ist momentan als Teil einer begrenzten Betaversion verfügbar. Künftige Aktualisierungen können Änderungen enthalten, die möglicherweise nicht mit der aktuellen Version dieser Funktion kompatibel sind. Testen Sie die Funktion und senden Sie uns Ihren Erfahrungsbericht (siehe `Let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_).
it: Questa funzione è attualmente disponibile come parte di una versione beta limitata. Futuri aggiornamenti possono comprendere modifiche incompatibili con la versione corrente di questa funzione. Provatelo e fateci sapere cosa ne pensate <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
ja: この機能は、現在、限定的なベータ版で提供されています。今後の更新によって、この機能の現行バージョンと互換性のない変更が行われる可能性があります。この機能を試して、`ご意見をお寄せください<https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_。
pt_br: Este recurso está atualmente disponível como parte de uma versão beta limitada. Atualizações futuras poderão incluir mudanças incompatíveis com a versão atual deste recurso. Experimente e nos dê sua opinião <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_cn: 此功能目前作为受限测试版的一部分提供。将来的更新可能包含与此功能的当前版本不兼容的更改。试用并 `告知我们您的想法 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_tw: 受限測試版目前提供此功能。未來更新可能包括與此功能的現行版本不相容的變更。請試用它，並 `讓我們知道您的想法 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_

source: Historian
de: Archivierungsfunktion
it: Cronologia
ja: 履歴
pt_br: Historiador
zh_cn: 历史学家

source: Configure the Watson IoT platform to store a record of the events your devices generate.
de: Konfigurieren Sie Watson IoT Platform so, dass die von Ihren Geräten generierten Ereignisse archiviert werden.
it: Configurare Watson IoT platform per archiviare un record degli eventi che i dispositivi generano.
ja: Watson IoT Platform は、デバイスで生成されたイベントのレコードを格納するように構成できます。
pt_br: Configure a plataforma Watson IoT para armazenar um registro dos eventos que seus dispositivos geram.
zh_cn: 配置 Watson IoT Platform 以存储设备生成的事件的记录。
zh_tw: 將 Watson IoT Platform 配置為儲存裝置所產生的事件記錄。

source: **Message format restrictions apply to the Historian**
de: **Für das Nachrichtenformat der Archivierungsfunktion gelten bestimmte Einschränkungen**
it: **I vincoli al formato del messaggio si applicano alla cronologia**
ja: **履歴機能に適用されるメッセージ形式に関する制約**
pt_br: **Restrições de formato da mensagem se aplicam ao Historiador**
zh_cn: **消息格式限制适用于历史学家**
zh_tw: **訊息格式限制適用於 Historian**

source: The historian feature only supports JSON messages meeting specific critera:
de: Die Archivierungsfunktion unterstützt nur JSON-Nachrichten, die bestimmte Kriterien erfüllen:
it: La funzione di cronologia supporta solo messaggi JSON che soddisfano specifici criteri:
ja: 履歴機能は、次の特定の条件を満たす JSON メッセージのみをサポートします。
pt_br: O recurso de historiador suporta apenas mensagens JSON que atendem a critérios específicos:
zh_cn: 历史学家功能部件仅支持满足特定条件的 JSON 消息：
zh_tw: Historian 功能只支援符合特定準則的 JSON 訊息：

source: The message must be a valid JSON object (not an array) with only two top level elements: ``d`` and ``ts``
de: Die Nachricht muss ein gültiges JSON-Objekt (kein Array) mit lediglich zwei Elementen sein: ``d`` und ``ts``
it: Il messaggio deve essere un oggetto JSON valido (non un array) con soli due livelli di elementi principali: ``d`` e ``ts``
ja: メッセージは、``d`` および ``ts`` の 2 つのトップレベル要素のみを含む有効な JSON オブジェクト (配列ではない) でなければなりません。
pt_br: A mensagem deve ser um objeto JSON válido (não uma matriz) com apenas dois elementos de nível superior: ``d`` e ``ts``
zh_cn: 消息必须是仅有两个顶级元素（“d”和“ts”）的有效 JSON 对象（而非数组）
zh_tw: 訊息必須是有效的 JSON 物件（非陣列），而且只包含兩個最上層元素：``d`` 和 ``ts``

source: The message must be UTF-8 encoded
de: Die Nachricht muss in UTF-8 codiert sein
it: Il messaggio deve essere codificato UTF-8
ja: メッセージは UTF-8 エンコードでなければなりません
pt_br: A mensagem deve ser codificada por UTF-8
zh_cn: 消息必须为 UTF-8 编码消息
zh_tw: 訊息必須為 UTF-8 編碼

source: The message must be less than 4kb
de: Die Nachricht muss kleiner als 4 KB sein.
it: Il messaggio deve essere minore di 4kb
ja: メッセージは 4kb 未満でなければなりません
pt_br: A mensagem deve ter menos de 4kb
zh_cn: 消息必须小于 4kb
zh_tw: 訊息必須小於 4kb

source: **Data**
de: **Daten**
it: **Dati**
ja: **データ**
pt_br: **Dados**
zh_cn: **数据**
zh_tw: **資料**

source: The **d** element is where you include all data for the event (or command) being transmitted in the message.
de: Im Element **d** schließen Sie alle Daten für das Ereignis (oder den Befehl), das in der Nachricht übertragen wird, ein.
it: L'elemento **d** è dove si includono tutti i dati per l'evento (o comando) da trasmettere nel messaggio.
ja: **d** 要素には、メッセージに入れて送信されるイベント (またはコマンド) のすべてのデータを入れます。
pt_br: O elemento **d** é onde você inclui todos os dados para o evento (ou comando) que está sendo transmitido na mensagem.
zh_cn: 您将在 **d** 元素中包含消息中所传输的事件（或命令）的所有数据。
zh_tw: **d** 元素是您包含訊息中所傳輸之事件（或指令）的所有資料的位置。

source: This element is required for your message to meet the Watson IoT platform message specification.
de: Dieses Element ist für Ihre Nachricht erforderlich, damit die Nachrichtenspezifikation von Watson IoT Platform eingehalten wird.
it: Questo elemento è richiesto affinché il messaggio soddisfi la specifica di messaggio Watson IoT platform.
ja: この要素は、メッセージが Watson IoT プラットフォーム・メッセージ仕様を満たす上で必須です。
pt_br: Esse elemento é obrigatório para que sua mensagem atenda à especificação da mensagem da plataforma Watson IoT.
zh_cn: 此元素对于消息满足 Watson IoT Platform 消息规范是必需的。
zh_tw: 訊息若要符合 Watson IoT Platform 訊息規格，則需要此元素。

source: This must always be a JSON object (not an array)
de: Dies muss immer ein JSON-Objekt sein (kein Array)
it: Deve essere sempre un oggetto JSON (non una schiera)
ja: これは、常に JSON オブジェクトでなければなりません (配列ではない)
pt_br: Este deve ser sempre um objeto JSON (não uma matriz)
zh_cn: 这必须始终为 JSON 对象（而不是数组）
zh_tw: 這必須一律為 JSON 物件（非陣列）

source: In the case where you wish to send no data the **d** element should still be present, but contain an empty object.
de: Falls Sie keine Daten senden möchten, muss das Element **d** zwar weiterhin vorhanden sein, es muss jedoch ein leeres Objekt enthalten.
it: Nel caso in cui non si desidera inviare dati l'elemento **d** deve comunque essere presente, ma contenere un oggetto vuoto.
ja: データを送信するわけではない場合でも、**d** 要素には、空オブジェクトが内容として存在しなければなりません。
pt_br: No caso de você não desejar enviar nenhum dado, o elemento **d** ainda deve estar presente, mas conterá um objeto vazio.
zh_cn: 如果您不希望发送任何数据，那么 **d** 元素仍应该存在，但包含空对象。
zh_tw: 如果您不想要傳送資料，**d** 元素仍然要存在，但是包含空物件。

source: **Timestamp**
de: **Zeitmarke**
it: **Data/ora**
ja: **タイム・スタンプ**
pt_br: **Registro de Data e Hora**
zh_cn: **时间戳记**
zh_tw: **時間戳記**

source: The **ts** element allows you to associate a timestamp with the event (or command). This is an optional element, if included its value should be a valid ISO8601 timestamp.
de: Das Element **ts** ermöglicht das Zuordnen einer Zeitmarke mit dem Ereignis (oder dem Befehl). Wenn dieses optionale Element einbezogen wird, muss der zugehörige Wert eine gültige ISO8601-Zeitmarke sein.
it: L'elemento **ts** consente di associare una data/ora all'evento (o comando). Questo è un elemento facoltativo, se incluso il relativo valore deve essere una data/ora ISO8601 valido.
ja: **ts** 要素を使用すると、イベント (またはコマンド) にタイム・スタンプを関連付けることができます。これはオプションの要素であり、含める場合は、ISO8601 タイム・スタンプの有効な値でなければなりません。
pt_br: O elemento **ts** permite associar um registro de data e hora ao evento (ou comando). Esse é um elemento opcional, se incluído, seu valor deve ser um registro de data e hora ISO8601 válido.
zh_cn: 通过 **ts** 元素，可以将时间戳记与事件（或命令）关联。这是可选元素，如果包含在内，那么其值应是有效的 ISO8601 时间戳记。
zh_tw: **ts** 元素可讓您建立時間戳記與事件（或指令）的關聯。這是選用元素，如果已包括，其值應為有效的 ISO8601 時間戳記。

source: **Example**
de: **Beispiel**
it: **Esempio**
ja: **例**
pt_br: **Exemplo**
zh_cn: **示例**
zh_tw: **範例**

source: Last Event Cache
de: Cache für zuletzt gemeldete Ereignisse
it: Cache ultimo evento
ja: 最新イベント・キャッシュ
pt_br: Último cache de eventos
zh_cn: 上次事件高速缓存
zh_tw: 前次事件快取

source: The API can now return the last recorded value of an event-id for a specific device, or the last recorded value for each event-id reported by a specific device. The last event cache only applies to values sent in the last 30 days.
de: Die API kann nun den zuletzt aufgezeichneten Wert einer Ereignis-ID für ein bestimmtes Gerät oder den zuletzt aufgezeichneten Wert für jede von einem bestimmten Gerät gemeldete Ereignis-ID zurückgeben. Der Cache für zuletzt gemeldete Ereignisse gilt nur für Werte, die in den letzten 30 Tagen gesendet wurden.
it: L'API può ora restituire l'ultimo valore registrato di un event-id per un dispositivo specifico oppure l'ultimo valore registrato per ciascun event-id riportato da un dispositivo specifico. La cache dell'ultimo evento è valida solo per i valori inviati negli ultimi 30 giorni.
ja: API は、特定のデバイスのイベント ID 値の最後に記録されたもの、または特定のデバイスによって報告された各イベント ID 値の最後に記録されたものを返せるようになりました。最新イベント・キャッシュは、過去 30 日間に送信された値にのみ適用されます。
pt_br: A API agora pode retornar o último valor registrado de um ID de evento para um dispositivo específico ou o último valor registrado para cada ID de evento relatado por um dispositivo específico. O último cache de eventos se aplica somente a valores enviados nos últimos 30 dias.
zh_cn: API 现在可以返回特定设备的上次记录的 event-id 值，或者特定设备报告的每个 event-id 的上次记录值。上次事件高速缓存仅适用于过去 30 天内发送的值。
zh_tw: API 現在可以傳回前次記錄的特定裝置事件 ID 之值，或前次記錄的由特定裝置所報告的每個事件 ID 之值。前次事件快取僅適用於在過去 30 天內傳送的值。

source: To request the most recent value for a specific event-id, use the following API request. This request will return the last recorded value for the event-id "power".
de: Verwenden Sie die folgende API-Anforderung, um den neuesten Wert für eine bestimmte Ereignis-ID anzufordern. Diese Anforderung liefert den zuletzt aufgezeichneten Wert für die Ereignis-ID "power".
it: Per richiedere il valore più recente per un event-id specifico, utilizzare la seguente richiesta API. Tale richiesta restituirà l'ultimo valore registrato per l'event-id "power".
ja: 特定のイベント ID の最新の値を要求するには、次の API 要求を使用します。この要求は、イベント ID "power" の値の最後に記録されたものを返します。
pt_br: Para solicitar o valor mais recente para um ID de evento específico, use a solicitação de API a seguir. Essa solicitação retornará o último valor registrado para o ID de evento "power".
zh_cn: 要请求特定 event-id 的最新值，请使用以下 API 请求。此请求将返回 event-id“power”的最新记录值。
zh_tw: 若要要求特定事件 ID 的最新值，請使用下列 API 要求。此要求將會傳回前次記錄的事件 ID "power" 之值。

source: The response is returned as JSON in the following format:
de: Die Antwort wird im JSON-Format wie folgt zurückgegeben:
it: La risposta viene restituita come JSON nel seguente formato:
ja: 応答は次の形式の JSON として返されます。
pt_br: A resposta é retornada como JSON no formato a seguir:
zh_cn: 按照下列各式以 JSON 返回响应：
zh_tw: 回應會作為 JSON 以下列格式傳回：

source: Alternatively, to request the most recent value for each event-id reported by this device, use the following API request.
de: Alternativ dazu können Sie die folgende API-Anforderung verwenden, um den neuesten Wert für jede von diesem Gerät gemeldete Ereignis-ID anzufordern.
it: In alternativa, per richiedere il valore più recente per ciascun event-id riportato da questo dispositivo, utilizzare la seguente richiesta API.
ja: あるいは、このデバイスによって報告された各イベント ID 値の最新のものを要求するには、次の API 要求を使用します。
pt_br: Como alternativa, para solicitar o valor mais recente para cada ID de evento relatado por este dispositivo, use a solicitação de API a seguir.
zh_cn: 或者，要请求此设备报告的每个 event-id 的最新值，请使用以下 API 请求。
zh_tw: 或者，若要要求此裝置所報告的每個事件 ID 的最新值，請使用下列 API 要求。

source: The response will include all event-id's sent by the device. In this instance, it returns values for the "power" and "temperature" events.
de: Die Antwort enthält alle von diesem Gerät gesendeten Ereignis-IDs. In diesem Fall werden Werte für die Ereignisse "power" und "temperature" zurückgegeben.
it: La risposta comprenderà tutti gli event-id inviati dal dispositivo. In questa istanza, restituisce il valore per gli eventi "power" e "temperature".
ja: デバイスによって送信されたすべてのイベント ID が応答に含まれます。この場合は、"power" イベントと "temperature" イベントの値が返されます。
pt_br: A resposta incluirá todos os IDs de eventos enviados pelo dispositivo. Nesta instância, retorna valores para os eventos "power" e "temperature".
zh_cn: 响应将包含此设备发送的所有 event-id。在此例中，返回“power”和“temperature”事件的值。
zh_tw: 回應將會包含由此裝置傳送的所有事件 ID 之值。在此實例中，它會傳回 "power" 及 "temperature" 事件的值。
