Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/extensions/index.po
Languages: de, it, ja, pt_br, zh_cn, zh_tw

source: External Service Integrations
de: Externe Services integrieren
it: Integrazioni di un servizio esterno
ja: 外部サービス統合
pt_br: Integrações do Serviço Externo
zh_cn: 外部服务集成
zh_tw: 外部服務整合

source: Overview
de: Überblick
it: Panoramica
ja: 概説
pt_br: Visão Geral
zh_cn: 概述
zh_tw: 概觀

source: External service integration allows you to bind metadata or function supported by another service to your Watson IoT account.
de: Die Integration externer Services ermöglicht das Binden von Metadaten oder Funktionen, die von einem anderen Service unterstützt werden, an Ihr Watson IoT-Konto.
it: L'integrazione di un servizio esterno consente di collegare i metadati o la funzione supportata da un altro servizio al proprio account Watson IoT.
ja: 外部サービス統合を使用して、他のサービスでサポートされるメタデータまたは機能を、使用する Watson IoT アカウントに結合することができます。
pt_br: A integração de serviço externo permite que você ligue metadados ou função suportada por outro serviço à sua conta do Watson IoT.
zh_cn: 通过外部服务集成，可以将受其他服务支持的元数据或功能绑定到 Watson IoT 帐户。
zh_tw: 外部服務整合可讓您將另一個服務支援的 meta 資料或函數連結至您的 Watson IoT 帳戶。

source: Jasper is an administration and management platform for SIM devices. Jasper has been integrated into the IBM Watson IoT platform dashboard, making it possible to administer Jasper devices through your Watson IoT platform organization dashboard.
de: Jasper ist eine Verwaltungs- und Managementplattform für SIM-Geräte. Jasper wurde in das Dashboard von IBM Watson IoT Platform integriert, sodass es nun möglich ist, Jasper-Geräte über Ihr Organisationsdashboard von Watson IoT Platform zu verwalten.
it: Jasper è una piattaforma di amministrazione e gestione per i dispositivi SIM. Jasper è stata integrata nel dashboard IBM Watson IoT platform, rendendo possibile amministrare i dispositivi Jasper attraverso il dashboard dell'organizzazione Watson IoT platform.
ja: Jasper は SIM デバイスの管理プラットフォームです。Jasper は IBM Watson IoT Platform のダッシュボードに統合されているため、Watson IoT Platform 組織のダッシュボードを使用して、Jasper デバイスを管理できます。
pt_br: Jasper é uma plataforma de administração e gerenciamento para dispositivos SIM. O Jasper foi integrado no painel da plataforma IBM Watson IoT, tornando possível administrar dispositivos Jasper por meio do painel de sua organização da plataforma Watson IoT.
zh_cn: Jasper 是一个用于 SIM 设备的管理平台。Jasper 已集成到 IBM Watson IoT Platform 仪表板中，从而可通过 Watson IoT Platform 组织仪表板来管理 Jasper 设备。
zh_tw: Jasper 是 SIM 裝置的系統管理和管理平台。Jasper 已整合至 IBM Watson IoT Platform 儀表板中，讓您能夠透過 Watson IoT Platform 組織儀表板來管理 Jasper 裝置。

source: Jasper integration is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature.
de: Die Integration von Jasper ist momentan als Teil einer begrenzten Betaversion verfügbar. Künftige Aktualisierungen können Änderungen enthalten, die möglicherweise nicht mit der aktuellen Version dieser Funktion kompatibel sind.
it: L'integrazione Jasper è attualmente disponibile come parte di una versione beta limitata. Futuri aggiornamenti potrebbero comportare modifiche incompatibili con la versione corrente di questa funzione.
ja: Jasper 統合は、現在、限定的なベータ版で提供されています。今後の更新によって、この機能の現行バージョンと互換性のない変更が行われる可能性があります。
pt_br: A integração do Jasper está atualmente disponível como parte de uma versão beta limitada. Atualizações futuras poderão incluir mudanças incompatíveis com a versão atual deste recurso.
zh_cn: Jasper 集成当前可用作受限测试版的一部分。将来的更新可能包含与此功能的当前版本不兼容的更改。
zh_tw: 受限測試版目前提供 Jasper 整合。未來更新可能包括與此功能的現行版本不相容的變更。

source: Supported Operations
de: Unterstützte Operationen
it: Operazioni supportate
ja: サポートされる操作
pt_br: Operações Suportadas
zh_cn: 支持的操作
zh_tw: 支援的作業

source: The built-in Jasper integration provided by our platform provides support for the following Jasper operations:
de: Die Integration von Jasper in Ihre Plattform bietet Unterstützung für die folgenden Jasper-Operationen:
it: L'integrazione incorporata Jasper fornita dalla piattaforma fornisce il supporto per le seguenti operazioni Jasper:
ja: このプラットフォームで提供されている組み込み Jasper 統合では、以下の Jasper 操作がサポートされます。
pt_br: A integração do Jasper integrado fornecida por nossa plataforma fornece suporte para as seguintes operações do Jasper:
zh_cn: 由我们的平台提供的内置 Jasper 集成为以下 Jasper 操作提供支持：
zh_tw: 我們的平台提供的內建 Jasper 整合可提供下列 Jasper 作業的支援：

source: View overall Jasper data
de: Gesamte Jasper-Daten anzeigen
it: Visualizzazione dei dati generali Jasper
ja: すべての Jasper データの表示。
pt_br: Visualizar dados gerais do Jasper
zh_cn: 查看总体 Jasper 数据
zh_tw: 檢視整體 Jasper 資料

source: Shows: Status, Rate Plan, month-to-date data usage, month-to-date SMS usage, month-to-date voice usage, overage limits, date added, and date modified.
de: Folgendes wird angezeigt: Status, Tarifplan, Datennutzung für den Monat bisher, SMS-Nutzung für den Monat bisher, Telefonnutzung für den Monat bisher, Überschreitungsgrenzwerte, Hinzufügungsdatum und Änderungsdatum.
it: Mostra: Stato, piano tariffario, utilizzo dati dall'inizio del mese ad oggi, utilizzo SMS dall'inizio del mese ad oggi, utilizzo voce dall'inizio del mese ad oggi, limiti di eccedenza, data di aggiunta e data di modifica.
ja: 表示されるのは、状況、料金プラン、過去 1 カ月間のデータ使用状況、過去 1 カ月間の SMS 使用状況、過去 1 カ月間のボイス使用状況、超過限度、追加日付、および変更日付です。
pt_br: Mostra: Status, Plano de Taxa, uso de dados mês a data, uso de SMS mês a data, uso de voz mês a data, limites excedentes, data de inclusão e data de modificação.
zh_cn: 显示：状态、套餐、本月至今数据使用情况、本月至今 SMS 使用情况、本月至今语音使用情况、超额限制、添加日期和修改日期。
zh_tw: 顯示：狀態、費率方案、月初至今的資料使用情形、月初至今的 SMS 使用情形、月初至今的語音使用情形、超額限制、新增日期和修改日期。

source: Change SIM activation state.
de: SIM-Aktivierungsstatus ändern.
it: Modificare lo stato di attivazione della SIM.
ja: SIM アクティベーション状態の変更。
pt_br: Alterar estado de ativação do SIM.
zh_cn: 更改 SIM 激活状态。
zh_tw: 變更 SIM 啟動狀態。

source: Select from: Inventory, Activation Ready, Activated, Deactivated, and Retired.
de: Folgendes kann ausgewählt werden: Bestand, Aktivierungsbereit, Aktiviert, Inaktiviert und Ruhezustand.
it: Selezionare da: inventario, attivazione pronta, attivata, disattivata e ritirata.
ja: インベントリー、アクティベーション準備完了、アクティブ、非アクティブ、廃止から選択します。
pt_br: Selecione a partir de: Inventário, Ativação Pronta, Ativado, Desativado e Obsoleto.
zh_cn: 选择：库存、可随时激活、已激活、已取消激活和已废弃。
zh_tw: 從下列項目中選取：庫存、啟動就緒、已啟動、已關閉、已淘汰。

source: View SIM Usage
de: SIM-Nutzung anzeigen
it: Visualizzazione utilizzo SIM
ja: SIM 使用状況の表示。
pt_br: Visualizar Uso de SIM
zh_cn: 查看 SIM 使用情况
zh_tw: 檢視 SIM 使用情形

source: Shows: Cycle start date, billable and total data, billable and total SMS, billable and total voice.
de: Folgendes wird angezeigt: Zyklusstartdatum, abrechnungsfähige und gesamte Datennutzung, abrechnungsfähige und gesamte SMS-Nutzung, abrechnungsfähige und gesamte Telefonnutzung.
it: Mostra: data di inizio ciclo, dati totali e fatturabili, SMS totali e fatturabili, voce totale e fatturabile.
ja: 表示されるのは、サイクル開始日、請求対象および合計データ、請求対象および合計 SMS、請求対象および合計ボイスです。
pt_br: Mostra: data de início do ciclo, dados cobráveis e totais, SMS cobrável e total, voz cobrável e total.
zh_cn: 显示：周期开始日期、计费数据和数据总量、计费 SMS 和 SMS 总量、计费语音和语音总量。
zh_tw: 顯示：週期開始日期、可入帳資料和資料總計、可入帳 SMS 和 SMS 總計、可入帳語音和語音總計。

source: The cycle start date can be set using a YYYY-MM-DD format.
de: Das Zyklusstartdatum kann im Format JJJJ-MM-TT festgelegt werden.
it: La data di inizio ciclo può essere impostata utilizzando il formato AAAA_MM_GG.
ja: サイクル開始日は YYYY-MM-DD の形式を使用して設定できます。
pt_br: A data de início do ciclo de pode ser configurada usando um formato DD-MM-AAAA.
zh_cn: 可以使用 YYYY-MM-DD 格式设置周期开始日期。
zh_tw: 週期開始日期可使用 YYYY-MM-DD 格式來設定。

source: Send SMS to SIM
de: SMS an SIM senden
it: Inviare SMS alla SIM
ja: SMS から SIM への送信。
pt_br: Enviar SMS para o SIM
zh_cn: 将 SMS 发送到 SIM
zh_tw: 傳送 SMS 至 SIM

source: Change rate plan
de: Tarifplan ändern
it: Modificare il piano tariffario
ja: 料金プランの変更
pt_br: Alterar o plano de taxa
zh_cn: 更改套餐
zh_tw: 變更費率方案

source: These operations can be accessed in the device drilldown of a Jasper connected device after the configuration steps below are completed.
de: Auf diese Operationen kann im Geräte-Drilldown eines verbundenen Jasper-Geräts zugegriffen werden, nachdem die nachfolgend beschriebenen Konfigurationsschritte abgeschlossen sind.
it: È possibile accedere a queste operazioni nel drill down di un dispositivo connesso a Jasper una volta completata la procedura di configurazione riportata di seguito.
ja: 以下の構成ステップを完了すると、Jasper 接続デバイスのデバイス・ドリルダウンで上記の操作にアクセスできます。
pt_br: Essas operações podem ser acessadas no drill down do dispositivo de um dispositivo conectado Jasper, após as etapas de configuração a seguir serem concluídas.
zh_cn: 完成以下配置步骤后，可以在连接 Jasper 的设备的设备向下钻取中访问这些操作。
zh_tw: 這些作業將可在下列配置步驟完成後，在已連接 Jasper 的裝置中透過裝置往下探查來存取。

source: Configuration
de: Konfiguration
it: Configurazione
ja: 構成
pt_br: e Segurança
zh_cn: 配置
zh_tw: 配置

source: In order to connect your Watson IoT Platform platform organization with your Jasper account, there are two stages of configuration which must first be performed. The first stage of configuration is Organization Configuration.
de: Damit eine Verbindung zwischen Ihrer Organisation in Watson IoT Platform und Ihrem Jasper-Konto hergestellt werden kann, müssen zuvor zwei Konfigurationsphasen ausgeführt werden. Die erste Konfigurationsphase besteht aus der Organisationskonfiguration.
it: Per connettere l'organizzazione Watson IoT Platform all'account Jasper , è necessario prima eseguire due fasi di configurazione. La prima fase della configurazione è la Configurazione organizzazione.
ja: Watson IoT Platform プラットフォーム組織と Jasper アカウントを関連付けるために、最初に実行しなければならない 2 つの構成ステージがあります。最初の構成ステージは組織構成です。
pt_br: Para conectar a organização de plataforma do Watson IoT Platform com a sua conta Jasper, há dois estágios de configuração que devem ser executados primeiro. O primeiro estágio de configuração é de Configuração da Organização.
zh_cn: 为将 Watson IoT Platform 平台组织与 Jasper 帐户进行连接，必须先执行两个配置阶段。第一个配置阶段是组织配置。
zh_tw: 若要將您的 Watson IoT Platform 平台組織與 Jasper 帳戶相連接，必須先執行兩個配置階段。第一個配置階段是「組織配置」。

source: Extension Enablement
de: Erweiterungsaktivierung
it: Abilitazione estensione
ja: 拡張機能の有効化
pt_br: Ativação de Extensão
zh_cn: 启用扩展
zh_tw: 延伸啟用

source: To enable Jasper integrtion with your Watson IoT organization follow these steps:
de: Führen Sie die folgenden Schritte aus, um die Integration von Jasper in Ihre Watson IoT-Organisation zu aktivieren:
it: Per abilitare l'integrazione Jasper con l'organizzazione Watson IoT seguire questi passi:
ja: Jasper と Watson IoT 組織の統合を有効にするには、以下の手順を実行します。
pt_br: Para ativar a integração do Jasper com sua organização do Watson IoT, siga estas etapas:
zh_cn: 要启用 Jasper 与 Watson IoT 组织的集成，请遵循以下步骤：
zh_tw: 若要啟用 Jasper 與 Watson IoT 組織的整合，請遵循下列步驟：

source: When in your Watson IoT platform dashboard, click the wrench icon on the right to open the Configuration Settings.
de: Klicken Sie im Dashboard von Watson IoT Platform auf das Schraubenschlüsselsymbol auf der rechten Seite, um die Konfigurationseinstellungen zu öffnen.
it: Quando ci si trova nel dashboard Watson IoT platform fare clic sull'icona a forma di chiave inglese sulla destra per aprire Impostazioni di configurazione.
ja: Watson IoT プラットフォーム・ダッシュボードで、右側にあるレンチ・アイコンをクリックし、「構成設定値」を開きます。
pt_br: Quando no painel da plataforma do Watson IoT, clique no ícone de chave inglesa à direita para abrir as Definições de Configuração.
zh_cn: 当处于 Watson IoT Platform 仪表板中时，单击右侧的扳手图标以打开“配置设置”。
zh_tw: 在 Watson IoT Platform 儀表板中，按一下右側的板手圖示，以開啟「配置設定」。

source: Scroll down the to the Extensions section, and set Jasper to 'On'.
de: Blättern Sie nach unten zum Abschnitt zu den Erweiterungen und aktivieren Sie die Einstellung für Jasper.
it: Scorrere verso il basso fino alla sezione Estensioni e impostare Jasper su 'Attivo'.
ja: 「拡張 (Extensions)」セクションまでスクロールダウンし、Jasper を「オン」に設定します。
pt_br: Role para baixo para a seção Extensões e configure Jasper para 'On'.
zh_cn: 向下滚动到扩展部分，并将 Jasper 设置为“开启”。
zh_tw: 向下捲動至「延伸」區段，並將 Jasper 設為「開啟」。

source: Enter your Jasper username, password, license key, and API endpoint. The API endpoint must begin with ``http://`` or ``https://``. If the API endpoint begins with ``http://`` Watson IoT Platform will communicate with Jasper over an unencrypted connection. The API endpoint must begin with ``https://`` in order to use encryption. An example API endpoint is ``https://api.jasperwireless.com``.
de: Geben Sie Ihren Jasper-Benutzernamen, das Kennwort, den Lizenzschlüssel und den API-Endpunkt ein. Der API-Endpunkt muss mit ``http://`` oder ``https://`` beginnen. Wenn der API-Endpunkt mit ``http://`` beginnt, kommuniziert Watson IoT Platform mit Jasper über eine nicht verschlüsselte Verbindung. Wenn eine Verschlüsselung angewendet werden soll, muss der API-Endpunkt mit ``https://`` beginnen. Beispiel für einen API-Endpunkt: ``https://api.jasperwireless.com``.
it: Immettere il nome utente, la password, la chiave della licenza e l'endpoint dell'API di Jasper. L'endpoint API deve iniziare con ``http://`` o ``https://``. Se l'endpoint API inizia con ``http://`` Watson IoT Platform comunicherà con Jasper tramite una connessione codificata. L'endpoint API deve iniziare con ``https://`` per poter utilizzare la codifica. Un esempio di endpoint API ``https://api.jasperwireless.com``.
ja: Jasper のユーザー名、パスワード、ライセンス・キー、および API エンドポイントを入力します。API エンドポイントは「http://」または「https://」で開始されている必要があります。API エンドポイントが「http://」で開始する場合、Watson IoT プラットフォームは暗号化なしの接続で Jasper と通信します。暗号化を使う場合 API エンドポイントは「https://」で開始する必要があります。(例: https://api.jasperwireless.com)
pt_br: Insira nome de usuário, senha, chave de licença e o terminal da API do Jasper. O endpoint da API deve começar com ``http://`` ou ``https://``. Se o endpoint da API começar com ``http://``, o Watson IoT Platform se comunicará com o Jasper em uma conexão decriptografada. O endpoint da API deve começar com ``https://`` para usar criptografia. Um exemplo de endpoint da API é ``https://api.jasperwireless.com``.
zh_cn: 输入您的 Jasper 用户名、密码、许可证密钥和 API 端点。API 端点必须以“http://”或“https://”开头。如果 API 端点以“http://”开头，那么 Watson IoT Platform 将通过未加密连接与 Jasper 通信。API 端点必须以“https://”开头才能使用加密。API 端点示例：https://api.jasperwireless.com。
zh_tw: 輸入您的 Jasper 使用者名稱、密碼、授權金鑰和 API 端點。API 端點必須以 ``http://`` 或 ``https://`` 開頭。如果 API 端點是以 ``http://`` 開頭，Watson IoT Platform 即會透過未加密的連線與 Jasper 通訊。API 端點必須以 ``https://`` 開頭才能使用加密。範例 API 端點為 ``https://api.jasperwireless.com``。

source: Device Configuration
de: Gerätekonfiguration
it: Configurazione dispositivo
ja: デバイス構成
pt_br: Configuração de Dispositivo
zh_cn: 设备配置
zh_tw: 裝置配置

source: Devices which are connected to both your Watson IoT platform organization and your Jasper account can be configured to display data from Jasper in the Watson IoT platform dashboard. Jasper configuration cannot be applied as part of the Add Device process, only already connected devices can be configured with Jasper. To configure your Jasper-connected devices, follow these steps:
de: Geräte, die sowohl mit Ihrer Organisation in Watson IoT Platform als auch mit Ihrem Jasper-Konto verbunden sind, können so konfiguriert werden, dass Daten aus Jasper im Dashboard von Watson IoT Platform angezeigt werden. Die Jasper-Konfiguration kann nicht im Rahmen des Prozesses zum Hinzufügen von Geräten angewendet werden, nur bereits verbundene Geräte können mit Jasper konfiguriert werden. Führen Sie die folgenden Schritte aus, um die mit Jasper verbundenen Geräte zu konfigurieren:
it: I dispositivi connessi a entrambi l'organizzazione Watson IoT platform e all'account Jasper possono essere configurati per visualizzare i dati provenienti da Jasper nel dashboard Watson IoT platform. La configurazione di Jasper non può essere applicata come parte del processo Aggiungi dispositivo, solo i dispositivi già connessi possono essere configurati con Jasper. Per configurare i dispositivi connessi a Jasper, eseguire le seguenti operazioni:
ja: Watson IoT Platform 組織と Jasper アカウントの両方に接続されているデバイスは、Watson IoT Platform のダッシュボードで Jasper からのデータを表示するように構成できます。Jasper 構成を「デバイスの追加」プロセスの一部として適用することはできません。Jasper で構成できるのは、既に接続されているデバイスだけです。Jasper 接続デバイスを構成するには、以下の手順を実行します。
pt_br: Dispositivos que estão conectados à organização de plataforma do Watson IoT e sua conta Jasper podem ser configurados para exibir dados do Jasper no painel da plataforma do Watson IoT. A configuração do Jasper não pode ser aplicada como parte do processo Incluir Dispositivo, apenas dispositivos já conectados podem ser configurados com o Jasper. Para configurar os dispositivos conectados por Jasper, siga estas etapas:
zh_cn: 同时连接到 Watson IoT Platform 组织和 Jasper 帐户的设备可以配置为在 Watson IoT Platform 仪表板中显示 Jasper 的数据。Jasper 配置不能用作“添加设备”流程的一部分，只有已连接的设备可以配置 Jasper。要配置与 Jasper 连接的设备，请遵循以下步骤：
zh_tw: 同時連接至您的 Watson IoT Platform 組織和 Jasper 帳戶的裝置，可配置為在 Watson IoT Platform 儀表板中顯示來自 Jasper 的資料。Jasper 配置無法在「新增裝置」程序中套用，只有已連接的裝置，才可進行 Jasper 配置。若要對已連接 Jasper 的裝置進行配置，請遵循下列步驟：

source: In the devices tab of your Watson IoT platform dashboard, find the Jasper-connected device to be configured.
de: Suchen Sie auf der Registerkarte für Geräte in Ihrem Dashboard von Watson IoT Platform das mit Jasper verbundene Gerät, das konfiguriert werden soll.
it: Nella scheda Dispositivi del dashboard Watson IoT platform, trovare il dispositivo connesso a Jasper da configurare.
ja: Watson IoT プラットフォームのダッシュボードのデバイス・タブで、構成する Jasper 接続デバイスを見つけます。
pt_br: Na guia de dispositivos do painel da plataforma do Watson IoT, localize o dispositivo conectado por Jasper a ser configurado.
zh_cn: 在 Watson IoT Platform 仪表板的“设备”选项卡中，查找要配置的与 Jasper 连接的设备。
zh_tw: 在 Watson IoT Platform 儀表板的「裝置」標籤中，尋找已連接 Jasper 而要配置的裝置。

source: Select the device to open the Device Drilldown view.
de: Wählen Sie das Gerät aus, um die Drilldown-Ansicht für Geräte zu öffnen.
it: Selezionare il dispositivo per aprire la vista Drill down dispositivo.
ja: デバイスを選択して、「デバイス・ドリルダウン (Device Drilldown)」ビューを開きます。
pt_br: Selecione o dispositivo para abrir a visualização de Drilldown do Dispositivo.
zh_cn: 选择设备以打开“设备向下钻取”视图。
zh_tw: 選取裝置，以開啟「裝置往下探查」視圖。

source: Scroll down to the 'Extension Configuration section. The extension configuration must be entered as JSON in the following format:
de: Blättern Sie nach unten zum Abschnitt zur Erweiterungskonfiguration. Die Erweiterungskonfiguration muss als JSON im folgenden Format eingegeben werden.
it: Scorrere in basso fino alla sezione 'Configurazione estensione. È necessario immettere la configurazione dell'estensione come JSON nel seguente formato:
ja: 「拡張構成 (Extension Configuration)」セクションまでスクロールダウンします。拡張構成は、以下の形式で JSON として入力する必要があります。
pt_br: Role para baixo até a seção Configuração da 'Extensão. A configuração de extensão deve ser inserida como JSON no seguinte formato:
zh_cn: 向下滚动到“扩展配置”部分。必须采用以下格式作为 JSON 输入扩展配置：
zh_tw: 向下捲動至「延伸配置」區段。延伸配置必須以下列格式輸入為 JSON：

source: When this has been entered, click 'Confirm changes' to save the configuration.
de: Klicken Sie nach der Eingabe auf 'Änderungen bestätigen', um die Konfiguration zu speichern.
it: Una volta immessa, fare clic su 'Conferma modifiche' per salvare la configurazione.
ja: これを入力したら、「変更の確認」をクリックして構成を保存します。
pt_br: Quando isso tiver sido inserido, clique em 'Confirmar alterações' para salvar a configuração.
zh_cn: 输入该项后，请单击“确认更改”保存配置。
zh_tw: 輸入此項目後，請按一下「確認變更」以儲存配置。

source: If the Organization configuration has been completed correctly, the Extensions section should now appear below the Extensions Configuration section in the Device Drilldown.
de: Wenn die Organisationskonfiguration korrekt durchgeführt wurde, wird der Abschnitt zu den Erweiterungen nun unterhalb des Abschnitts zur Erweiterungskonfiguration im Geräte-Drilldown angezeigt.
it: Se la configurazione dell'organizzazione è stata completata correttamente, la sezione Estensioni dovrebbe essere visualizzata sotto alla sezione Configurazione dell'estensione nel drill down del dispositivo.
ja: 組織構成が正しく完了していると、「デバイス・ドリルダウン (Device Drilldown)」の「拡張構成 (Extensions Configuration)」セクションの下に「拡張 (Extensions)」セクションが表示されているはずです。
pt_br: Se a configuração da Organização tiver sido concluída corretamente, a seção Extensões deve agora aparecer abaixo da seção Configuração das Extensões no Drilldown de dispositivo.
zh_cn: 如果组织配置已正确完成，扩展部分现在应显示在“设备向下钻取”中的“扩展配置”部分下。
zh_tw: 如果「組織」配置已正確完成，「延伸」區段此時應會出現在「裝置往下探查」中的「延伸配置」區段下。
