Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/api.po
Languages: it, ja, pt_br, zh_cn, zh_tw

source: HTTP API for Devices
it: API HTTP per i dispositivi
ja: デバイス用の HTTP API
pt_br: API HTTP para Dispositivos
zh_cn: 设备的 HTTP API
zh_tw: 適用於裝置的 HTTP API

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
it: Questa funzione è attualmente disponibile come parte di una versione beta limitata. Futuri aggiornamenti possono comprendere modifiche incompatibili con la versione corrente di questa funzione. Provatelo e fateci sapere cosa ne pensate <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
ja: この機能は、現在、限定的なベータ版で提供されています。今後の更新によって、この機能の現行バージョンと互換性のない変更が行われる可能性があります。この機能を試して、`ご意見をお寄せください<https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_。
pt_br: Este recurso está atualmente disponível como parte de uma versão beta limitada. Atualizações futuras poderão incluir mudanças incompatíveis com a versão atual deste recurso. Experimente e nos dê sua opinião <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_cn: 此功能目前作为受限测试版的一部分提供。将来的更新可能包含与此功能的当前版本不兼容的更改。试用并 `告知我们您的想法 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
zh_tw: 受限測試版目前提供此功能。未來更新可能包括與此功能的現行版本不相容的變更。請試用它，並 `讓我們知道您的想法 <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_

source: Publish an event
it: Pubblica un evento
ja: イベントのパブリッシュ
pt_br: Publicar um evento
zh_cn: 发布事件
zh_tw: 發佈事件

source: As an alternative to MQTT it is possible for devices to submit events to the IoT Platform over an HTTP API. Devices may submit a ``POST`` request to: ``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
it: In alternativa a MQTT i dispositivi possono inoltrare eventi a IoT Platform attraverso un'API HTTP. I dispositivi possono inoltrare una richiesta ``POST`` a: ``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
ja: MQTT の代わりに HTTP API を使用して、デバイスから IoT Platform にイベントを送信することができます。デバイスから ``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}`` に ``POST`` 要求を送信できます。
pt_br: Como uma alternativa ao MQTT, é possível que dispositivos enviem eventos ao IoT Platform por meio de uma API HTTP. Os dispositivos podem enviar uma solicitação ``POST`` a: ``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
zh_cn: 作为 MQTT 的替代方法，设备可通过 HTTP API 向 IoT Platform 提交事件。设备可以向“https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}”提交“POST”请求。
zh_tw: 作為 MQTT 的替代方案，裝置可透過 HTTP API 將事件提交至 IoT Platform。裝置可能會將 ``POST`` 要求提交至：``https://${orgid}.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``

source: For full details, see the relevant `API documentation <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. The request body (event payload) can have any content, however, MQTT message payload guidelines should be followed.
it: Per i dettagli completi, consultare la documentazione API pertinente <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. Il corpo della richiesta (payload evento) può avere qualsiasi contenuto, tuttavia è necessario attenersi alle linee guida per il payload dei messaggi MQTT.
ja: 詳細については、関連する `API の資料<https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__ を参照してください。要求の本文 (イベント・ペイロード) は任意の内容にすることができますが、MQTT メッセージ・ペイロードのガイドラインに従う必要があります。
pt_br: Para obter detalhes completos, consulte a documentação da API relevante <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__. O corpo do pedido (carga útil do evento) pode ter qualquer conteúdo, no entanto, as diretrizes de carga útil da mensagem MQTT devem ser seguidas.
zh_cn: 有关完整的详细信息，请参阅相关的 `API 文档 <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__。请求主体（事件有效内容）可以包含任何内容，但是应遵循 MQTT 消息有效内容准则。
zh_tw: 如需詳細資料，請參閱相關的 `API 文件 <https://docs.internetofthings.ibmcloud.com/swagger/v0002.html#/>`__。要求內文（事件內容）可以有任何內容，但應遵循 MQTT 訊息內容準則。

source: When connecting a device or application to Quickstart you should use the following URL instead: ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
it: Durante la connessione di un dispositivo o un'applicazione a Quickstart, è necessario utilizzare il seguente URL: ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
ja: デバイスやアプリケーションを Quickstart に接続する場合は、代わりに、URL として ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}`` を使用してください。
pt_br: Ao conectar um dispositivo ou aplicativo ao Quickstart, é necessário usar a URL a seguir no lugar: ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``
zh_cn: 在将设备或应用程序连接到 Quickstart 时，您应该改为使用以下 URL：“http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}”
zh_tw: 將裝置或應用程式連接至 Quickstart 時，您應該改用下列 URL： ``http://quickstart.internetofthings.ibmcloud.com/api/v0002/device/types/${typeId}/devices/${deviceId}/events/${eventId}``

source: HTTP messaging only covers the ability to submit device events currently. Device management and command control require MQTT connectivity in your device.
it: Attualmente la messaggistica HTTP prevede solo la possibilità di inoltrare eventi del dispositivo. Il controllo del comando e della gestione dispositivo richiedono la connettività MQTT nel dispositivo.
ja: 現時点で HTTP メッセージングに対応しているのは、デバイス・イベントを送信する機能のみです。デバイス管理やコマンド制御を行うには、デバイスの MQTT 接続が必要です。
pt_br: O sistema de mensagens HTTP apenas cobre a capacidade de enviar eventos de dispositivo atualmente. O gerenciamento de dispositivo e o controle de comandos requerem conectividade do MQTT em seu dispositivo.
zh_cn: HTTP 消息传递目前仅具备提交设备事件的能力。设备管理和命令控制需要设备中有 MQTT 连接。
zh_tw: HTTP 傳訊目前只涵蓋提交裝置事件的能力。裝置管理和指令控制需要裝置中的 MQTT 連線功能。

source: Authentication
it: Autenticazione
ja: 認証
pt_br: Autenticação
zh_cn: 认证
zh_tw: 鑑別

source: Requests must include an authorization header. Basic authentication the only method supported. Applications are authenticated by API keys, when an application makes any request to the IoT Platform API it must present an API as it's credentials:
it: Le richieste devono includere un'intestazione di autorizzazione. L'autenticazione di base è l'unico metodo supportato. Le applicazioni vengono autenticate mediante chiavi API, quando un'applicazione effettua una richiesta a IoT Platform API, deve presentare un'API come sue credenziali:
ja: 要求には権限ヘッダーを組み込む必要があります。基本認証が、唯一サポートされる方法です。アプリケーションの認証には API キーが使用されます。アプリケーションから IoT Platform API に要求を送る場合は、資格情報として API キーを渡す必要があります。
pt_br: Solicitações devem incluir um cabeçalho de autorização. A autenticação básica é o único método suportado. Os aplicativos são autenticados por chaves de API, quando um aplicativo fizer alguma solicitação ao IoT Platform API, ele deverá apresentar uma API como suas credenciais:
zh_cn: 请求必须包含授权头。只支持基本认证方法。通过 API 密钥认证应用程序，在应用程序向 IoT Platform API 发出任何请求时，必须提供 API 作为其凭证：
zh_tw: 要求必須包括授權標頭。基本鑑別是唯一受支援的方法。應用程式是透過 API 金鑰鑑別。當應用程式向 IoT Platform API 提出任何要求時，它必須呈現 API，因為它是認證：

source: username = "use-token-auth"
it: nome utente = "use-token-auth"
ja: ユーザー名 = "use-token-auth"
pt_br: nome do usuário = "use-token-auth"
zh_cn: 用户名 =“use-token-auth”
zh_tw: 使用者名稱 = "use-token-auth"

source: password = Authentication token
it: password = token di autenticazione
ja: パスワード = 認証トークン
pt_br: senha = Authentication token
zh_cn: 密码 = 认证令牌
zh_tw: 密碼 = 鑑別記號

source: Content-Type
it: Tipo-contenuto

source: A ``Content-Type`` request header must be provided with the request. The following table shows the supported types and how they are mapped to the IoT Platform internal formats.
it: È necessario che venga fornita un'intestazione ``Tipo-contenuto`` insieme alla richiesta. La seguente tabella mostra i tipi supportati e come sono associati ai formati interni IoT Platform.
ja: 要求には ``Content-Type`` 要求ヘッダーを指定する必要があります。サポートされているタイプと、各タイプと IoT Platform の内部形式との対応関係を、以下の表にまとめます。
pt_br: Um cabeçalho da solicitação ``Content-Type`` deve ser fornecido com a solicitação. A tabela a seguir mostra os tipos suportados e como eles são mapeados para os formatos internos do IoT Platform.
zh_cn: 必须为请求提供“Content-Type”请求头。下表显示了受支持的类型以及如何将它们映射到 IoT Platform 内部格式。
zh_tw: ``Content-Type`` 要求標頭必須與要求一起提供。下表顯示支援的類型，以及如何將它們對映至 IoT Platform 內部格式。

source: Content-Type Header
it: Intestazione Content-Type
ja: Content-Type ヘッダー
pt_br: Cabeçalho Content-Type
zh_cn: Content-Type 头
zh_tw: Content-Type 標頭

source: IoT Platform Format
it: Formato IoT Platform
ja: IoT Platform の形式
pt_br: Formato do IoT Platform
zh_cn: IoT Platform 格式
zh_tw: IoT Platform 格式

source: text/plain
it: testo/semplice
pt_br: texto/plano

source: text
it: testo
ja: テキスト
pt_br: texto

source: application/json
it: applicazione/json
pt_br: aplicativo/json

source: application/xml
it: applicazione/xml
pt_br: aplicativo/xml

source: application/octet-stream
it: applicazione/octet-stream

source: Quality of Service
it: QoS (Quality of Service)
ja: サービスの品質
pt_br: Qualidade de Serviço
zh_cn: 服务质量
zh_tw: 服務品質

source: The HTTP(S) protocol provides "at most once" best effort delivery, analagous to the QoS0 quality of service provided by the MQTT protocol. When using QoS0, or the HTTP(S) equivalent, to deliver event messages, the device or application must implement retry logic to guarantee delivery.
it: Il protocollo HTTP(S) fornisce una consegna best effort "al massimo una volta", in modo simile al servizio QoS0 fornito dal protocollo MQTT. Quando si utilizza QoS0, o l'equivalente HTTP(S), per consegnare i messaggi di evento, il dispositivo o l'applicazione devono implementare la logica retry per garantire la consegna.
ja: HTTP(S) プロトコルは、MQTT プロトコルにより提供される QoS0 のサービス品質と同じように、ベスト・エフォートの送信を" 最大 1 回" 実行します。QoS0、または同等の HTTP(S) を使用してイベント・メッセージを送信する場合、デバイスまたはアプリケーションは、送信を保証するために再試行ロジックを実装する必要があります。
pt_br: O protocolo HTTP(S) fornece "no máximo uma vez " a entrega do melhor esforço, análogas a qualidade de serviço fornecido do QoS0 pelo protocolo MQTT. Ao usar o QoS0, ou o equivalente HTTP(S), para entregar mensagens de evento, o dispositivo ou aplicativo deve implementar a lógica de nova tentativa para garantir a entrega.
zh_cn: HTTP(S) 协议提供“最多一次”尽力而为的传送，类似于 MQTT 协议提供的 QoS0 服务质量。在使用 QoS0 或 HTTP(S) 等效项传送事件消息时，设备或应用程序必须实现重试逻辑来保证传送。
zh_tw: HTTP(S) 通訊協定提供「最多一次」的最佳效能遞送，這類似於 MQTT 通訊協定所提供的 QoS0 服務品質。使用 QoS0 或 HTTP(S) 的對等項目來傳遞事件訊息時，裝置或應用程式必須實作重試邏輯以保證遞送。

source: For more information on the MQTT protocol and Quality of Service levels, please see `MQTT for the IoT Platform <../reference/mqtt/index.html>`__ documentation.
it: Per ulteriori informazioni sul protocollo MQTT e sui livelli di QoS (Quality of Service), consultare la documentazione `MQTT per IoT Platform <../reference/mqtt/index.html>`__.
ja: MQTT プロトコルとサービス品質レベルの詳細については、`IoT Platform の MQTT<../reference/mqtt/index.html>`__ の資料を参照してください。
pt_br: Para obter mais informações sobre o protocolo MQTT e os níveis de Qualidade de Serviço, consulte a documentação do `MQTT para o IoT Platform <../reference/mqtt/index.html>`__.
zh_cn: 有关 MQTT 协议和服务质量级别的更多信息，请参阅 `针对IoT Platform 的 MQTT <../reference/mqtt/index.html>`__ 文档。
zh_tw: 如需 MQTT 通訊協定和「服務品質」等級的相關資訊，請參閱 `IoT Platform 的 MQTT <../reference/mqtt/index.html>`__ 文件。
