Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/reference/security/index.po
Languages: de, it

source: Securing the Watson IoT platform
de: Watson IoT Platform schützen
it: Protezione di Watson IoT platform

source: The IBM Watson IoT platform is a fully managed, cloud-hosted service that makes it simple to derive value from Internet of Things (IoT) devices.
de: IBM Watson IoT Platform ist ein vollständig verwalteter, in der Cloud gehosteter Service, der die profitable Nutzung von Internet of Things-Geräten (IoT-Geräten) fördert.
it: IBM Watson IoT platform è un servizio ospitato su cloud completamente gestito che rende semplice desumere il valore dai dispositivi IoT (Internet of Things).

source: The following document aims to answer common questions about how your organization's data is protected. Focusing on specific areas:
de: Im folgenden Dokument sollen Antworten auf die häufig gestellten Fragen gegeben werden, wie die Daten Ihrer Organisation geschützt werden. Folgende Bereiche stehen im Blickpunkt:
it: Il seguente documento si propone di rispondere alle domande comuni sul modo in cui i dati della propria organizzazione vengono protetti. Ci concentreremo su aree specifiche:

source: Authentication: assuring the identity of users, devices or applications attempting to access your organization's information.
de: Authentifizierung: Sicherstellung der Identität von Benutzern, Geräte oder Anwendungen, die auf die Informationen Ihrer Organisation zugreifen.
it: Autenticazione: il servizio si accerta dell'identità di utenti, dispositivi o applicazioni che tentano di accedere alle informazioni della propria organizzazione.

source: Authorization: assuring that users, devices and applications have permission to access your organization's information.
de: Berechtigung: Sicherstellung, dass Benutzer, Geräte und Anwendungen die Berechtigung zum Zugriff auf die Informationen Ihrer Organisation haben.
it: Autorizzazione: il servizio si accerta che utenti, dispositivi e applicazioni abbiano l'autorizzazione per accedere alle informazioni della propria organizzazione.

source: Encryption: assuring that data is only readable by authorized parties and cannot be intercepted.
de: Verschlüsselung: Sicherstellung, dass Daten nur von berechtigten Personen gelesen und nicht abgefangen werden können.
it: Codifica: il servizio si accerta che i dati siano leggibili solo dalle parti autorizzate e non possano essere intercettati.

source: Terminology
de: Terminologie
it: Terminologia

source: How do we secure management of your organization?
de: Wie sichern wir die Verwaltung Ihrer Organisation?
it: Come proteggiamo la gestione dell'organizzazione?

source: The browser-based GUI and REST APIs are fronted by HTTPS, with a certificate signed by DigiCert enabling you to trust that you're connecting to the genuine Watson IoT platform.
de: Die browserbasierte grafische Benutzerschnittstelle (GUI) und die REST-APIs laufen unter HTTPS; durch ein von DigiCert signiertes Zertifikat können Sie ganz sicher sein, dass tatsächlich eine Verbindung zu Watson IoT Platform hergestellt wird.
it: La GUI e le API REST basate su browser sono protette da HTTPS con un certificato firmato da DigiCert che garantisce l'utente che è connesso al vero Watson IoT platform.

source: GUI: authenticated via your IBM ID.
de: GUI: über Ihre IBM ID authentifiziert.
it: GUI: autenticata tramite il proprio ID IBM.

source: REST API: once you create an API key through the GUI, you can use this to make authenticated REST calls against your organization.
de: REST API: nachdem Sie einen API-Schlüssel über die GUI-Benutzerschnittstele erstellt haben, können Sie diesen Schlüssel verwenden, um authentifizierte RESTA-Aufrufe gegen Ihre Organisation durchzuführen.
it: API REST: dopo aver creato una chiave API mediante la GUI, è possibile utilizzare questa opzione per effettuare chiamate REST autenticate alla propria organizzazione.

source: How do we secure your device and application credentials?
de: Wie sichern wir die Identifikationsdaten für Ihr Gerät und Ihre Anwendung?
it: Come proteggiamo le credenziali di dispositivi e applicazioni?

source: When devices are registered or API keys are generated, the authentication token is salted and hashed. This means your organization's credentials can never be recovered from our systems - even in the unlikely event that the Watson IoT platform is compromised.
de: Wenn Geräte registriert oder API-Schlüssel generiert werden, wird das Authentifizierungstoken zufalls- und hashverschlüsselt. Dies bedeutet, dass die Identifikationsdaten Ihrer Organisation niemals mehr aus Ihren Systemen heraus wiederhergestellt werden können - auch nicht in dem sehr unwahrscheinlichen Fall, dass Watson IoT Platform komprimittiert wird.
it: Quando i dispositivi vengono registrati o le chiavi API generate, il token di autenticazione viene distribuito in modo casuale. Ciò significa che le credenziali dell'organizzazione non possono mai essere ripristinate dai sistemi - anche nell'ipotesi non probabile che Watson IoT platform sia danneggiato.

source: Device credentials and API keys can be individually revoked if they are compromised.
de: Die Identifikationsdaten von Geräten und API-Schlüssel können einzeln widerrufen werden, wenn diese kompromittiert wurden.
it: Le credenziali del dispositivo e le chiavi API possono essere revocate individualmente se sono compromesse.

source: How do we ensure your devices connect securely to the Watson IoT platform?
de: Wie stellen wir sicher, dass Ihre Geräte eine sichere Verbindung zu Watson IoT Platform herstellen?
it: In che modo si garantisce che i dispositivi si connettono a Watson IoT platform in modo protetto?

source: Devices connect through a unique combination of clientId and authentication token that only you know.
de: Geräte stellen die Verbindung über eine eindeutige Kombination aus Client-ID (clientId) und Authentifizierungstoken her. Nur Sie kennen das Authentifizierungstoken.
it: I dispositivi si connettono attraverso una combinazione univoca di id client e token di autenticazione che solo l'utente conosce.

source: Full support for connectivity over TLS (v1.2) is provided.
de: Vollständige Unterstützung für die Konnektivität über TLS (v1.2) wird bereitgestellt.
it: Viene fornito un supporto completo per la connettività su TLS (v1.2).

source: Open standards are used (MQTT v3.1.1) to allow easy interop across many platforms and languages.
de: Offene Standards werden verwendet (MQTT v3.1.1), damit eine eine einfache Interoperabilität zwischen vielen Plattformen und Sprachen ermöglicht wird.
it: Vengono utilizzati standard aperti (MQTT v3.1.1) per consentire facile interoperabilità su molte piattaforme e lingue.

source: How do we prevent data leaking between devices?
de: Wie verhindern wir, dass es zwischen Geräte Datenlecks gibt?
it: Come evitiamo la perdita di dati tra i dispositivi?

source: Secure messaging patterns are baked in. Once authenticated, devices are only authorized to publish and subscribe to a restricted topic space:
de: Es werden sichere Nachrichtenmuster verwendet. Nach erfolgter Authentifizierung sind Geräte nur dazu berechtigt, auf einem eingeschränkten Topic-Bereich zu publizieren und diesen zu subskribieren:
it: Il servizio utilizza schemi di messaggistica sicuri. Una volta autenticati, i dispositivi sono autorizzati solo alla pubblicazione e alla sottoscrizione in uno spazio argomenti limitato:

source: All devices work with the same topic space. The authentication credentials provided by the client connecting dictate to which device this topic space will be scoped by the Watson IoT platform. This prevents devices from being able to impersonate another device.
de: Alle Geräte arbeiten mit dem selben Topic-Bereich. Die Authentifizierungsnachweise, die beim Herstellen der Clientverbindung bereitgestellt werden, geben vor, auf welchem Gerät dieser Topic-Bereich durch Watson IoT Platform platziert wird. Dadurch wird verhindert, dass Geräte die Identität von anderen Geräten annehmen können.
it: Tutti i dispositivo operano con lo stesso spazio argomenti. Le credenziali di autenticazione fornite dalla connessione client stabiliscono a quale dispositivo si applicherà questo spazio argomento definito da Watson IoT platform. Ciò impedisce ai dispositivi di poter impersonare un altro dispositivo.

source: The only way to impersonate another device is by obtaining compromised security credentials for the device.
de: Die einzige Möglichkeit, die Identität eines anderen Geräts anzunehmen, besteht darin, dass man kompromittierte Sicherheitsberechtigungsnachweise für das Gerät erhält.
it: L'unico modo per impersonare un altro dispositivo consiste nell'ottenere le credenziali di sicurezza compromesse per il dispositivo.

source: Applications can subscribe and publish on both the event and command topics for all devices in the organization. Applications can analyse data from many devices simultaneously, and can also simulate or proxy devices in addition to forming the complementary side of a full duplex communication loop.
de: Anwendungen können sowohl Ereignis- als auch Befehls-Topics subskribieren und darauf publizieren, und zwar für alle Geräte in der Organisation. Anwendungen können Daten aus vielen Geräte gleichzeitig analysieren und können darüber hinaus Proxy-Geräte simulieren, zusätzlich zur Bildung der ergänzenden Rolle einer Vollduplexübertragungsschleife.
it: Le applicazioni possono sottoscrivere e pubblicare su argomenti comandi e eventi per tutti i dispositivi nell'organizzazione. Le applicazioni possono analizzare i dati da molti dispositivi simultaneamente e possono anche simulare dispositivi o fare da proxy ai dispositivi oltre a costituire la parte complementare di un loop di comunicazione full duplex.

source: How do we prevent data leaking between organizations?
de: Wie verhindern wir, dass es zwischen Organisationen Datenlecks gibt?
it: Come evitiamo la perdita di dati tra le organizzazioni?

source: The topic space in which devices and applications operate is scoped within a single organization. When authenticated, the Watson IoT platform transforms the topic structure using an organization ID based on the client authentication, making it impossible for data from one organization to be accessed from another.
de: Der Topic-Bereich, in dem Geräte und Anwendungen operieren, befindet sich bereichsorientiert innerhalb einer einzigen Organisation. Nach der Authentifizierung wandelt Watson IoT Platform die Topic-Struktur um, und zwar unter Verwendung einer Organisations-ID, die auf der Clientauthentifizierung basiert. Dadurch wird es unmöglich, dass Daten einer Organisation von einer anderen Organisation abgerufen werden können.
it: Lo spazio argomenti in cui operano i dispositivi e le applicazioni ha come ambito una singola organizzazione. Una volta autenticato, Watson IoT platform trasforma la struttura dell'argomento utilizzando l'ID organizzazione in base all'autenticazione client, rendendo impossibile l'accesso di un'organizzazione ai dati di un'altra organizzazione.
