Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/custom_actions.po
Languages: de, it

source: Each device will take action on the message, installing the new plug-in. Once installation is complete, the devices respond with the following message to indicate that the action completed successfully:
de: Jedes Gerät führt nach dem Empfang der Nachricht die entsprechende Aktion aus und installiert das neue Plug-in. Nach dem Abschluss der Installation antworten die Geräte mit der folgenden Nachricht, um anzugeben, dass die Aktion erfolgreich abgeschlossen wurde:
it: Ogni dispositivo agirà al momento del messaggio, installando il nuovo plug-in. Una volta completata l'installazione, i dispositivi risponderanno con il seguente messaggio per indicare che l'azione è stata completata correttamente:

source: At this point, the ``installPlugin`` action is now complete.
de: Nun ist die Aktion ``installPlugin`` abgeschlossen.
it: A questo punto l'azione ``installPlugin`` è completata.

source: API Examples
de: API-Beispiele
it: Esempi di API

source: The following are examples of API requests that may be useful when performing device management actions:
de: Die nachfolgend aufgeführten Beispiele für API-Anforderungen können bei der Ausführung von Gerätemanagementaktionen nützlich sein:
it: Di seguito sono riportati alcuni esempi di richieste API che potrebbero risultare utili nell'esecuzione di azioni di gestione dei dispositivi:

source: Create a new device management extension:
de: Neue Gerätemanagementerweiterung erstellen:
it: Creazione di una nuova estensione della gestione dei dispositivi:

source: ``curl -XPOST -d '<insert payload here>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
de: ``curl -XPOST -d '<Nutzdaten hier einfügen>' -H "Inhaltstyp: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``

source: List device management extensions:
de: Gerätemanagementerweiterungen auflisten:
it: Elenco delle estensioni della gestione dei dispositivi:

source: ``curl -XGET -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``
de: ``curl -XGET -H "Inhaltstyp: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/custom/bundle``

source: Initiate a device management request:
de: Gerätemanagementanforderung initiieren:
it: Avvio di una richiesta di gestione dei dispositivi:

source: ``curl -XPOST -d '<insert payload here>' -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``
de: ``curl -XPOST -d '<Nutzdaten hier einfügen>' -H "Inhaltstyp: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``

source: List in-progress or completed device management requests:
de: In Bearbeitung befindliche oder abgeschlossene Gerätemanagementanforderungen auflisten:
it: Elenco delle richieste di gestione dei dispositivi in corso o completate:

source: ``curl -XGET -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``
de: ``curl -XGET -H "Inhaltstyp: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests``

source: View status of a particular device management request:
de: Status einer bestimmten Gerätemanagementanforderung anzeigen:
it: Visualizzazione dello stato di determinate richieste di gestione dei dispositivi:

source: ``curl -XGET -H "Content-Type: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests/<requestId>``
de: ``curl -XGET -H "Inhaltstyp: application/json" -u "<apiKey>:<apiToken>" https://<orgId>.internetofthings.ibmcloud.com:443/api/v0002/mgmt/requests/<requestId>``
