Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/custom_actions.po
Languages: de, it

source: Extending Device Management
de: Gerätemanagement erweitern
it: Estensione della Gestione dispositivi

source: This feature is currently available as part of a limited beta. Future updates may include changes incompatible with the current version of this feature. Try it out and `let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_
de: Diese Funktion ist momentan als Teil einer begrenzten Betaversion verfügbar. Künftige Aktualisierungen können Änderungen enthalten, die möglicherweise nicht mit der aktuellen Version dieser Funktion kompatibel sind. Testen Sie die Funktion und senden Sie uns Ihren Erfahrungsbericht (siehe `Let us know what you think <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_).
it: Questa funzione è attualmente disponibile come parte di una versione beta limitata. Futuri aggiornamenti possono comprendere modifiche incompatibili con la versione corrente di questa funzione. Provatelo e fateci sapere cosa ne pensate <https://developer.ibm.com/answers/smart-spaces/17/internet-of-things.html>`_

source: The IBM Watson IoT Platform provides the ability to extend the device management capabilities. This is done by adding device management extensions using either the REST APIs or the IoT Platform dashboard.
de: IBM Watson IoT Platform ermöglicht die Erweiterung der Gerätemanagementfunktionalität. Hierzu werden Gerätemanagementerweiterungen über die REST-APIs oder das IoT Platform-Dashboard hinzugefügt.
it: IBM Watson IoT Platform consente di estendere le funzioni di gestione dei dispositivi. Ciò viene effettuato attraverso l'aggiunta di estensioni alla gestione dei dispositivi mediante API REST o il dashboard IoT Platform.

source: Devices which connect to the IoT Platform may have a wide range of capabilities. The device management actions supported by default in the IoT Platform (*device reboot*, *factory reset*, *firmware download* and *firmware update*) may not be sufficient to manage everything which a device can do.
de: Geräte, die eine Verbindung zu IoT Platform herstellen, können über eine breite Palette von Funktionen verfügen. Die standardmäßig in IoT Platform unterstützten Gerätemanagementaktionen (*Geräteneustart*, *Zurücksetzen auf Werkseinstellungen*, *Firmware-Download* und *Firmware-Update*) reichen möglicherweise nicht aus, um alle Funktionen zu verwalten, über die ein Gerät verfügt.
it: I dispositivi che si collegano a IoT Platform dispongono di una vasta gamma di funzionalità. Le azioni di gestione dei dispositivi, supportate per impostazione predefinita in IoT Platform (*device reboot*, *factory reset*, *firmware download* e *firmware update*), potrebbero non essere sufficienti per la gestione di tutto ciò che un dispositivo può fare.

source: Device Management Extension Packages
de: Erweiterungspackage für das Gerätemanagement
it: Package di estensione della gestione dispositivi

source: An extension package is a JSON document which defines a set of device management actions. The actions can be initiated against one or more devices which support those actions. The actions are initiated in the same way as the default device management actions by using either the IoT Platform dashboard or the device management REST APIs.
de: Bei einem Erweiterungspackage handelt es sich um ein JSON-Dokument, mit dem eine Reihe von Gerätemanagementaktionen definiert werden. Die Aktionen können für ein oder mehrere Geräte initiiert werden, die die entsprechenden Aktionen unterstützen. Die Aktionen werden über das IoT Platform-Dashboard oder die Gerätemanagement-REST-APIs auf dieselbe Weise initiiert wie die standardmäßigen Gerätemanagementaktionen.
it: Un package di estensione consiste di un documento JSON che definisce un insieme di azioni di gestione dei dispositivi. Le azioni possono essere effettuate su uno o più dispositivi che le supportino. Le azioni sono avviate allo stesso modo in cui vengono avviate le azioni di gestione del dispositivo predefinite, ossia utilizzando il dashboard IoT Platform o le API REST per la gestione dei dispositivi.

source: Device management extension packages have the following format:
de: Die Erweiterungspackages für das Gerätemanagement weisen das folgende Format auf:
it: I package di estensione della gestione dei dispositivi hanno il seguente formato:

source: Extension Package Properties:
de: Eigenschaften von Erweiterungspackages:
it: Proprietà del package di estensione:

source: ``bundleId``: Unique identifier for a device management extension. Required.
de: ``bundleId``: Eindeutige ID für eine Gerätemanagementerweiterung. Erforderlich.
it: ``bundleId``: Identificativo univoco per un'estensione di gestione dei dispositivi. Obbligatorio.

source: ``version``: Version string for a device management extension. Optional.
de: ``version``: Versionszeichenfolge für eine Gerätemanagementerweiterung. Optional.
it: ``version``: Stringa della versione di un'estensione della gestione dei dispositivi. Facoltativo.

source: ``provider``: Provider string for a device management extension. Maximum length of 1024 characters. Optional.
de: ``provider``: Providerzeichenfolge für eine Gerätemanagementerweiterung. Maximale Länge von 1024 Zeichen. Optional.
it: ``provider``: Stringa del provider di un'estensione della gestione dei dispositivi. Lunghezza massima di 1024 caratteri. Facoltativo.

source: ``displayName``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Required. Must contain at least one entry.
de: ``displayName``: Zuordnung von Schlüssel-Wert-Paaren des Typs ``locale``: ``Zeichenfolge``, die für die Anzeige im IoT Platform-Dashboard verwendet werden. Erforderlich. Muss mindestens einen Eintrag enthalten.
it: ``displayName``: Associazione delle coppie di valori chiave ``locale``: ``String`` utilizzate per la visualizzazione nel dashboard di IoT Platform. Obbligatorio. Deve contenere almeno una voce.

source: ``description``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Optional. If specified, must contain at least one entry.
de: ``description``: Zuordnung von Schlüssel-Wert-Paaren des Typs ``locale``: ``Zeichenfolge``, die für die Anzeige im IoT Platform-Dashboard verwendet werden. Optional. Wenn eine Angabe erfolgt, muss mindestens ein Eintrag enthalten sein.
it: ``description``: Associazione delle coppie di valori chiave ``locale``: ``String`` utilizzate per la visualizzazione nel dashboard di IoT Platform. Facoltativo. Se specificato, deve contenere almeno una voce.

source: ``actions``: Map of ``actionId``: ``<action>`` key-value pairs which defines the actions contained within a device management extension. Required. Must contain at least one entry.
de: ``actions``: Zuordnung von Schlüssel-Wert-Paaren des Typs ``actionId``: ``<Aktion>``, die die in einer Gerätemanagementerweiterung enthaltenen Aktionen definiert. Erforderlich. Muss mindestens einen Eintrag enthalten.
it: ``actions``: Associazione della coppie di valori chiave ``actionId``: ``<action>`` che definiscono le azioni contenute nell'estensione della gestione dei dispositivi. Obbligatorio. Deve contenere almeno una voce.

source: Properties per action:
de: Eigenschaften pro Aktion:
it: Proprietà per le azioni:

source: ``actionDisplayName``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Required. Must contain at least one entry.
de: ``actionDisplayName``: Zuordnung von Schlüssel-Wert-Paaren des Typs ``locale``: ``Zeichenfolge``, die für die Anzeige im IoT Platform-Dashboard verwendet werden. Erforderlich. Muss mindestens einen Eintrag enthalten.
it: ``actionDisplayName``: Associazione delle coppie di valori chiave ``locale``: ``String`` utilizzate per la visualizzazione nel dashboard di IoT Platform. Obbligatorio. Deve contenere almeno una voce.

source: ``description``: Map of ``locale``: ``String`` key-value pairs used for display in the IoT Platform dashboard. Optional. If specified, must contain at least one entry.
de: ``description``: Zuordnung von Schlüssel-Wert-Paaren des Typs ``locale``: ``Zeichenfolge``, die für die Anzeige im IoT Platform-Dashboard verwendet werden. Optional. Wenn eine Angabe erfolgt, muss mindestens ein Eintrag enthalten sein.
it: ``description``: Associazione delle coppie di valori chiave ``locale``: ``String`` utilizzate per la visualizzazione nel dashboard di IoT Platform. Facoltativo. Se specificato, deve contenere almeno una voce.

source: ``parameters``: Array of parameters allowed for a particular action. Optional. If specified, must contain at least one entry.
de: ``parameters``: Array der für eine bestimmte Aktion zulässigen Parameter. Optional. Wenn eine Angabe erfolgt, muss mindestens ein Eintrag enthalten sein.
it: ``parameters``: Gruppo di parametri consentiti per una determinata azione. Facoltativo. Se specificato, deve contenere almeno una voce.

source: Properties per action parameter:
de: Eigenschaften pro Aktionsparameter:
it: Proprietà per i parametri delle azioni:

source: ``name``: Unique identifier for a parameter within an action. Required.
de: ``name``: Eindeutige ID für einen Parameter innerhalb einer Aktion. Erforderlich.
it: ``name``: Identificativo univoco per un parametro in un'azione. Obbligatorio.

source: ``value``: Regular expression used for validating parameter values when a request is initiated. Optional. If not specified, value will not be validated.
de: ``value``: Regulärer Ausdruck für die Validierung von Parameterwerten beim Initiieren einer Anforderung. Optional. Wenn keine Angabe erfolgt, wird der Wert nicht validiert.
it: ``value``: Espressione regolare utilizzata per la convalida dei valori dei parametri all'avvio di una richiesta. Facoltativo. Se non specificato, il valore non sarà convalidato.

source: ``required``: Boolean value specifying whether the parameter is required. Optional. Default: False
de: ``required``: Boolescher Wert, der angibt, ob der Parameter erforderlich ist. Optional. Standardwert: False
it: ``required``: Valore booleano che specifica se il parametro è obbligatorio. Facoltativo. Valore predefinito: False

source: ``defaultValue``: Value to be used if the parameter is not provided when a request is initiated. Optional.
de: ``defaultValue``: Wert, der verwendet werden soll, wenn der Parameter beim Initiieren einer Anforderung nicht angegeben wird. Optional.
it: ``defaultValue``: Valore da utilizzare se non viene fornito il parametro all'avvio di una richiesta. Facoltativo.

source: The ``bundleId``, ``version``, ``actionId`` and ``parameterId`` values have the following restrictions:
de: Für die Werte von ``bundleId``, ``version``, ``actionId`` und ``parameterId`` gelten die folgenden Einschränkungen:
it: I valori ``bundleId``, ``version``, ``actionId`` e ``parameterId`` hanno le seguenti restrizioni:

source: Maximum length of 255 characters
de: Maximale Länge von 255 Zeichen
it: Lunghezza massima di 255 caratteri

source: Must comprise only alpha-numeric characters (a-z, A-Z, 0-9) and the following special characters:
de: Darf nur alphanumerische Zeichen (a - z, A - Z, 0 - 9) und die folgenden Sonderzeichen enthalten:
it: Devono contenere solo caratteri alfanumerici (``a-z``, ``A-Z``, ``0-9``) ed i seguenti caratteri speciali:

source: dash (-)
de: Gedankenstrich (-)
it: trattino (-)

source: underscore (_)
de: Unterstreichungszeichen (_)
it: carattere di sottolineatura (_)

source: dot (.)
de: Punkt (.)
it: punto (.)

source: Extension packages are managed in the IoT Platform using the following REST APIs.
de: Erweiterungspackages werden in IoT Platform mithilfe der folgenden REST-APIs verwaltet.
it: I package di estensione in IoT Platform sono gestiti utilizzando le seguenti API REST.

source: List all device management extension packages:
de: Alle Erweiterungspackages für das Gerätemanagement auflisten:
it: Elenco di tutti i package di estensione della gestione dei dispositivi:

source: Create a new device management extension package:
de: Neues Erweiterungspackage für das Gerätemanagement erstellen:
it: Creazione di un nuovo package di estensione della gestione dei dispositivi:

source: Get a specific device management extension package:
de: Bestimmtes Erweiterungspackage für das Gerätemanagement abrufen:
it: Acquisizione di un package di estensione della gestione dei dispositivi specifico:

source: Update a device management extension package:
de: Erweiterungspackage für das Gerätemanagement aktualisieren:
it: Aggiornamento di un package di estensione della gestione dei dispositivi:

source: Delete a device management extension package:
de: Erweiterungspackage für das Gerätemanagement löschen:
it: Eliminazione di un package di estensione della gestione dei dispositivi:

source: For more information on the REST APIs for device management extension packages refer to the `version 2 API documentation <../../swagger/v0002.html>`_.
de: Weitere Informationen zu den REST-APIs für die Erweiterungspackages für das Gerätemanagement finden Sie in der `API-Dokumentation zu Version <../../swagger/v0002.html>`_.
it: Per ulteriori informazioni sulle API REST dei package di estensione della gestione dei dispositivi fare riferimento alla `versione 2 della documentazione API <../../swagger/v0002.html>`_.

source: Supporting Custom Device Management Actions
de: Unterstützung für angepasste Gerätemanagementaktionen bereitstellen
it: Supporto delle azioni di gestione dei dispositivi personalizzate

source: Device management actions defined in an extension package may only be initiated against devices which support those actions. A device specifies what types of actions it supports when it publishes a manage request to the IoT Platform. In order to allow a device to receive custom actions defined in a particular extension package, the device must specify that extension's bundle identifier in the supports object when publishing a manage request.
de: Die in einem Erweiterungspackage definierten Gerätemanagementaktionen können nur für Geräte initiiert werden, die diese Aktionen unterstützen. Ein Gerät gibt an, welche Aktionstypen es unterstützt, wenn es eine Managementanforderung an IoT Platform publiziert. Damit ein Gerät die in einem bestimmten Erweiterungspackage definierten angepassten Aktionen empfangen kann, muss das Gerät die Bundle-ID dieser Erweiterung im Objekt 'supports' beim Publizieren einer Managementanforderung angeben.
it: Le azioni di gestione dei dispositivi definite in un package di estensione possono essere avviate solo sui dispositivi che le supportano. Un dispositivo specifica i tipi di azioni che supporta quando pubblica una richiesta di gestione in IoT Platform. Per consentire ad un dispositivo di ricevere le azioni personalizzate definite in un determinato package di estensione, esso deve specificare l'identificativo di tale del bundle dell'estensione nell'oggetto di supporto durante la pubblicazione di una richiesta di gestione.

source: For additional information about device manage requests, refer to `Device Management Protocol <index.html>`__.
de: Zusätzliche Informationen zu Gerätemanagementanforderungen finden Sie in `Gerätemanagementprotokoll <index.html>`__.
it: Per ulteriori informazioni sulle richieste di gestione dei dispositivi, consultare `Protocollo di gestione dei dispositivi <index.html>`__.

source: Initiating Custom Device Management Actions
de: Angepasste Gerätemanagementaktionen initiieren
it: Inizializzazione delle azioni di gestione dei dispositivi personalizzate

source: Custom device management actions are initiated using the same REST API as the default device management actions:
de: Angepasste Gerätemanagementaktionen werden über dieselbe REST-API initiiert wie die standardmäßigen Gerätemanagementaktionen:
it: Le azioni di gestione dei dispositivi personalizzate vengono avviate utilizzando la stessa API REST utilizzata per le azioni di gestione dei dispositivi:

source: The following information must be provided when initiating a request:
de: Die folgenden Informationen müssen beim Initiieren einer Anforderung angegeben werden:
it: Quando si avvia una richiesta è necessario specificare le seguenti informazioni:

source: The action ``<bundleId>/<actionId>``
de: Die Aktion ``<bundleId>/<actionId>``
it: L'azione ``<bundleId>/<actionId>``

source: A list of devices to initiate the action against, with a maximum of 5000 devices
de: Eine Liste der Geräte, für die die Aktion initiiert werden soll (maximal 5000 Geräte)
it: Un elenco di dispositivi su cui avviare l'azione, con un massimo di 5000 dispositivi

source: A list of parameters as defined in the custom action definition
de: Eine Liste der Parameter, die in der Definition der angepassten Aktion angegeben sind
it: Un elenco di parametri specificato nella definizione dell'azione personalizzata

source: The payload for initiating a request has the following format:
de: Die Nutzdaten für das Initiieren einer Anforderung weisen das folgende Format auf:
it: Il payload per l'avvio di una richiesta ha il seguente formato:

source: Handling Custom Device Management Actions
de: Angepasste Gerätemanagementaktionen bearbeiten
it: Gestione delle azioni di gestione dei dispositivi personalizzate

source: When a custom action is initiated against a device, an MQTT message will be published to the device. The message will contain any parameters that were specified as part of the request. When the device receives this message, it is expected to either execute the action or respond with an error code indicating that it cannot complete the action at this time.
de: Wenn eine angepasste Aktion für ein Gerät initiiert wird, wird eine MQTT-Nachricht an das Gerät publiziert. Die Nachricht enthält alle Parameter, die als Teil der Anforderung angegeben wurden. Wenn das Gerät diese Nachricht erhält, muss es entweder die Aktion ausführen oder einen Fehlercode zurückgeben, der angibt, das es die Aktion zurzeit nicht ausführen kann.
it: Quando si avvia un'azione personalizzata su un dispositivo, su quest'ultimo verrà pubblicato un messaggio MQTT. Il messaggio conterrà tutti i parametri specificati come parte della richiesta. Quando un dispositivo riceve questo messaggio, esegue l'azione oppure risponde con un codice di errore che indica che al momento non è possibile portarla a termine.

source: To indicate that the action was completed successfully, a device should publish a response with ``rc`` set to ``200``.
de: Zur Angabe, dass die Aktion erfolgreich ausgeführt wurde, muss ein Gerät eine Antwort mit ``rc`` = ``200`` publizieren.
it: Per indicare che l'azione è stata correttamente completata un dispositivo deve pubblicare una risposta con ``rc`` impostato su ``200``.

source: Below is an example exchange between the server and a device.
de: Ein Beispiel für die Kommunikation zwischen dem Server und einem Gerät ist nachfolgend aufgeführt.
it: Di seguito viene riportato un esempio di scambio tra il server ed il dispositivo.

source: Example
de: Beispiel
it: Esempio

source: In this example, we will walk through defining a new device management extension and executing an action defined within that extension.
de: In diesem Beispiel wird die Definition einer neuen Gerätemanagementerweiterung und die Ausführung einer in dieser Erweiterung definierten Aktion erläutert.
it: In questo esempio viene illustrata la procedura di definizione di una nuova estensione della gestione dei dispositivi e l'esecuzione di un'azione definita all'interno dell'estensione.

source: Some company manufactures ``exampleDeviceType`` devices. Users of these devices have the ability to manage plug-ins which run on the devices. To facilitate remote management of plug-ins on ``exampleDeviceType`` devices, the manufacturer provides a device management extension which users can import into their Watson IoT Platform organization.
de: Eine Beispielfirma stellt Geräte des Typs ``exampleDeviceType`` her. Die Benutzer dieser Geräte können Plug-ins verwalten, die auf den Geräten ausgeführt werden. Der Hersteller ermöglicht das ferne Management von Plug-ins auf den Geräten des Typs ``exampleDeviceType``, indem er eine Gerätemanagementerweiterung bereitstellt, die die Benutzer in ihre Watson IoT Platform-Organisation importieren können.
it: Alcune aziende producono dispositivi ``exampleDeviceType``. Gli utenti di tali dispositivi possono gestire i plug-in in esecuzione sui dispositivi. Per semplificare la gestione remota dei plug-in sui dispositivi ``exampleDeviceType``, il produttore fornisce un'estensione della gestione dei dispositivi che gli utenti possono importare nella propria organizzazione Watson IoT Platform.

source: The extension JSON document used in this example:
de: In diesem Beispiel verwendetes Erweiterungs-JSON-Dokument:
it: Il documento JSON dell'estensione utilizzato in questo esempio:

source: In this device management extension package, 4 actions are defined:
de: In diesem Erweiterungspackage für das Gerätemanagement sind 4 Aktionen definiert:
it: In questo package di estensione della gestione dei dispositivi sono definite 4 azioni:

source: The extension is added using the REST API:
de: Die Erweiterung wird mithilfe der REST-API hinzugefügt:
it: L'estensione viene aggiunta utilizzando l'API REST:

source: Devices registered in organization ``<orgId>`` are now able to specify that they support ``exampleDeviceType-actions-v1`` actions when publishing a manage request.
de: Die in der Organisation ``<orgId>`` registrierten Geräte können nun beim Publizieren einer Managementanforderung angeben, dass sie ``exampleDeviceType-actions-v1``-Aktionen unterstützen.
it: I dispositivi registrati nell'organizzazione ``<orgId>`` sono ora disponibili per specificare che supportano le azioni ``exampleDeviceType-actions-v1`` quando si pubblica una richiesta di gestione.

source: In this example, the manage request sent by a device would look like this:
de: In diesem Beispiel würde die von einem Gerät gesendete Managementanforderung wie folgt aussehen:
it: In questo esempio la richiesta di gestione inviata dal dispositivo sarà simile alla seguente:

source: The device should then receive the following response from the IoT Platform:
de: Das Gerät erhält dann die folgende Antwort von IoT Platform:
it: Il dispositivo riceve quindi la seguente risposta da IoT Platform:

source: At this point, an action defined in the ``exampleIoT-exampleDeviceType-v1`` extension can be initiated against some devices.
de: Nun kann eine in der Erweiterung ``exampleIoT-exampleDeviceType-v1`` definierte Aktion für einige Geräte initiiert werden.
it: A questo punto, è possibile avviare un'azione nell'estensione ``exampleIoT-exampleDeviceType-v1`` su un dispositivo.

source: The payload for initiating an ``installPlugin`` action will look like the following:
de: Die Nutzdaten für die Initiierung einer Aktion ``installPlugin`` sehen wie folgt aus:
it: Il payload per l'avvio di un'azione ``installPlugin`` sarà simile al seguente:

source: The request is initiated using the REST API:
de: Die Anforderung wird mithilfe der REST-API initiiert:
it: La richiesta viene avviata utilizzando l'API REST:

source: Devices ``device0`` and ``device1`` of type ``exampleDeviceType`` will then receive the following MQTT message:
de: Die Geräte ``device0`` und ``device1`` des Typs ``exampleDeviceType`` erhalten dann die folgende MQTT-Nachricht:
it: I dispositivi ``device0`` e ``device1`` del tipo ``exampleDeviceType`` riceveranno il seguente messaggio MQTT:
