Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/index.po
Languages: it, pt_br, zh_cn

source: Device Management Protocol
it: Protocollo di gestione dispositivo
pt_br: Protocolo de Gerenciamento de Dispositivo
zh_cn: 设备管理协议

source: Introduction
it: Introduzione
pt_br: Introdução
zh_cn: 简介

source: The Device Management capabilities in the IoT Platform create a new class of connected devices, Managed Devices.
it: Le funzionalità di gestione del dispositivo in IoT Platform creano una nuova classe di dispositivi connessi, i dispositivi gestiti.
pt_br: Os recursos de Gerenciamento de Dispositivos no IoT Platform criam uma nova classe de dispositivos conectados, os Dispositivos Gerenciados.
zh_cn: IoT Platform 中的“设备管理”功能可创建新一类的已连接设备，即“受管设备”。

source: Managed Devices must, by definition, contain a management agent which can understand the IoT Platform Device Management Protocol, and send a Manage Device request to the IoT Platform Device Management server. Managed devices can access the device management operations as explained later in this document.
it: I dispositivi gestiti devono, per definizione, contenere un agent di gestione che può interpretare il protocollo di gestione dispositivo e inviare una richiesta di gestione dispositivo al server di gestione dispositivo Iot Platform. I dispositivi gestiti possono accedere alle operazioni di gestione dispositivo come illustrato in seguito in questo documento.
pt_br: Por definição, os Dispositivos Gerenciados devem conter um agente de gerenciamento que possa entender o IoT Platform Device Management Protocol e enviar uma solicitação de Gerenciamento de Dispositivo ao servidor IoT Platform Device Management. Os dispositivos gerenciados podem acessar as operações de gerenciamento de dispositivos, como é explicado posteriormente neste documento.
zh_cn: 根据定义，受管设备必须包含一个管理代理程序，该代理程序可理解“IoT Platform 设备管理协议”，并可向“IoT Platform 设备管理”服务器发送“管理设备”请求。如本文档后续部分所述，受管设备可以访问设备管理操作。

source: The Device Management Protocol defines a set of supported operations. A device management agent can support a subset of the operations, but the Manage device and Unmanage device operations must be supported. A device supporting firmware action operations must also support observation.
it: Il protocollo di gestione dispositivo definisce un insieme di operazioni supportate. Un agent di gestione dispositivo può supportare un sottoinsieme delle operazioni, ma le operazioni Gestisci dispositivo e Annulla gestione dispositivo devono essere supportate. Un dispositivo che supporta le operazioni Azioni firmware deve anche supportate le osservazioni.
pt_br: O Protocolo de Gerenciamento de Dispositivo define um conjunto de operações suportadas. Um agente de gerenciamento de dispositivo pode suportar um subconjunto de operações, mas as operações Gerenciar dispositivo e Não gerenciar dispositivo devem ser suportadas. Um dispositivo que suporta operações de ação de firmware deve suportar também a observação.
zh_cn: 设备管理协议定义了一组受支持的操作。设备管理代理程序可以支持其中一部分操作，但必须支持“管理设备”和“取消管理设备”操作。支持固件操作的设备还必须支持观察。

source: The Device Management Protocol is built on top of MQTT. For details specific to how Device Management Protocol interacts with MQTT please see `MQTT Connectivity for Devices <../mqtt.html>`__
it: Il protocollo di gestione dispositivo si basa su MQTT. Per i dettagli specifici relativi al modo in cui il protocollo di gestione dispositivo interagisce con MQTT, consultare `Connettività MQTT per i dispositivi <..mqtt.html>`__
pt_br: O Protocolo de Gerenciamento de Dispositivo é construído sobre o MQTT. Para obter detalhes específicos sobre como o Device Management Protocol interage com o MQTT, consulte `Conectividade de MQTT para Dispositivos < ../mqtt.html>`__
zh_cn: 设备管理协议基于 MQTT 构建。有关设备管理协议如何与 MQTT 进行交互的特定详细信息，请参阅 `设备的 MQTT 连接 <../mqtt.html>`__

source: The Device Management Lifecycle
it: Il ciclo di vita di Gestione dispositivo
pt_br: O Ciclo de Vida de Gerenciamento do Dispositivo
zh_cn: 设备管理生命周期

source: A device and its associated device type are created in the IoT Platform using the dashboard or API.
it: Un dispositivo e il relativo tipo di dispositivo associato vengono creati in IoT Platform utilizzando il dashboard o l'API.
pt_br: Um dispositivo e seu tipo de dispositivo associado são criados no IoT Platform usando o painel ou a API.
zh_cn: 在 IoT Platform 中使用仪表板或 API 创建设备及相关设备类型。

source: The device connects to the IoT Platform and uses the 'Manage Device' operation to become a managed device.
it: Il dispositivo si connette a IoT Platform e utilizza l'operazione Gestisci dispositivo per diventare un dispositivo gestito.
pt_br: O dispositivo se conecta ao IoT Platform e usa a operação 'Gerenciar Dispositivo' para se tornar um dispositivo gerenciado.
zh_cn: 设备必须连接到 IoT Platform 并使用“管理设备”操作，才能成为受管设备。

source: The device's metadata, as described in the Device Model can now be viewed and manipulated through device operations, for example, firmware update and device reboot.
it: I metadati del dispositivo, come descritto nel Modello dispositivo, possono essere ora visualizzati e manipolati attraverso operazioni dispositivo, ad esempio, l'aggiornamento firmware e il riavvio dispositivo.
pt_br: Os metadados do dispositivo, conforme descrito no Modelo de Dispositivo, agora podem ser visualizados e manipulados por meio de operações de dispositivo, por exemplo, a atualização de firmware e a reinicialização do dispositivo.
zh_cn: 现在，可以通过设备操作（例如，固件更新和设备重新引导）来查看和操纵设备的元数据（如设备模型中所述）。

source: The device can communicate updates through the device-management protocol, such as location or diagnostic information and error codes.
it: Il dispositivo può comunicare aggiornamenti tramite il protocollo di gestione dispositivo, come l'ubicazione o informazioni di diagnostica e codici di errore.
pt_br: O dispositivo pode comunicar atualizações por meio do protocolo de gerenciamento de dispositivo, como informações de local ou de diagnóstico e códigos de erro.
zh_cn: 设备可以通过设备管理协议来传达更新（例如，位置或诊断信息，以及错误代码）。

source: In order to provide a way to deal with defunct devices in large device populations, the 'Manage device' operation request has an optional lifetime parameter. This lifetime parameter is the number of seconds within which the device must make another 'Manage device' request in order to avoid being marked as dormant and becoming an unmanaged device.
it: Per fornire un modo per gestire i dispositivi inattivi in vasti gruppi di dispositivi, la richiesta dell'operazione Gestisci dispositivo prevede un parametro facoltativo di durata. Questo parametro di durata è il numero di secondi entro il quale il dispositivo deve effettuare un'altra richiesta 'Gestisci dispositivo' per evitare di essere contrassegnato come inattivo e diventare un dispositivo non gestito.
pt_br: Para fornecer uma maneira de lidar com dispositivos inativos em grandes populações de dispositivos, a solicitação da operação 'Gerenciar dispositivo' possui um parâmetro de tempo de vida opcional. Esse parâmetro de tempo de vida é o período, em segundos, no qual o dispositivo deve fazer outra solicitação 'Gerenciar dispositivo' para evitar ser marcado como inativo e tornar-se um dispositivo não gerenciado.
zh_cn: 为了能够在设备众多的情况下处理失效的设备，“管理设备”操作请求中提供了一个可选的生命周期参数。此生命周期参数包含的是一个秒数，设备必须在这段时间内发出另一个“管理设备”请求，才能避免被标记为停止而成为非受管设备。

source: When a device is decommissioned it can be removed from the IoT Platform using the dashboard or REST API.
it: Quando un dispositivo viene dismesso può essere rimosso da IoT Platform utilizzando il dashboard o l'API REST.
pt_br: Quando um dispositivo é desatribuído, ele pode ser removido do IoT Platform usando o painel ou a API REST.
zh_cn: 设备退役后，可以使用仪表板或 REST API 从 IoT Platform 中移除该设备。

source: Return Code Summary
it: Riepilogo dei codici di ritorno
pt_br: Resumo do Código de Retorno
zh_cn: 返回码摘要

source: There are several return codes which are sent in response to the actions listed above.
it: Esistono diversi codici di ritorno inviati in risposta alle azioni elencate in precedenza.
pt_br: Há diversos códigos de retorno que são enviados em resposta às ações listadas acima.
zh_cn: 上述操作的响应中会发送多种返回码。

source: 200: Operation succeeded
it: 200: Operazione riuscita
pt_br: 200: Operação bem-sucedida
zh_cn: 200：操作成功

source: 202: Accepted (for initiating commands)
it: 202: Accettato (per avviare i comandi)
pt_br: 202: Aceito (para a inicialização de comandos)
zh_cn: 202：已接受（针对正在启动的命令）

source: 204: Changed (for attribute updates)
it: 204: Modificato (per gli aggiornamenti attributo)
pt_br: 204: Alterado (para atualizações de atributos)
zh_cn: 204：已更改（针对属性更新）

source: 400: Bad request, for example, if a device is not in the appropriate state for this command
it: 400: Richiesta errata, ad esempio, se un dispositivo non si trova nello stato appropriato per questo comando
pt_br: 400: Solicitação inválida, por exemplo, se um dispositivo não estiver no estado adequado para este comando
zh_cn: 400：错误请求（例如，当设备的状态不适合执行该命令时）

source: 404: Attribute was not found, this code is also used if the operation was published to an invalid topic.
it: 404: L'attributo non è stato trovato, questo codice viene utilizzato anche se l'operazione è stata pubblicata in un argomento non valido.
pt_br: 404: O atributo não foi localizado, esse código também será usado se a operação for publicada para um tópico inválido.
zh_cn: 404：未找到属性，如果操作被发布至无效主题，那么也会使用此代码。

source: 409: Resource could not be updated due to a conflict, for example, the resource is being updated by two simultaneous requests, so update could be retried later
it: 409: La risorsa non può essere aggiornata a causa di un conflitto, ad esempio, la risorsa viene aggiornata da due richieste simultanee, quindi l'aggiornamento può essere ritentato più tardi
pt_br: 409: O recurso não pôde ser atualizado devido a um conflito, por exemplo, o recurso está sendo atualizado por duas solicitações simultâneas, portanto, é possível tentar novamente fazer a atualização mais tarde
zh_cn: 409：由于发生冲突而无法更新资源（例如，两个并发请求正在更新该资源，因此可以稍后重试更新）

source: 500: Unexpected device error
it: 500: Errore del dispositivo imprevisto
pt_br: 500: Erro de dispositivo inesperado
zh_cn: 500：意外的设备错误

source: 501: Operation not implemented
it: 501: Operazione non implementata
pt_br: 501: Operação não implementada
zh_cn: 501：未实施操作

source: Manage Device
it: Gestisci dispositivo
pt_br: Gerenciar Dispositivo
zh_cn: 管理设备

source: A device uses this request to become a managed device. It should be the first device management request sent by the device after connecting to the IoT Platform. It would be usual for a device management agent to send this whenever it starts or restarts.
it: Un dispositivo utilizza questa richiesta per diventare un dispositivo gestito. Dovrebbe essere la prima richiesta di gestione dispositivo inviata dal dispositivo dopo la connessione a IoT Platform. È usuale per un agent di gestione dispositivo inviare questa richiesta ogni volta che viene avviato o riavviato.
pt_br: Um dispositivo usa essa solicitação para se tornar um dispositivo gerenciado. Esta deve ser a primeira solicitação de gerenciamento de dispositivo enviada pelo dispositivo após a conexão com o IoT Platform. Geralmente um agente de gerenciamento de dispositivo envia essa solicitação sempre que é iniciado ou reiniciado.
zh_cn: 设备可通过此请求成为受管设备。这应该是设备在连接到 IoT Platform 后发送的第一个设备管理请求。设备管理代理程序在启动或重新启动时通常会发送此请求。

source: Support for this operation is mandatory for any managed devices.
it: Il supporto per questa operazione è obbligatorio per qualsiasi dispositivo gestito.
pt_br: O suporte para essa operação é obrigatório para todos os dispositivos gerenciados.
zh_cn: 任何受管设备都需要支持此操作。

source: Topic
it: Argomento
pt_br: Tópico
zh_cn: 主题

source: A device publishes this request to the following topic:
it: Un dispositivo pubblica questa richiesta sul seguente argomento:
pt_br: Um dispositivo publica esta solicitação ao tópico a seguir:
zh_cn: 设备将此请求发布到以下主题：

source: The server responds to this request on the following topic:
it: Il server risponde a tale richiesta sul seguente argomento:
pt_br: O servidor responde a esta solicitação no tópico a seguir:
zh_cn: 服务器在以下主题上对此请求做出响应：

source: Message Format
it: Formato messaggio
pt_br: Formato da Mensagem
zh_cn: 消息格式

source: For the request, the ``d`` field and all of its sub-fields are optional. The ``metadata`` and ``deviceInfo`` field values replace the corresponding attributes for the sending device if they are sent.
it: Per la richiesta, il campo ``d`` e tutti i sottocampi, sono facoltativi. I valori campo ``metadata`` e ``deviceInfo`` sostituiscono i corrispondenti attributi per il dispositivo di invio se vengono inviati.
pt_br: Para a solicitação, o campo ``d`` e todos os seus sub-campos são opcionais. Os valores dos campos ``metadata`` e ``deviceInfo`` substituem os atributos correspondentes para o dispositivo de envio, se forem enviados.
zh_cn: 对于此请求，“d”字段及其所有子字段都是可选字段。“metadata”和“deviceInfo”字段值将替换发送设备的对应属性（如果发送了这些属性）。

source: The optional ``lifetime`` field specifies the length of time in seconds within which the device must send another 'Manage device' request in order to avoid being reverted to an unmanaged device and marked as dormant. If omitted or if set to ``0``, the managed device will not become dormant. When set, the minimum supported setting is ``3600`` (1 hour).
it: Il campo facoltativo ``lifetime`` specifica l'arco di tempo in secondi entro cui il dispositivo deve inviare un'altra richiesta 'Gestisci dispositivo' per evitare di essere invertito in un dispositivo non gestito e contrassegnato come inattivo. Se omesso o se impostato su ``0``, il dispositivo gestito non diventerà inattivo. Quando è impostato, l'impostazione minima supportata è ``3600`` (1 ora).
pt_br: O campo opcional ``lifetime`` especifica o período de tempo, em segundos, no qual o dispositivo deve enviar outra solicitação 'Gerenciar dispositivo' a fim de evitar ser revertido em um dispositivo não gerenciado e marcado como inativo. Se for omitido ou configurado como ``0``, o dispositivo gerenciado não se tornará inativo. Quando configurado, a configuração mínima suportada é ``3600`` (1 hora).
zh_cn: 可选的“lifetime”字段用于指定时间长度（以秒计），设备必须在这段时间内发送另一个“管理设备”请求，才能避免被还原为非受管设备且标记为停止。如果省略了此字段或将其设置为“0”，那么受管设备不会停止。设置此字段时，支持的最低设置为“3600”（1 小时）。

source: Optional ``supports.deviceActions`` and ``supports.firmwareActions`` indicate the capabilities of the device management agent. If ``supports.deviceActions`` is set, the agent supports Reboot and Factory Reset actions. For a device that does not distinguish between rebooting and factory reset, it is acceptable to use the same behaviour for both actions. If ``supports.firmwareActions`` is set, the agent supports Firmware Download and Firmware Update actions.
it: Facoltativo, ``supports.deviceActions`` e ``supports.firmwareActions`` indicano le funzioni dell'agent di gestione dispositivo. Se ``supports.deviceActions`` è impostato, l'agent supporta le azioni Riavvia e Reimpostazione alle impostazioni di fabbrica. Per un dispositivo che non distingue tra il riavvio e la reimpostazione alle impostazioni di fabbrica, è accettabile utilizzare lo stesso comportamento per entrambe le azioni. Se ``supports.firmwareActions`` è impostato, l'agent supporta le azioni Scaricamento firmware e Aggiornamento firmware.
pt_br: Os itens opcionais ``supports.deviceActions`` e ``supports.firmwareActions`` indicam os recursos do agente de gerenciamento de dispositivo. Se ``supports.deviceActions`` for configurado, o agente suportará as ações Reinicializar e Reconfiguração de Fábrica. Para um dispositivo que não faz distinção entre a reinicialização e a reconfiguração de fábrica, é aceitável usar o mesmo comportamento para ambas as ações. Se ``supports.firmwareActions`` for configurado, o agente suportará as ações Download do Firmware e Atualização de Firmware.
zh_cn: 可选的“supports.deviceActions”和“supports.firmwareActions”用于指示设备管理代理程序的功能。如果设置“supports.deviceActions”，那么代理程序支持“重新引导”和“恢复工厂设置”操作。对于不区分重新引导和恢复工厂设置的设备，可接受对这两种操作使用相同的行为。如果设置“supports.firmwareActions”，那么代理程序支持“固件下载”和“固件更新”操作。

source: Request Format:
it: Formato richiesta:
pt_br: Formato da Solicitação:
zh_cn: 请求格式：

source: Response Format:
it: Formato risposta:
pt_br: Formato de Resposta:
zh_cn: 响应格式：

source: Response Codes
it: Codici di risposta
pt_br: Códigos de Resposta
zh_cn: 响应代码

source: 200: The operation was successful.
it: 200: L'operazione è stata eseguita correttamente.
pt_br: 200: A operação foi bem-sucedida.
zh_cn: 200：操作成功。

source: 400: The input message does not match the expected format, or one of the values is out of the valid range.
it: 400: Il messaggio di input non corrisponde al formato previsto oppure uno dei valori non è compreso nell'intervallo valido.
pt_br: 400: A mensagem de entrada não corresponde ao formato esperado ou um dos valores está fora do intervalo válido.
zh_cn: 400：输入消息与期望的格式不匹配，或者其中一个值超出有效范围。

source: 404: The topic name is incorrect, or the device is not in the database.
it: 404: Il nome dell'argomento non è corretto oppure il dispositivo non si trova nel database.
pt_br: 404: O nome do tópico está incorreto ou o dispositivo não está no banco de dados.
zh_cn: 404：主题名称不正确，或者此设备不在数据库中。

source: 409: A conflict occurred during the device database update. To resolve this, simplify the operation is necessary.
it: 409: Si è verificato un conflitto durante l'aggiornamento del database del dispositivo. Per risolvere questo problema, semplificare l'operazione se necessario.
pt_br: 409: Ocorreu um conflito durante a atualização de banco de dados do dispositivo. Para resolver isso, é necessário simplificar a operação.
zh_cn: 409：在设备数据库更新期间发生冲突。要解决此问题，需要简化操作。

source: Unmanage Device
it: Annulla gestione dispositivo
pt_br: Não Gerenciar Dispositivo
zh_cn: 取消管理设备

source: A device uses this request when it no longer needs to be managed. The IoT Platform will no longer send new device management requests to this device and all device management requests from this device will be rejected other than a 'Manage device' request.
it: Un dispositivo utilizza questa richiesta quando non deve essere più gestito. IoT Platform non invierà più nuove richieste di gestione dispositivo a questo dispositivo e tutte le richieste di gestione dispositivo provenienti da questo dispositivo diverse da Gestisci dispositivo, verranno respinte.
pt_br: Um dispositivo usa essa solicitação quando não precisa mais ser gerenciado. O IoT Platform não enviará mais novas solicitações de gerenciamento de dispositivo para este dispositivo e todas as solicitações de gerenciamento de dispositivo a partir deste dispositivo serão rejeitadas, exceto uma solicitação 'Gerenciar dispositivo'.
zh_cn: 当设备不需要再作为受管设备时，它可以使用此请求。IoT Platform 将不再向此设备发送新的设备管理请求，并且将拒绝来自此设备的所有设备管理请求（“管理设备”请求除外）。

source: Update Location
it: Aggiorna ubicazione
pt_br: Atualizar Local
zh_cn: 更新位置

source: Devices can change their location over time. The update of the location can happen in two ways:
it: Nel tempo, i dispositivi possono cambiare la propria ubicazione. L'aggiornamento dell'ubicazione può essere eseguito in due modi:
pt_br: Os dispositivos podem alterar sua localização ao longo do tempo. A atualização da localização pode ocorrer de duas maneiras:
zh_cn: 设备可以随时间推移更改位置。可以通过以下两种方式更新位置：

source: The device itself notifies the IoT Platform about the location update: The device retrieves its location from a GPS receiver and sends a device management message to the IoT Platform to update its location. The timestamp captures the time at which the location was retrieved from the GPS receiver. This means that the timestamp is valid, even if the transmission of the location message was delayed. In the event that the timestamp is omitted from the device management message sent, the current date and time on message receipt will be used when the device's location metadata is updated.
it: Il dispositivo stesso notifica a IoT Platform l'aggiornamento dell'ubicazione: il dispositivo rileva la posizione da un ricevitore GPS e invia un messaggio di gestione dispositivo a IoT Platform per aggiornare l'ubicazione. La registrazione data/ora cattura l'ora in cui l'ubicazione è stata richiamata dal ricevitore GPS. Ciò significa che la registrazione data/ora è valida, anche se la trasmissione del messaggio di ubicazione è stata ritardata. Nel caso in cui la registrazione data/ora viene omessa dal messaggio di gestione dispositivo inviato, verrà utilizzata la data e l'ora correnti sulla ricevuta del messaggio quando i metadati ubicazione del dispositivo vengono aggiornati.
pt_br: O próprio dispositivo notifica o IoT Platform sobre a atualização de local: o dispositivo recupera sua localização a partir de um receptor de GPS e envia uma mensagem de gerenciamento de dispositivo para ao IoT Platform para atualizar sua localização. O registro de data e hora captura o horário em que o local foi recuperado do receptor de GPS. Isso significa que o registro de data e hora é válido, mesmo que a transmissão da mensagem de local tenha sido atrasada. Caso o registro de data e hora seja omitido da mensagem de gerenciamento de dispositivo enviada, a data e hora atuais no recebimento da mensagem serão usadas quando os metadados do local do dispositivo forem atualizados.
zh_cn: 设备本身会向 IoT Platform 通知位置更新：设备从 GPS 接收器检索其位置，并向 IoT Platform 发送设备管理消息来更新其位置。时间戳记可捕获从 GPS 接收器检索到设备位置的时间。这表示时间戳记有效，即使位置消息的传输发生延迟，也是如此。如果所发送的设备管理消息中省略了时间戳记，那么在更新设备位置元数据时，将使用该消息的接收日期和时间。

source: A user / app updates the location of a device using the Rest API: The IoT Platform REST API is used to set the location metadata of a static device. This can be done at the time that the device is registered, or later if required. It is optional whether to include a timestamp. If omitted, the current date and time will be set as the device’s location metadata.
it: Un utente / app aggiorna l'ubicazione di un dispositivo utilizzando l'API REST: L'API REST IoT Platform viene utilizzata per impostare i metadati dell'ubicazione di un dispositivo statico. Questa operazione può essere effettuata al momento in cui il dispositivo viene registrato o successivamente se richiesto. È facoltativo se includere o meno una registrazione data/ora. Se omesso, la data e l'ora correnti verranno impostate come metadati di ubicazione del dispositivo.
pt_br: Um usuário/aplicativo atualiza o local de um dispositivo usando a API Rest: A API REST do IoT Platform é usada para configurar os metadados do local de um dispositivo estático. Isso pode ser feito no momento do registro do dispositivo ou posteriormente, se necessário. A inclusão de um registro de data e hora é opcional. Caso ele seja omitido, a data e hora atuais serão configuradas como os metadados de local do dispositivo.
zh_cn: 用户/应用程序使用 REST API 更新设备位置：IoT Platform REST API 用于设置静态设备的位置元数据。该操作可以在注册设备时完成，也可以稍后完成（如有必要）。可以选择是否包含时间戳记。如果省略，当前的日期和时间将设置为设备的位置元数据。

source: Location update triggered by device
it: Aggiornamento dell'ubicazione attivato da un dispositivo
pt_br: A atualização de localização é acionada pelo dispositivo
zh_cn: 设备触发的位置更新

source: Devices that can determine their location can choose to notify the IoT Platform device management server about location changes.
it: I dispositivi che possono determinare la loro ubicazione possono scegliere di notificare al server di gestione dispositivo IoT Platform le modifiche dell'ubicazione.
pt_br: Dispositivos que podem determinar seu local podem optar por notificar o servidor de gerenciamento de dispositivo do IoT Platform sobre as mudanças de local.
zh_cn: 能确定自身位置的设备可以选择将位置变更信息通知给 IoT Platform 设备管理服务器。

source: Location update triggered by user or app
it: Aggiornamento dell'ubicazione attivato da un utente o da un'app
pt_br: A atualização de localização é acionada por um usuário ou aplicativo
zh_cn: 用户或应用程序触发的位置更新
