Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/index.po
Languages: it, pt_br, zh_cn

source: When a user or application updates the location of an active managed device the device retrieves an update message:
it: Quando un utente o un'applicazione aggiorna l'ubicazione di un dispositivo gestito attivo, il dispositivo richiama un messaggio di aggiornamento:
pt_br: Quando um usuário ou aplicativo atualiza o local de um dispositivo gerenciado ativo, o dispositivo recupera uma mensagem de atualização:
zh_cn: 在用户或应用程序更新活动的受管设备的位置时，设备检索更新消息：

source: The server publishes this request to the following topic:
it: Il server pubblica tale richiesta sul seguente argomento:
pt_br: O servidor publica essa solicitação ao tópico a seguir:
zh_cn: 服务器将此请求发布到以下主题：

source: The "measuredDateTime" is the date of location measurement. The "updatedDateTime" is the date of the update to the device information. For efficiency reasons, the IoT Platform may batch updates to location information so the updates may be slightly delayed. The "latitude" and "longitude" should be specified in decimal degrees using WGS84.
it: "measuredDateTime" è la data della misurazione dell'ubicazione. "updatedDateTime" è la data dell'aggiornamento alle informazioni dispositivo. Per motivi di efficienza, IoT Platform può aggiornare in batch le informazioni relative all'ubicazione pertanto gli aggiornamenti potrebbero essere leggermente ritardati. "latitude" e "longitude" devono essere specificate in gradi decimali utilizzando WGS84.
pt_br: "measuredDateTime" é a data da medida de local. "updatedDateTime" é a data da atualização feita nas informações do dispositivo. Por motivos de eficiência, o IoT Platform pode fazer atualizações em lote nas informações de local, portanto, as atualizações podem ficar ligeiramente atrasadas. A "latitude" e a "longitude" devem ser especificadas em graus decimais, usando WGS84.
zh_cn: “measuredDateTime”是位置的测量日期。“updatedDateTime”是设备信息的更新日期。出于效率原因，IoT Platform 可能会成批更新位置信息，因此更新可能会稍有延迟。应使用 WGS84 指定“纬度”和“经度”（以十进制度为单位）。

source: Whenever location is updated, the values provided for latitude, longitude, elevation and uncertainty are considered as a single multi-value update. The latitude and longitude are mandatory and must both be provided with each update. Elevation and uncertainty are optional and can be omitted.
it: Ogniqualvolta che l'ubicazione viene aggiornata, i valori forniti per latitudine, longitudine, altitudine e incertezza sono considerati come un unico aggiornamento multivalore. La latitudine e la longitudine sono obbligatorie e devono essere entrambe fornite con ogni aggiornamento. L'altitudine e l'incertezza sono facoltative e possono essere omesse.
pt_br: Sempre que o local for atualizado, os valores fornecidos para latitude, longitude, elevação e incerteza são considerados como uma única atualização multivalor. A latitude e a longitude são obrigatórias e ambas devem ser fornecidas com cada atualização. A elevação e a incerteza são opcionais e podem ser omitidas.
zh_cn: 无论何时更新位置，为纬度、经度、海拔高度和不确定性提供的值都会被视为单个多值更新。纬度和经度是必需项，每次更新时都必须提供这两项。海拔高度和不确定性是可选项，可以将其省略。

source: If an optional value is provided on an update and then omitted on a later update, the earlier value is deleted by the later update. Each update is considered as a complete multi-value set.
it: Se un valore facoltativo viene fornito su un aggiornamento e poi omesso in un aggiornamento successivo, il valore precedente viene cancellato dall'aggiornamento successivo. Ogni aggiornamento viene considerato come un insieme completo multivalore.
pt_br: Se um valor opcional for fornecido em uma atualização e, em seguida, omitido em uma atualização posterior, o valor anterior será excluído pela atualização posterior. Cada atualização é considerada como um conjunto multivalor completo.
zh_cn: 如果某次更新时提供了某个可选值，而某次后续更新时省略了该可选值，那么该后续更新将删除先前的值。每次更新都会被视为一个完整的多值集合。

source: Payload Format:
it: Formato payload:
pt_br: Formato de Carga Útil:
zh_cn: 有效内容格式：

source: Please note: there is no reqId as no response by device is required.
it: Nota: non esiste alcun reqId in quanto non è richiesta una risposta da parte del dispositivo.
pt_br: Observe: não há reqId como nenhuma resposta do dispositivo é necessária.
zh_cn: 请注意：不存在 reqId，因为设备无需响应。

source: Update Device Attributes
it: Aggiorna attributi dispositivo
pt_br: Atualizar Atributos de Dispositivo
zh_cn: 更新设备属性

source: The IoT Platform can send this request to a device to update values of one or more device attributes. Attributes that can be updated by the Rest API are location, metadata, device information and firmware.
it: IoT Platform può inviare questa richiesta ad un dispositivo per aggiornare i valori di uno o più attributi del dispositivo. Gli attributi che possono essere aggiornati dall'API Rest sono l'ubicazione, i metadati, le informazioni sul dispositivo e il firmware.
pt_br: O IoT Platform pode enviar essa solicitação para um dispositivo para atualizar valores de um ou mais atributos de dispositivo. Os atributos que podem ser atualizados pela API Rest são local, metadados, informações do dispositivo e firmware.
zh_cn: IoT Platform 可以向设备发送此请求，以更新一个或多个设备属性的值。REST API 可以更新的属性有位置、元数据、设备信息和固件。

source: The "value" is the new value of the device attribute. It is a complex field matching the device model. Only writeable fields should be updated as a result of this operation. Values can be updated in:
it: "value" è il nuovo valore dell'attributo del dispositivo. Si tratta di un campo complesso che corrisponde al modello del dispositivo. Solo i campi scrivibili devono essere aggiornati come risultato di questa operazione. I valori possono essere aggiornati in:
pt_br: "value" é o novo valor do atributo de dispositivo. Ele é um campo complexo que corresponde ao modelo de dispositivo. Apenas os campos graváveis devem ser atualizados como resultado desta operação. Os valores podem ser atualizados em:
zh_cn: “value”是设备属性的新值。这是一个与设备模型匹配的复杂字段。此操作只应更新可写入字段。可以更新以下属性的值：

source: location (see Update location section for details)
it: location (consultare la sezione Aggiorna ubicazione per i dettagli)
pt_br: location (consulte a seção Atualizar local para obter detalhes)
zh_cn: location（请参阅“更新位置”部分，以获取详细信息）

source: metadata (Optional)
it: metadata (Facoltativo)
pt_br: metadada (Opcional)
zh_cn: metadata（可选）

source: deviceInfo (Optional)
it: deviceInfo (Facoltativo)
pt_br: deviceInfo (Opcional)
zh_cn: deviceInfo（可选）

source: mgmt.firmware (see Firmware update process for details)
it: mgmt.firmware (vedere il processo di aggiornamento del firmware per i dettagli)
pt_br: mgmt.firmware (consulte Processo de atualização de firmware para obter detalhes)
zh_cn: mgmt.firmware（请参阅“固件更新”过程，以获取详细信息）

source: Message format
it: Formato messaggio
pt_br: Formato da mensagem
zh_cn: 消息格式

source: Add Error Code
it: Aggiungi codice errore
pt_br: Incluir Código de Erro
zh_cn: 添加错误代码

source: Devices can choose to notify the IoT Platform device management server about changes in their error status.
it: I dispositivi possono scegliere di notificare al server di gestione dispositivo IoT Platform le modifiche allo stato di errore.
pt_br: Os dispositivos podem optar por notificar o servidor de gerenciamento de dispositivo do IoT Platform sobre as mudanças em seus status de erro.
zh_cn: 设备可以选择向 IoT Platform 设备管理服务器通知错误状态的更改。

source: The "errorCode" is a current device error code that needs to be added to the IoT Platform.
it: "errorCode" è il codice di errore dispositivo corrente che è necessario aggiungere a IoT Platform.
pt_br: O "errorCode" é um código de erro de dispositivo atual que precisa ser incluído no IoT Platform.
zh_cn: “errorCode”是需要添加到 IoT Platform 的当前设备错误代码。

source: Clear Error Codes
it: Cancella codici di errore
pt_br: Limpar Códigos de Erro
zh_cn: 清除错误代码

source: Devices can request that the Internet of Things Foundation clear all of their error codes.
it: I dispositivi possono richiedere che Internet of Things Foundation cancelli tutti i codici di errore.
pt_br: Os dispositivos podem solicitar que o Internet of Things Foundation limpe todos os seus códigos de erro.
zh_cn: 设备可以请求 Internet of Things Foundation 清除其所有错误代码。

source: Add Log
it: Aggiungi log
pt_br: Incluir Log
zh_cn: 添加日志

source: Devices can choose to notify IoTF device management support about changes a new log entry. Log entry includes a log messages, its timestamp and severity, as well as an optional base64-encoded binary diagnostic data.
it: I dispositivi possono scegliere di notificare al supporto di gestione dispositivo IoTF le modifiche a una nuova voce di log. La voce log include messaggi di log, la sua registrazione data/ora e gravità, nonché dati di diagnostica binari codificati base64 facoltativi.
pt_br: Os dispositivos podem optar por notificar o suporte de gerenciamento de dispositivo do IoTF sobre mudanças ocorridas em uma nova entrada de log. A entrada de log inclui mensagens de log, seus registros de data e hora e de gravidade, bem como dados diagnósticos binários opcionais codificados em base64.
zh_cn: 设备可以选择向 IoTF 设备管理支持人员通知新日志条目的更改。日志条目包括日志消息、消息的时间戳记和严重性，以及采用 base64 编码的二进制诊断数据（可选）。

source: "message" is a diagnostic message that needs to be added to IoTF. "timestamp" is a date and time of the log entry in ISO8601 format. "data" is an optional base64-encoded diagnostic data. "severity" is a severity of the message (0: informational, 1: warning, 2: error).
it: "message" è un messaggio diagnostico che deve essere aggiunto a IoTF. "timestamp" è la data/ora della voce log nel formato ISO8601. "data" corrisponde a dati di diagnostica codificati base64 facoltativi. "severity" è la severità del messaggio (0: informativo, 1: avvertenza, 2: errore).
pt_br: "message" é uma mensagem de diagnóstico que precisa ser incluída no IoTF. "timestamp" é uma data e hora da entrada de log em formato ISO8601. "data" são dados diagnósticos opcionais codificados em base64. "severity" é a gravidade da mensagem (0: informativa, 1: aviso, 2: erro).
zh_cn: “message”是需要添加到 IoTF 中的诊断消息。“timestamp”是日志条目的日期和时间（ISO8601 格式）。“data”是采用 base64 编码的诊断数据（可选）。“severity”是消息的严重性（0：参考，1：警告，2：错误）。

source: Clear Logs
it: Cancella log
pt_br: Limpar Logs
zh_cn: 清除日志

source: Devices can request that the Internet of Things Foundation clear all of their log entries.
it: I dispositivi possono richiedere che Internet of Things Foundation cancelli tutte le voci di log.
pt_br: Os dispositivos podem solicitar que o Internet of Things Foundation limpe todas as suas entradas de log.
zh_cn: 设备可以请求 Internet of Things Foundation 清除其所有日志条目。

source: Observe Attribute Changes
it: Osserva modifiche attributo
pt_br: Observar Mudanças de Atributo
zh_cn: 观察属性更改

source: The IoT Platform can send this request to a device to observe changes of one or more device attributes. When the device receives this request, it must send a notification request ("notify" message) to the IoT Platform whenever the observed attributes value changes.
it: IoT Platform può inviare questa richiesta ad un dispositivo per osservare le modifiche di uno o più attributi del dispositivo. Quando il dispositivo riceve questa richiesta, deve inviare una richiesta di notifica (messaggio "notify") a IoT Platform ogni volta che cambia il valore degli attributi osservati.
pt_br: O IoT Platform pode enviar essa solicitação para um dispositivo para observar as mudanças de um ou mais atributos de dispositivo. Ao receber essa solicitação, o dispositivo deve enviar uma solicitação de notificação (mensagem "notify") para o IoT Platform sempre que houver mudanças nos valores dos atributos observados.
zh_cn: IoT Platform 可以向设备发送此请求，以观察一个或多个设备属性的更改。如果设备收到此请求，那么在所观察的属性值发生更改时，必须向 IoT Platform 发送通知请求（“通知”消息）。

source: Devices must implement observe, notify & cancel operations in order to support :ref:`firmware-actions-update`.
it: I dispositivi devono implementare le operazioni di osservazione, notifica e annullamento per poter supportare :ref:`firmware-actions-update`.
pt_br: Os dispositivos devem implementar operações de observação, notificação e cancelamento para que possam suportar :ref:`firmware-actions-update`.
zh_cn: 设备必须实施“观察”、“通知”和“取消”操作，才能支持 :ref:`firmware-actions-update`。

source: The "fields" field is an array of the device attribute names from the device model. For example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state". If a complex field, such as "mgmt.firmware" is specified, it is expected that its underlying fields are updated at the same time, such that only a single notify message is generated.
it: Il campo "fields" è una schiera di nomi attributo dispositivo dal modello dispositivo. Ad esempio, i valori possono essere "location", "mgmt.firmware" o "mgmt.firmware.state". Se un campo complesso, ad esempio "mgmt.firmware", è specificato, è previsto che i campi sottostanti vengono aggiornati contemporaneamente, in modo tale che venga generato un solo messaggio di notifica.
pt_br: O campo "fields" é uma matriz dos nomes de atributos de dispositivo do modelo de dispositivo. Por exemplo, os valores podem ser "location", "mgmt.firmware" ou "mgmt.firmware.state". Caso um campo complexo, como "mgmt.firmware" seja especificado, espera-se que seus campos subjacentes sejam atualizados ao mesmo tempo, de forma que seja gerada apenas uma única mensagem de notificação.
zh_cn: “fields”字段是一个数组，其中包含来自设备模型的设备属性名称。例如，值可以是“location”、“mgmt.firmware”或“mgmt.firmware.state”。如果指定了复杂字段（如“mgmt.firmware”），那么需要同时更新其下层字段，这样就只会生成一条通知消息。

source: The "message" field used in the response can be specified if "rc" is not 200. If any field value which was to be observed could not be retrieved, "rc" should be set to 404 (if not found) or 500 (any other reason). When values for fields to be observed cannot be found, "fields" should contain an array of elements with "field" set to the name of each field that could not be read, "value" fields should be omitted. For the response code to be set to 200, both "field" and "value" must be specified, "value" is the current value of an attribute identified by "field" content.
it: Il campo "message" utilizzato nella risposta può essere specificato se l'"rc" non è 200. Se il valore di un campo che doveva essere osservato non può essere richiamato, l'"rc" deve essere impostato su 404 (se non trovato) o 500 (qualsiasi altra ragione). Quando non vengono trovati i valori per i campi da osservare, "fields" deve contenere una schiera di elementi con "field" impostato sul nome di ciascun campo che non può essere letto, i campi "value" devono essere omessi. Per il codice di risposta che deve essere impostato su 200, devono essere specificati sia "field" che "value", "value" è il valore corrente di un attributo identificato dal contenuto di "field".
pt_br: O campo "message" usado na resposta pode ser especificado se "rc" não for 200. Caso qualquer valor de campo que deveria ser observado não possa ser recuperado, "rc" deve ser configurado como 404 (se não localizado) ou 500 (qualquer outro motivo). Quando não for possível localizar os valores para campos que devem ser observados, "fields" deve conter uma matriz de elementos com "field" configurado com o nome de cada campo que não pôde ser lido e os campos "value" devem ser omitidos. Para que o código de resposta seja configurado como 200, "field" e "value" devem ser especificados e "value" é o valor atual de um atributo identificado pelo conteúdo de "field".
zh_cn: 如果“rc”不为 200，那么可以指定响应中的“message”字段。如果检索不到先前观察的任何字段值，那么“rc”应设置为 404（找不到）或 500（任何其他原因）。如果找不到要观察的字段值，那么“fields”中应包含元素数组，其中“field”分别设置为各个无法读取的字段的名称，并且应忽略“value”字段。要将响应代码设置为 200，必须同时指定“field”和“value”，“value”是由“field”内容标识的属性的当前值。

source: Cancel Attribute Observation
it: Annulla osservazione attributo
pt_br: Cancelar Observação de Atributo
zh_cn: 取消属性观察

source: The IoT Platform can send this request to a device to cancel the current observation of one or more device attributes. The "fields" is an array of the device attribute names from the device model, for example, values could be "location", "mgmt.firmware" or "mgmt.firmware.state".
it: IoT Platform può inviare questa richiesta ad un dispositivo per annullare l'osservazione corrente di uno o più attributi del dispositivo. "fields" è una schiera di nomi attributo dispositivo dal modello dispositivo, ad esempio, i valori possono essere "location", "mgmt.firmware" o "mgmt.firmware.state".
pt_br: O IoT Platform pode enviar essa solicitação para um dispositivo para cancelar a observação atual de um ou mais atributos de dispositivo. "fields" é uma matriz dos nomes de atributos do dispositivo do modelo de dispositivo, por exemplo, os valores podem ser "location", "mgmt.firmware" ou "mgmt.firmware.state".
zh_cn: IoT Platform 可以向设备发送此请求，以取消当前对一个或多个设备属性的观察。“fields”是一个数组，其中包含来自设备模型的设备属性名称，例如，值可以是“ location”、“mgmt.firmware”或“mgmt.firmware.state”。

source: The "message" field must be specified if "rc" is not 200.
it: Il campo "message" deve essere specificato se l'"rc" non è 200.
pt_br: O campo "message" deve ser especificado se "rc" não for 200.
zh_cn: 如果“rc”不为 200，那么必须指定“message”字段。

source: Notify Attribute Changes
it: Notifica modifiche attributo
pt_br: Notificar sobre Mudanças no Atributo
zh_cn: 通知属性更改

source: The IoT Platform can make an observation request referring to a specific attribute or set of values. When the value of the attribute or attributes changes, the device must send a notification containing the latest value.
it: IoT Platform può eseguire una richiesta di osservazione che faccia riferimento ad un attributo specifico o ad una serie di valori. Quando il valore dell'attributo o degli attributi cambia, il dispositivo deve inviare una notifica contenente il valore più recente.
pt_br: O IoT Platform pode fazer uma solicitação de observação que se refere a um atributo ou conjunto de valores específico. Quando houver mudanças no valor do atributo ou dos atributos, o dispositivo deve enviar uma notificação contendo o valor mais recente.
zh_cn: IoT Platform 可以发出观察请求（其中引用了特定属性或值集）。当一个或多个属性的值发生更改时，设备必须发送包含最新值的通知。

source: The "field_name" value is the name of the attribute that has changed, the "field_value" is the current value of the attribute. The attribute can be a complex field, if multiple values in a complex field are updated as a result of a single operation, only a single notification message should be sent.
it: Il valore "field_name" è il nome dell'attributo che è stato modificato, "field_value" è il valore corrente dell'attributo. L'attributo può essere un campo complesso, se vengono aggiornati più valori in un campo complesso come risultato di una singola operazione, deve essere inviato un solo messaggio di notifica.
pt_br: O valor de "field_name" é o nome do atributo que mudou, o "field_value" é o valor atual do atributo. O atributo pode ser um campo complexo, caso vários valores em um campo complexo sejam atualizados como resultado de uma única operação, apenas uma única mensagem de notificação deve ser enviada.
zh_cn: “field_name”值是已更改属性的名称，“field_value”是此属性的当前值。此属性可以是复杂字段，如果复杂字段中的多个值因为一个操作而发生更新，那么只应发送一条通知消息。

source: If notify request is processed successfully, "rc" should be set to 200. If the request is not correct, "rc" should be set to 400. If the field specified in the notify request is not being observed, "rc" should be set to 404.
it: Se la richiesta di notifica viene elaborata correttamente, l'"rc" deve essere impostato su 200. Se la richiesta non è corretta, l'"rc" deve essere impostato su 400. Se il campo specificato nella richiesta di notifica non viene osservato, l'"rc" deve essere impostato su 404.
pt_br: Se a solicitação de notificação for processada com êxito, "rc" deve ser configurado como 200. Se a solicitação não estiver correta, "rc" deve ser configurado como 400. Se o campo especificado na solicitação de notificação não estiver sendo observado, "rc" deve ser configurado como 404.
zh_cn: 如果成功处理了通知请求，那么“rc”应设置为 200。如果请求不正确，那么“rc”应设置为 400。如果未在观察该通知请求中指定的字段，那么“rc”应设置为 404。

source: 404: The topic name is incorrect, the device is not in the database, or there is no observation for the field reported.
it: 404: Il nome dell'argomento non è corretto, il dispositivo non si trova nel database oppure non ci sono osservazioni per il campo riportato.
pt_br: 404: O nome do tópico está incorreto, o dispositivo não está no banco de dados ou não há observações para o campo relatado.
zh_cn: 404：主题名称不正确，或者此设备不在数据库中，或者未报告此字段的观察。

source: 500: An internal error occurred, contact IBM Support.
it: 500: Si è verificato un errore interno, contattare il supporto IBM.
pt_br: 500: Ocorreu um erro interno, entre em contato com o suporte IBM.
zh_cn: 500：发生内部错误，请联系 IBM 支持人员。
