Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/requests.po
Languages: de, it, ja, pt_br

source: The firmware update action is initiated using the REST API by issuing a POST request to:
de: Die Firmwareaktion 'Update' wird über die REST-API initiiert, indem eine POST-Anforderung an die folgende Adresse abgesetzt wird:
it: L'azione di aggiornamento del firmware viene avviata utilizzando l'API REST emettendo una richiesta POST a :
ja: ファームウェア更新操作を REST API を使用して開始するには、以下に対して POST リクエストを発行します。
pt_br: A ação de atualização de firmware é iniciada usando a API REST emitindo uma solicitação POST para:

source: The information which should be provided is:
de: Folgende Informationen müssen bereitgestellt werden:
it: Le informazioni che dovrebbero essere fornite sono:
ja: 指定する必要のある情報は次のとおりです。
pt_br: As informações a serem fornecidas são:

source: The action ``firmware/update``
de: Die Aktion ``firmware/update``
it: L'azione ``firmware/update``
ja: ``firmware/update`` アクション
pt_br: A ação ``firmware/update``

source: The list of devices to receive the image, all of the same device type.
de: Die Liste der Geräte, die das Image empfangen sollen (alle müssen denselben Gerätetyp aufweisen).
it: L'elenco di dispositivi per ricevere l'immagine, tutti dello stesso tipo di dispositivo.
ja: イメージを受け取るデバイスのリスト (すべて同じデバイス・タイプ)
pt_br: A lista de dispositivos que receberão a imagem, todos do mesmo tipo de dispositivo.

source: Optional The URI for the firmware image
de: Optional - die URI für das Firmware-Image
it: Facoltativo - L'URI per l'immagine del firmware
ja: オプション: ファームウェア・イメージの URI
pt_br: Opcional: o URI para a imagem de firmware

source: Here is an example request:
de: Beispielanforderung:
it: Di seguito viene riportato un esempio della richiesta:
ja: リクエストの例を以下に示します。
pt_br: A seguir uma solicitação de exemplo:

source: If any of the optional parameters are specified in the request, then the device management server will send a firmware details update to the device. The firmware details update request is sent on topic ``iotdm-1/device/update``.
de: Wenn in der Anforderung optionale Parameter angegeben werden, sendet der Geräte-Management-Server eine Aktualisierung der Firmwaredetails an das Gerät. Die Aktualisierungsanforderung für die Firmwaredetails wird an das Topic ``iotdm-1/device/update`` gesendet.
it: Gli eventuali parametri facoltativi vengono specificati nella richiesta, quindi il server di gestione dei dispositivi invierà un aggiornamento dei dettagli del firmware al dispositivo. La richiesta di aggiornamento dei dettagli del firmware viene inviata nell'argomento ``iotdm-1/device/update``.
ja: オプション・パラメーターがリクエストに指定されている場合、デバイス管理サーバーはファームウェア詳細の更新をデバイスに送ります。ファームウェア詳細の更新リクエストは、トピック ``iotdm-1/device/update`` で送信されます。
pt_br: Se qualquer um dos parâmetros opcionais for especificado na solicitação, o servidor de gerenciamento de dispositivo enviará uma atualização de detalhes de firmware para o dispositivo. A solicitação de atualização de detalhes do firmware é enviada no tópico ``iotdm-1/device/update``.

source: This request lets the device validate if the requested firmware differs from the currently installed firmware. If there is a difference, set ``rc`` to ``204``, which translates to the status ``Changed``. The following example shows which message is to be expected for the previously sent example firmware update request and what response should be sent, when a difference is detected:
de: Diese Anforderung ermöglicht die Validierung des Geräts, falls die angeforderte Firmware von der zurzeit installierten Firmware abweicht. Bei einer Abweichung 204 als Rückgabecode festlegen, dies entspricht dem Status ``Geändert``. Das folgende Beispiel zeigt, welche Nachricht für die zuvor gesendete Beispielanforderung für das Firmware-Update zu erwarten ist und welche Antwort gesendet werden soll, wenn eine Abweichung festgestellt wird:
it: Questa richiesta consente al dispositivo di verificare se il firmware richiesto è differente dal firmware attualmente installato. Se esiste una differenza, impostare ``rc`` su ``204``, che corrisponde allo stato ``Modificato``. Il seguente esempio riporta il messaggio previsto per la richiesta di aggiornamento del firmware di esempio inviata in precedenza e quale risposta dovrebbe essere inviata quando viene rilevata una differenza:
ja: このリクエストにより、要求されたファームウェアが現在インストールされているファームウェアと異なるかどうか、デバイスが検証します。相違がある場合は、``rc`` を ``204`` に設定します。これは ``変更済み`` 状況ということです。先ほど送信したファームウェア更新リクエストの例の場合にどのメッセージが予期されるか、また、相違が検出された場合にどのような応答を送信する必要があるかを、以下の例で示します。
pt_br: Essa solicitação permite a validação do dispositivo, se o firmware solicitado diferir do firmware atualmente instalado. Se houver uma diferença, configure ``rc ` ` como ``204``, que é convertido para os status ` Alterado`. O exemplo a seguir mostra qual mensagem deve ser esperada para a solicitação de atualização do firmware de exemplo enviada anteriormente e qual resposta deve ser enviada, quando uma diferença for detectada:

source: In order to monitor the status of the firmware update the IoT Platform sends an observe request on the topic ``iotdm-1/observe``. When the device is ready to start the update process it sends a response with ``rc`` set to ``200``, ``mgmt.firmware.state`` set to ``0`` and ``mgmt.firmware.updateStatus`` set to ``0``.
de: Zur Überwachung des Status des Firmware-Updates sendet IoT Platform eine Beobachtungsanfrage für das Topic ``iotdm-1/observe``. Wenn das Gerät zum Starten des Aktualisierungsprozesses bereit ist, sendet es eine Antwort mit dem Rückgabecode 200, dem Wert 0 für ``mgmt.firmware.state`` und dem Wert 0 für ``mgmt.firmware.updateStatus``.
it: Per monitorare lo stato dell'aggiornamento del firmware IoT Platform invia una richiesta di osservazione nell'argomento ``iotdm-1/observe``. Quando il dispositivo è pronto ad avviare il processo di aggiornamento invia una risposta con ``rc`` impostato su ``200``, ``mgmt.firmware.state`` impostato su ``0`` e ``mgmt.firmware.updateStatus`` impostato su ``0``.
ja: ファームウェア更新の状況をモニターするために、IoT Platform がトピック ``iotdm-1/observe`` で監視リクエストを送信します。更新処理を開始する準備ができると、デバイスは、``rc`` を ``200`` に、``mgmt.firmware.state`` を ``0`` に、``mgmt.firmware.updateStatus`` を ``0`` に設定した応答を送信します。
pt_br: Para monitorar o status da atualização do firmware, o IoT Platform envia uma solicitação de observação no tópico ``iotdm-1/observe``. Quando o dispositivo está pronto para iniciar o processo de atualização, ele envia uma resposta com ``rc`` configurado como ` `200``, ``mgmt.firmware.state`` configurado como ``0`` e ``mgmt.firmware.updateStatus`` configurado como ``0``.

source: Here is an example:
de: Beispiel:
it: Di seguito viene riportato un esempio:
ja: 以下に例を示します。
pt_br: Segue um exemplo:

source: Afterwards the device management server in the IoT Platform uses the device management protocol to request that the devices specified initiate the firmware installation by publishing using the topic ``iotdm-1/mgmt/initiate/firmware/update``. If this operation can be initiated immediately, ``rc`` should be set to ``202``. If firmware was not previously downloaded successfully, ``rc`` should be set to ``400``.
de: Anschließend verwendet der Geräte-Management-Server von IoT Platform das Gerätemanagementprotokoll zum Senden einer Anforderung an die Geräte, die das Installieren der Firmware auf den angegebenen Geräten durch Publizieren des Topics ``iotdm-1/mgmt/initiate/firmware/update`` einleitet. Wenn diese Operation sofort eingeleitet werden kann, muss für ``rc`` der Wert ``202`` eingestellt werden. Wenn die Firmware vorher nicht erfolgreich heruntergeladen wurde, muss für ``rc`` der Wert ``400`` eingestellt werden.
it: Successivamente, il server di gestione dispositivo in IoT Platform utilizza il protocollo di gestione dispositivo per richiedere che i dispositivi specificati inizino l'installazione del firmware mediante la pubblicazione utilizzando l'argomento ``iotdm-1/mgmt/initiate/firmware/update``. Se l'operazione può essere avviata immediatamente, l'``rc`` deve essere impostato su ``202``. Se il firmware non è stato precedentemente scaricato correttamente, ``rc`` deve essere impostato su ``400``.
ja: その後、IoT Platform のデバイス管理サーバーが、デバイス管理プロトコルを使用してトピック ``iotdm-1/mgmt/initiate/firmware/update`` でパブリッシュすることで、指定したデバイスでファームウェア・インストールを開始するように要求します。この操作をただちに開始できる場合は、``rc`` を ``202`` に設定します。以前にファームウェアが正常にダウンロードされなかった場合は、``rc`` を ``400`` に設定します。
pt_br: Posteriormente, o servidor de gerenciamento de dispositivo no IoT Platform usa o protocolo de gerenciamento de dispositivo para solicitar que os dispositivos especificados iniciem a instalação do firmware por meio de publicação, usando o tópico ``iotdm-1/mgmt/initiate/firmware/update``. Se esta operação pode ser iniciada imediatamente, configure o ``rc`` como ``202``. Caso o firmware não tenha sido transferido por download com êxito anteriormente, ``rc`` deve ser configurado como ``400``.

source: In order to finish the firmware update request the device has to report its update status to the IoT Platform via a status message published on its ``iotdevice-1/notify``-topic. Once firmware update is completed, ``mgmt.firmware.updateStatus`` should be set to ``0`` (``Success``), ``mgmt.firmware.state`` should be set to ``0`` (``Idle``), downloaded firmware image can be deleted from the device and ``deviceInfo.fwVersion`` should be set to the value of ``mgmt.firmware.version``.
de: Damit die Anforderung für das Firmware-Update fertiggestellt werden kann, muss das Gerät den Aktualisierungsstatus über eine Statusnachricht, die für das Topic ``iotdevice-1/notify`` publiziert wird, an IoT Platform melden. Sobald das Firmware-Update abgeschlossen ist, muss für ``mgmt.firmware.updateStatus`` der Wert ``0`` (``Erfolgreich``) und für ``mgmt.firmware.state`` der Wert ``0`` (``Inaktiv``) festgelegt werden, das heruntergeladene Firmware-Image kann vom Gerät gelöscht werden und für ``deviceInfo.fwVersion`` muss der Wert von ``mgmt.firmware.version`` festgelegt werden.
it: Per terminare la richiesta di aggiornamento del firmware il dispositivo deve riportare lo stato di aggiornamento a IoT Platform mediante un messaggio di stato pubblicato sul relativo argomento``iotdevice-1/notify``. Una volta completato l'aggiornamento del firmware, ``mgmt.firmware.updateStatus`` deve essere impostato su ``0`` (``Riuscito``), ``mgmt.firmware.state`` deve essere impostato su ``0`` (``Inattivo``), l'immagine del firmware scaricata può essere eliminata dal dispositivo e ``deviceInfo.fwVersion`` deve essere impostato sul valore di ``mgmt.firmware.version``.
ja: ファームウェア更新リクエストを完了するために、デバイスは、``iotdevice-1/notify`` トピックにパブリッシュした状況メッセージを介して更新状況を IoT Platform に報告する必要があります。ファームウェア更新が完了したら、``mgmt.firmware.updateStatus`` を ``0`` (``成功``) に設定し、``mgmt.firmware.state`` を ``0`` (``アイドル状態``) に設定する必要があります。ダウンロード済みファームウェア・イメージはデバイスから削除できるようになります。``deviceInfo.fwVersion`` には ``mgmt.firmware.version`` の値を設定する必要があります。
pt_br: Para concluir a solicitação de atualização do firmware, o dispositivo precisa relatar seu status de atualização para o IoT Platform por meio de uma mensagem de status publicada em seu tópico ``iotdevice-1/notify``-. Após a conclusão da atualização do firmware, o ``mgmt.firmware.updateStatus`` deve ser configurado como ``0`` (``Sucesso``), ``mgmt.firmware.state`` deve ser configurado como ``0`` (``Inativo``), a imagem do firmware transferido pode ser excluída do dispositivo e ``deviceInfo.fwVersion`` deve ser configurado como o valor do ``mgmt.firmware.version``.

source: Here is an example notify message:
de: Beispiel für eine Hinweisnachricht:
it: Di seguito è riportato un messaggio di notifica di esempio:
ja: 以下に、通知メッセージの例を示します。
pt_br: Aqui está uma mensagem de notificação de exemplo:

source: After the IoT Platform received the notify of a completed firmware update it will trigger a last request on the ``iotdm-1/cancel``-topic for cancelation of the observation of the ``mgmt.firmware``-field. After a response with ``rc`` set to ``200`` was sent the firmware update request is completed. Example:
de: Nachdem IoT Platform die Benachrichtigung über ein abgeschlossenes Firmware-Update empfangen hat, wird eine abschließende Anforderung für das Topic ``iotdm-1/cancel`` ausgelöst, um die Beobachtung des Felds ``mgmt.firmware`` abzubrechen. Nach dem Senden einer Antwort mit dem Rückgabecode 200 ist die Anforderung des Firmware-Updates abgeschlossen. Beispiel:
it: Una volta che IoT Platform ha ricevuto la notifica del completamento di un aggiornamento del firmware, attiverà un'ultima richiesta nell'argomento ``iotdm-1/cancel`` per l'annullamento dell'osservazione del campo ``mgmt.firmware``. Una volta inviata una risposta con ``rc`` impostato su ``200``, l'aggiornamento del firmware è completo. Esempio:
ja: IoT Platform は、ファームウェア更新完了の通知を受け取った後、``mgmt.firmware`` フィールドの監視をキャンセルするために、``iotdm-1/cancel`` トピックで最後のリクエストをトリガーします。``rc`` が ``200`` に設定される応答が送信されると、ファームウェア更新リクエストが完了します。以下に例を示します。
pt_br: Após o IoT Platform ter recebido a notificação de uma atualização de firmware concluída, ele acionará uma última solicitação no tópico ``iotdm-1/cancel``- para cancelamento da observação do campo ``mgmt.firmware``-. Depois de uma resposta com o ``rc`` configurado como ``200`` foi enviada a solicitação de atualização de firmware é concluída. Exemplo:

source: Useful information regarding error and process handling:
de: Nützliche Informationen zur Fehler- und Prozessbehandlung:
it: Informazioni utili sulla gestione del processo e degli errori:
ja: エラーおよびプロセスの処理に関する有用な情報:
pt_br: Informações úteis sobre erros e manipulação do processo:

source: If firmware update attempt fails, ``rc`` should be set to ``500`` and the ``message`` field can optionally be set to contain relevant information.
de: Wenn der Firmware-Update-Versuch fehlschlägt, muss für ``rc`` der Wert ``500`` eingestellt werden, und das Feld ``message`` kann optional relevante Informationen enthalten.
it: Se il tentativo di aggiornamento del firmware non riesce, ``rc `` deve essere impostato su ``500`` e il campo ``message`` può essere facoltativamente impostato per contenere informazioni pertinenti.
ja: ファームウェア更新の試行に失敗した場合は、``rc`` を ``500`` に設定し、オプションで ``message`` フィールドに関連情報を含めることができます。
pt_br: Se a tentativa de atualização do firmware falhar, ``rc`` deve ser configurado como ``500`` e o campo ``message`` pode ser, opcionalmente, configurado para conter informações relevantes.

source: If firmware update is not supported ``rc`` should be set to ``501`` and the ``message`` field can optionally be set to contain relevant information.
de: Wenn das Firmware-Update nicht unterstützt wird, muss für ``rc`` der Wert ``501`` eingestellt werden, und das Feld ``message`` kann optional relevante Informationen enthalten.
it: Se l'aggiornamento del firmware non è supportato, ``rc `` deve essere impostato su ``501`` e il campo ``message`` può essere facoltativamente impostato per contenere informazioni pertinenti.
ja: ファームウェア更新がサポートされない場合は、``rc`` を ``501`` に設定し、オプションで ``message`` フィールドに関連情報を含めることができます。
pt_br: Caso a atualização de firmware não seja suportada, ``rc`` deve ser configurado como ``501`` e o campo ``message`` pode ser, opcionalmente, configurado para conter informações relevantes.

source: If ``mgmt.firmware.state`` is not ``2`` (Downloaded), an error should be reported with ``rc`` set to ``400`` and an optional message text.
de: Wenn ``mgmt.firmware.state`` nicht ``2`` ist (Heruntergeladen), sollten ein Fehler mit dem Antwortcode ``400`` für ``rc`` und ein optionaler Nachrichtentext gemeldet werden.
it: Se ``mgmt.firmware.state`` non è ``2`` (Scaricato), deve essere riportato un errore con ``rc`` impostato su ``400`` e un messaggio di testo facoltativo.
ja: ``mgmt.firmware.state`` が ``2`` (ダウンロード済み) でない場合は、``400`` に設定した ``rc`` と、オプションのメッセージ・テキストを使用してエラーを報告する必要があります。
pt_br: Se ``mgmt.firmware.state`` não for ``2`` (Transferido por Download), um erro deve ser relatado com ``rc`` configurado como ``400`` e um texto de mensagem opcional.

source: Otherwise, ``mgmt.firmware.updateStatus`` should be set to ``1`` (In Progress) and firmware installation should start.
de: Andernfalls muss für ``mgmt.firmware.updateStatus`` der Wert ``1`` (In Bearbeitung) eingestellt sein und die Installation der Firmware starten.
it: In caso contrario, ``mgmt.firmware.updateStatus`` deve essere impostato su ``1`` (In corso) e l'installazione del firmware dovrebbe iniziare.
ja: それ以外の場合は、``mgmt.firmware.updateStatus`` を ``1`` (進行中) に設定してファームウェア・インストールを開始します。
pt_br: Caso contrário, ``mgmt.firmware.updateStatus`` deve ser configurado como ``1`` (Em Andamento) e a instalação de firmware deve iniciar.

source: If firmware installation fails, ``mgmt.firmware.updateStatus`` should be set to either:
de: Wenn die Installation der Firmware fehlschlägt, muss für ``mgmt.firmware.updateStatus`` einer der folgenden Werte eingestellt sein:
it: Se l'installazione del firmware non riesce, ``mgmt.firmware.updateStatus`` deve essere impostato su:
ja: ファームウェア・インストールが失敗した場合、``mgmt.firmware.updateStatus`` を以下のいずれかに設定します。
pt_br: Se a instalação de firmware falhar, ``mgmt.firmware.updateStatus`` deve ser configurado como:

source: ``2`` (Out of Memory)
de: ``2`` (Speicherkapazität erschöpft)
it: ``2`` (Memoria insufficiente)
ja: ``2`` (メモリー不足)
pt_br: ``2`` (Falta de Memória)

source: ``5`` (Unsupported Image)
de: ``5`` (Nicht unterstütztes Image)
it: ``5`` (Immagine non supportata)
ja: ``5`` (サポートされないイメージ)
pt_br: ``5`` (Imagem não Suportada)

source: All fields under ``mgmt.firmware`` must be set at the same time, so that if there is a current observation for ``mgmt.firmware``, only a single notify message is sent.
de: Alle Felder unter ``mgmt.firmware`` müssen gleichzeitig eingestellt sein, sodass bei einer aktuellen Beobachtung für ``mgmt.firmware`` nur eine einzige Hinweisnachricht gesendet wird.
it: Tutti i campi in ``mgmt.firmware`` devono essere impostati contemporaneamente, così se esiste una osservazione corrente per ``mgmt.firmware``, viene inviato un solo messaggio di notifica.
ja: ``mgmt.firmware`` の監視が現在行われている場合に、ただ 1 つの通知メッセージが送信されるようにするには、``mgmt.firmware`` の下のすべてのフィールドが同時に設定されなければなりません。
pt_br: Todos os campos em ``mgmt.firmware`` devem ser configurados ao mesmo tempo, para que, se houver uma observação atual para ``mgmt.firmware``, apenas uma única mensagem de notificação seja enviada.
