Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/requests.po
Languages: de, it, ja, pt_br

source: Out of Memory
de: Speicherkapazität erschöpft
it: Memoria insufficiente
ja: メモリー不足
pt_br: Falta de Memória

source: An out of memory condition has been detected during the operation.
de: Während dieser Operation wurde eine abnormale Speicherbedingung festgestellt.
it: Una condizione di memoria insufficiente è stata rilevata durante l'operazione.
ja: 操作中にメモリー不足状態が検出されました。
pt_br: Foi detectada uma condição de falta de memória durante a operação.

source: Connection Lost
de: Verbindung unterbrochen
it: Connessione persa
ja: 接続が失われた
pt_br: Perda de Conexão

source: The connection was lost during the firmware download
de: Die Verbindung wurde während des Herunterladens der Firmware unterbrochen.
it: La connessione è stata persa durante lo scaricamento del firmware
ja: ファームウェア・ダウンロード中に接続が失われました
pt_br: A conexão foi perdida durante o download do firmware

source: Verification Failed
de: Überprüfung fehlgeschlagen
it: Verifica non riuscita
ja: 検証に失敗
pt_br: Falha na Verificação

source: The firmware did not pass verification
de: Die Überprüfung der Firmware ist fehlgeschlagen.
it: Il firmware non ha superato la verifica
ja: ファームウェアの検証が失敗しました
pt_br: O firmware não foi aprovado na verificação

source: Unsupported Image
de: Nicht unterstütztes Image
it: Immagine non supportata
ja: サポートされないイメージ
pt_br: Imagem não Suportada

source: The downloaded firmware image is not supported by the device
de: Das heruntergeladene Firmware-Image wird von dem Gerät nicht unterstützt.
it: L'immagine del firmware scaricata non è supportata dal dispositivo
ja: ダウンロードされたファームウェア・イメージはデバイスでサポートされていません
pt_br: A imagem de firmware transferida por download não é suportada pelo dispositivo

source: Invalid URI
de: Ungültige URI
it: URI non valido
ja: 無効な URI
pt_br: URI Inválido

source: The device could not download the firmware from the provided URI
de: Die Firmware konnte von dem Gerät nicht von der angegebenen URI heruntergeladen werden.
it: Il dispositivo non è riuscito a scaricare il firmware dall'URI fornito
ja: 指定された URI からファームウェアをデバイスにダウンロードできませんでした
pt_br: O dispositivo não pôde fazer download do firmware a partir do URI fornecido

source: Firmware Actions - Download
de: Firmwareaktionen - Herunterladen
it: Azioni firmware - Download
ja: ファームウェア操作 - ダウンロード
pt_br: Ações de Firmware - Download

source: The Download Firmware action can be initiated by using either the IoT Platform dashboard, or the REST API.
de: Die Aktion 'Firmware herunterladen' kann über das Dashboard von IoT Platform oder über die REST-API eingeleitet werden.
it: L'azione di esecuzione del download del firmware può essere iniziata utilizzando il dashboard IoT Platform o l'API REST.
ja: ファームウェアのダウンロード操作を開始するには、IoT Platform ダッシュボードまたは REST API を使用します。
pt_br: A ação de Download do Firmware pode ser iniciada usando o painel do IoT Platform ou a API REST.

source: To initiate a firmware download using the REST API, issue a POST request to:
de: Setzen Sie zum Einleiten eines Firmware-Downloads mithilfe einer REST-API eine POST-Anforderung an die folgende Adresse ab:
it: Per avviare il download del firmware utilizzando l'API REST, emettere una richiesta POST a:
ja: REST API を使用してファームウェア・ダウンロードを開始するには、POST リクエストを以下に対して発行します。
pt_br: Para iniciar um download de firmware usando a API REST, emita uma solicitação POST para:

source: The action ``firmware/download``
de: Die Aktion ``firmware/download``
it: L'azione ``firmware/download``
ja: ``firmware/download`` アクション
pt_br: A ação ``firmware/download``

source: The URI for the firmware image
de: Die URI für das Firmware-Image
it: L'URI per l'immagine del firmware
ja: ファームウェア・イメージの URI
pt_br: O URI para a imagem de firmware

source: A list of devices to receive the image, with a maximum of 5000 devices
de: Eine Liste der Geräte, die das Image empfangen sollen (maximal 5000 Geräte)
it: Un elenco di dispositivi per ricevere l'immagine, con un massimo di 5000 dispositivi
ja: イメージを受け取るデバイスのリスト (最大デバイス数 5000)
pt_br: Uma lista de dispositivos que receberão a imagem, com no máximo 5.000 dispositivos

source: Optional verifier string to validate the image
de: Optionale Verifzierungszeichenfolge zum Überprüfen des Image
it: Facoltativamente una stringa verificatore per convalidare l'immagine
ja: イメージを検証するための検証ストリング (オプション)
pt_br: Uma sequência de verificador opcional para validar a imagem

source: Optional firmware name
de: Optionaler Firmwarename
it: Nome firmware facoltativo
ja: ファームウェア名 (オプション)
pt_br: Nome de firmware opcional

source: Optional firmware version
de: Optionale Firmwareversion
it: Versione firmware facoltativo
ja: ファームウェア・バージョン (オプション)
pt_br: Versão do firmware opcional

source: Example firmware download request on which all the following example messages are based:
de: Beispielanforderung zum Download der Firmware, die die Basis aller folgenden Beispielnachrichten darstellt:
it: Richiesta di scaricamento del firmware di esempio su cui sono basati tutti i messaggi di esempio:
ja: 以下のすべてのサンプル・メッセージのベースとなるファームウェア・ダウンロード・リクエストのサンプル
pt_br: O exemplo de solicitação de download de firmware em que todas as mensagens de exemplo a seguir são baseadas:

source: The device management server in the IoT Platform uses the Device Management Protocol to send a request to the devices, initiating the firmware download. There are multiple steps:
de: Der Geräte-Management-Server von IoT Platform verwendet das Gerätemanagementprotokoll zum Senden einer Anforderung an die Geräte, die das Herunterladen der Firmware einleitet. Es sind mehrere Schritte erforderlich:
it: Il server di gestione dispositivo in IoT Platform utilizza il protocollo di gestione dispositivo per inviare una richiesta ai dispositivi iniziando il download del firmware. Ci sono diversi passaggi:
ja: IoT Platform のデバイス管理サーバーがデバイス管理プロトコルを使用してデバイスにリクエストを送信すると、ファームウェアのダウンロードが開始されます。複数のステップがあります。
pt_br: O servidor de gerenciamento de dispositivo no IoT Platform usa o Protocolo de Gerenciamento de Dispositivo para enviar uma solicitação aos dispositivos, iniciando o download do firmware. Existem várias etapas:

source: Firmware details update request sent on topic ``iotdm-1/device/update``:
de: Gesendete Aktualisierungsanforderung für Firmwaredetails an Topic ``iotdm-1/device/update``:
it: Richiesta di aggiornamento dei dettagli del firmware inviata nell'argomento ``iotdm-1/device/update``:
ja: トピック ``iotdm-1/device/update`` で送信されるファームウェア詳細更新リクエスト:
pt_br: A solicitação de atualização dos detalhes do firmware enviados no tópico ``iotdm-1/device/update``:

source: This request let the device validate if the requested firmware differs from the currently installed firmware. If there is a difference, set ``rc`` to ``204``, which translates to the status ``Changed``. The following example shows which message is to be expected for the previously sent example firmware download request and what response should be sent, when a difference is detected:
de: Diese Anforderung ermöglicht die Validierung des Geräts, falls die angeforderte Firmware von der zurzeit installierten Firmware abweicht. Bei einer Abweichung 204 als Rückgabecode festlegen, dies entspricht dem Status ``Geändert``. Das folgende Beispiel zeigt, welche Nachricht für die zuvor gesendete Beispielanforderung zum Download der Firmware zu erwarten ist und welche Antwort gesendet werden soll, wenn eine Abweichung festgestellt wird:
it: Questa richiesta consente al dispositivo di verificare se il firmware richiesto è differente dal firmware attualmente installato. Se esiste una differenza, impostare ``rc`` su ``204``, che corrisponde allo stato ``Modificato``. Il seguente esempio mostra quale messaggio è previsto per la richiesta di scaricamento del firmware di esempio inviata in precedenza e quale risposta dovrebbe essere inviata quando viene rilevata una differenza:
ja: このリクエストにより、要求されたファームウェアが現在インストールされているファームウェアと異なるかどうか、デバイスが検証します。相違がある場合は、``rc`` を ``204`` に設定します。これは ``変更済み`` 状況ということです。以下の例は、相違が検出された場合に、既に送信されたファームウェア・ダウンロード・リクエストのサンプルでどのようなメッセージが予期され、どのような応答が送信される必要があるかを示しています。
pt_br: Esta solicitação permite que o dispositivo valide se o firmware solicitado difere do firmware atualmente instalado. Se houver uma diferença, configure ``rc ` ` como ``204``, que é convertido para os status ` Alterado`. O exemplo a seguir mostra qual mensagem deve ser esperada para a solicitação de download do firmware de exemplo enviada anteriormente e qual resposta deve ser enviada, quando uma diferença for detectada:

source: This response will trigger the next request.
de: Diese Antwort löst die nächste Anforderung aus.
it: Questa risposta attiverà la successiva richiesta.
ja: この応答は次のリクエストをトリガーします。
pt_br: Esta resposta acionará o próximo pedido.

source: Observation request for firmware download status ``iotdm-1/observe``:
de: Beobachtungsanforderung für den Downloadstatus der Firmware ``iotdm-1/observe``:
it: Richiesta di osservazione per lo stato di scaricamento del firmware ``iotdm-1/observe``:
ja: ファームウェア・ダウンロード状況 ``iotdm-1/observe`` の監視リクエスト:
pt_br: Solicitação de observação para o status de download do firmware ``iotdm-1/observe``:

source: Verifies if the device is ready to start the firmware download. When the download can be started immediately, set ``rc`` to ``200`` (``Ok``), ``mgmt.firmware.state`` to ``0`` (``Idle``) and ``mgmt.firmware.updateStatus`` to ``0`` (``Idle``). Here an example exchange between the IoT Platform and device:
de: Überprüft, ob das Gerät für das Starten des Firmware-Downloads bereit ist. Wenn der Download sofort gestartet werden kann, 200 (``OK``) für den Rückgabecode, 0 (``Inaktiv``) für ``mgmt.firmware.state`` und 0 (``Inaktiv``) für ``mgmt.firmware.updateStatus`` festlegen. Beispieldatenaustausch zwischen IoT Platform und dem Gerät:
it: Verifica se il dispositivo è pronto ad avviare lo scaricamento del firmware. Quando lo scaricamento può essere avviato immediatamente, impostare ``rc`` su ``200`` (``Ok``), ``mgmt.firmware.state`` su ``0`` (``Inattivo``) e ``mgmt.firmware.updateStatus`` su ``0`` (``Inattivo``). Di seguito è riportato un esempio di scambio tra IoT Platform e un dispositivo:
ja: デバイスがファームウェア・ダウンロードを開始する準備ができているかどうかを検証します。ダウンロードをすぐに開始できる場合、``rc`` を ``200`` (``Ok``) に、``mgmt.firmware.state`` を ``0`` (``Idle``) に、``mgmt.firmware.updateStatus`` を ``0`` (``Idle``) に設定します。IoT Platform とデバイスの間の交換の例を以下に示します。
pt_br: Verifica se o dispositivo está pronto para iniciar o download do firmware. Quando o download pode ser iniciado imediatamente, configure o ``rc`` como ``200`` (``Ok``), ``mgmt.firmware.state`` como ``0`` (``Idle``) e ``mgmt.firmware.updateStatus`` como ``0`` (``Idle``). Aqui está um exemplo de troca entre o IoT Platform e o dispositivo:

source: This exchange will trigger the last step.
de: Dieser Datenaustausch löst den letzten Schritt aus.
it: Questo scambio attiverà l'ultimo passo.
ja: この交換により、最後のステップがトリガーされます。
pt_br: Essa troca acionará a última etapa.

source: Initiate the download request sent on topic ``iotdm-1/mgmt/initiate/firmware/download``:
de: Gesendete Anforderung zum Einleiten des Downloads an Topic ``iotdm-1/mgmt/initiate/firmware/download``:
it: Avviare la richiesta di download inviata nell'argomento ``iotdm-1/mgmt/initiate/firmware/download``:
ja: トピック ``iotdm-1/mgmt/initiate/firmware/download`` で送信されるダウンロード・リクエストを開始します。
pt_br: Inicie o solicitação de download enviada no tópico ``iotdm-1/mgmt/initiate/firmware/download``:

source: This request tells a device to actually start the firmware download. If the action can be initiated immediately, set ``rc`` to ``202``. Here an example:
de: Mit dieser Anforderung wird ein Gerät angewiesen, den eigentlichen Firmware-Download zu starten. Wenn die Aktion sofort eingeleitet werden kann, legen Sie für ``rc`` den Wert ``202`` fest. Beispiel:
it: Questa richiesta indica a un dispositivo di avviare lo scaricamento del firmware. Se l'azione può essere avviata immediatamente, impostare ``rc`` su ``202``. Di seguito, viene riportato un esempio:
ja: このリクエストは、ファームウェア・ダウンロードを実際に開始するようにデバイスに指示します。アクションをただちに開始できる場合は ``rc`` を ``202`` に設定します。以下に例を示します。
pt_br: Esta solicitação informa um dispositivo para iniciar o download do firmware. Se a ação pode ser iniciada imediatamente, configure o ``rc`` como ``202``. Por exemplo:

source: After a firmware download is initiated this way, the device needs to report to the IoT Platform the status of the download. This is possible by publishing a message to the ``iotdevice-1/notify``-topic, where the ``mgmt.firmware.state`` is set to either ``1`` (``Downloading``) or ``2`` (``Downloaded``). Here some examples:
de: Nachdem das Herunterladen der Firmware auf diese Weise eingeleitet wurde, muss das Gerät den Downloadstatus an IoT Platform melden. Dies wird durch das Publizieren einer Nachricht an das Topic ``iotdevice-1/notify`` ermöglicht, wobei für ``mgmt.firmware.state`` entweder ``1`` (``Download wird ausgeführt``) oder ``2`` (``Heruntergeladen``) festgelegt wird. Beispiele:
it: Una volta che il download del firmware è iniziato in questo modo, il dispositivo deve riportare a IoT Platform lo stato del download. Ciò è possibile tramite la pubblicazione di un messaggio all'argomento ``iotdevice-1/notify``, dove ``mgmt.firmware.state`` è impostato su ``1`` (``Esecuzione download``) o ``2`` (``Scaricato``). Di seguito, alcuni esempi:
ja: ファームウェアのダウンロードがこのようにして開始されたら、デバイスはダウンロードの状況を IoT Platform に報告する必要があります。これは、メッセージを ``iotdevice-1/notify`` トピックにパブリッシュすることによって行えます。この場合、``mgmt.firmware.state`` は ``1`` (``ダウンロード中``) または ``2`` (``ダウンロード済み``) に設定されます。以下にいくつかの例を示します。
pt_br: Após um download de firmware ser iniciado dessa maneira, o dispositivo precisa relatar ao IoT Platform o status do download. Isso é possível, publicando uma mensagem para ``iotdevice-1/notify``-topic, onde ``mgmt.firmware.state`` é configurado como ``1`` (``Downloading``) ou ``2`` (``Downloaded``). Seguem alguns exemplos:

source: After the notification with ``mgmt.firmware.state`` set to ``2`` was published, a request will be triggered on the ``iotdm-1/cancel``-topic, which cancels the observation of the ``mgmt.firmware`` field. After a response with ``rc`` set to ``200`` was sent the firmware download is completed. Example:
de: Nach dem Publizieren der Benachrichtigung mit der Einstellung ``2`` für ``mgmt.firmware.state`` wird eine Anforderung für das Topic ``iotdm-1/cancel`` ausgelöst, mit der die Beobachtung des Felds ``mgmt.firmware`` abgebrochen wird. Nach dem Senden einer Antwort mit dem Rückgabecode 200 ist der Firmware-Download abgeschlossen. Beispiel:
it: Una volta pubblicata la notifica con ``mgmt.firmware.state`` impostato su ``2``, verrà attivata una richiesta nell'argomento ``iotdm-1/cancel``, che annulla l'osservazione del campo ``mgmt.firmware``. Una volta inviata una risposta con ``rc`` impostato su ``200``, lo scaricamento del firmware è stato completato. Esempio:
ja: ``mgmt.firmware.state`` を ``2`` に設定した通知がパブリッシュされると、``iotdm-1/cancel`` トピックのリクエストがトリガーされ、これにより、``mgmt.firmware`` フィールドの監視がキャンセルされます。``rc`` が ``200`` に設定される応答が送信されると、ファームウェア・ダウンロードが完了します。以下に例を示します。
pt_br: Depois que a notificação com ``mgmt.firmware.state`` configurado como ``2`` é publicada, uma solicitação é acionada no ``iotdm-1/cancel``-topic, o que cancela a observação do campo ``mgmt.firmware``. Após uma resposta com ``rc`` configurado como ``200`` ter sido enviada o download do firmware é concluído. Exemplo:

source: Useful information regarding error handling:
de: Nützliche Informationen zur Fehlerbehandlung:
it: Informazioni utili sulla gestione degli errori:
ja: エラー処理に関する有用な情報:
pt_br: Informações úteis sobre manipulação de erros:

source: If ``mgmt.firmware.state`` is not ``0`` ("Idle") an error should be reported with response code ``400``, and an optional message text.-
de: Wenn ``mgmt.firmware.state`` nicht ``0`` ist ("Inaktiv"), sollte ein Fehler mit dem Antwortcode ``400`` und ein optionaler Nachrichtentext gemeldet werden.-
it: Se ``mgmt.firmware.state`` non è ``0`` ("Inattivo"), è necessario notificare un errore con codice di risposta ``400`` e un messaggio di testo facoltativo.-
ja: ``mgmt.firmware.state`` が ``0`` ("アイドル状態") でない場合は、応答コード ``400`` およびオプションのメッセージ・テキストを使用してエラーを報告する必要があります。
pt_br: Se ``mgmt.firmware.state`` não for ``0`` ("Idle") um erro deve ser relatado com o código de resposta ``400``, e um texto de mensagem opcional.-

source: If ``mgmt.firmware.uri`` is not set or is not a valid URI, set ``rc`` to ``400``.
de: Wenn für ``mgmt.firmware.uri`` kein Wert festgelegt wurde oder eine gültige URI angegeben wurde, stellen Sie für ``rc`` den Wert ``400`` ein.
it: Se ``mgmt.firmware.uri`` non è impostato o non è un URI valido, impostare ``rc`` su ``400``.
ja: ``mgmt.firmware.uri`` が未設定または無効な URI である場合は ``rc`` を ``400`` に設定します。
pt_br: Se ``mgmt.firmware.uri`` não estiver configurado ou não for um URI válido, configure ``rc`` como ``400``.

source: If firmware download attempt fails, set ``rc`` to ``500`` and optionally set ``message`` accordingly.
de: Wenn das Herunterladen der Firmware fehlschlägt, stellen Sie für ``rc`` den Wert ``500`` und optional ``message`` entsprechend ein.
it: Se il tentativo di scaricamento firmware non riesce, impostare ``rc`` su ``500`` e facoltativamente impostare ``message`` di conseguenza.
ja: ファームウェア・ダウンロードの試行に失敗した場合は、``rc`` を ``500`` に設定し、オプションで ``message`` を適切に設定します。
pt_br: Se a tentativa de download do firmware falhar, configure ``rc`` como ``500`` e, opcionalmente, configure ``message`` adequadamente.

source: If firmware download is not supported, set ``rc`` to ``501`` and optionally set ``message`` accordingly.
de: Wenn das Herunterladen der Firmware nicht unterstützt wird, stellen Sie für ``rc`` den Wert ``501`` und optional ``message`` entsprechend ein.
it: Se lo scaricamento firmware non è supportato, impostare ``rc`` su ``501`` e facoltativamente impostare ``message`` di conseguenza.
ja: ファームウェア・ダウンロードがサポートされない場合は、``rc`` を ``501`` に設定し、オプションで ``message`` を適切に設定します。
pt_br: Se o download do firmware não for suportado, configure ``rc`` como ``501`` e, opcionalmente, configure ``message`` adequadamente.

source: When an excecute request is received by the device, ``mgmt.firmware.state`` should change from ``0`` (Idle) to ``1`` (Downloading).
de: Wenn von dem Gerät eine Ausführungsanforderung empfangen wird, muss der Wert für ``mgmt.firmware.state`` von ``0`` (Inaktiv) in ``1`` (Download läuft) geändert werden.
it: Quando una richiesta di esecuzione viene ricevuta dal dispositivo, ``mgmt.firmware.state`` dovrebbe passare da ``0`` (Inattivo) a ``1`` (Scaricamento).
ja: デバイスが実行リクエストを受け取ったら、``mgmt.firmware.state`` を ``0`` (アイドル状態) から ``1`` (ダウンロード中) に変更します。
pt_br: Quando uma solicitação de execução for recebida pelo dispositivo, ``mgmt.firmware.state`` deve mudar de ``0`` (Inativo) para ``1`` (Fazendo o Download).

source: When the download has been completed successfully, ``mgmt.firmware.state`` should be set to ``2`` (Downloaded).
de: Wenn der Download erfolgreich abgeschlossen ist, muss für ``mgmt.firmware.state`` der Wert ``2`` (Heruntergeladen) eingestellt werden.
it: Quando lo scaricamento è stato completato correttamente, ``mgmt.firmware.state`` deve essere impostato su ``2`` (Scaricato).
ja: ダウンロードが正常に完了したら、``mgmt.firmware.state`` を ``2`` (ダウンロード済み) に設定します。
pt_br: Quando o download for concluído com êxito, ``mgmt.firmware.state`` deve ser configurado como ``2`` (Transferido por Download).

source: If an error occurrs during download ``mgmt.firmware.state`` should be set to ``0`` (Idle) and ``mgmt.firmware.updateStatus`` should be set to one of the error status values:
de: Wenn während des Downloads ein Fehler auftritt, muss für ``mgmt.firmware.state`` der Wert ``0`` (Inaktiv) eingestellt werden und für ``mgmt.firmware.updateStatus`` muss einer der Fehlerstatuswerte angegeben werden:
it: Se si verifica un errore durante lo scaricamento ``mgmt.firmware.state`` deve essere impostato su ``0`` (Inattivo) e ``mgmt.firmware.updateStatus`` su uno dei valori dello stato di errore:
ja: ダウンロード中にエラーが発生した場合は、``mgmt.firmware.state`` を ``0`` (アイドル状態) に設定し、``mgmt.firmware.updateStatus`` に以下のいずれかのエラー・ステータス値を設定します。
pt_br: Caso ocorra um erro durante o download, ``mgmt.firmware.state`` deve ser configurado como ``0`` (Inativo) e ``mgmt.firmware.updateStatus`` deve ser configurado com um dos valores de status de erro:

source: 2 (Out of Memory)
de: 2 (Speicherkapazität erschöpft)
it: 2 (Memoria insufficiente)
ja: 2 (メモリー不足)
pt_br: 2 (Falta de Memória)

source: 3 (Connection Lost)
de: 3 (Verbindung unterbrochen)
it: 3 (Connessione persa)
ja: 3 (接続が失われた)
pt_br: 3 (Perda de Conexão)

source: 6 (Invalid URI)
de: 6 (Ungültige URI)
it: 6 (URI non valido)
ja: 6 (無効な URI)
pt_br: 6 (URI Inválido)

source: If a firmware verifier has been set, the device should attempt to verify the firmware image. If the image verification fails, ``mgmt.firmware.state`` should be set to ``0`` (Idle) and ``mgmt.firmware.updateStatus`` should be set to the error status value ``4`` (Verification Failed).
de: Wenn eine Firmwareverifizierung festgelegt wurde, muss von dem Gerät versucht werden, das Firmware-Image zu überprüfen. Wenn die Verifizierung fehlschlägt, muss für ``mgmt.firmware.state`` der Wert ``0`` (Inaktiv) eingestellt werden und für ``mgmt.firmware.updateStatus`` muss der Fehlerstatus ``4`` (Überprüfung fehlgeschlagen) angegeben werden`.
it: Se è stato impostato un verificatore del firmware, il dispositivo deve tentare di verificare l'immagine del firmware. Se la verifica dell'immagine ha esito negativo, ``mgmt.firmware.state`` deve essere impostato su ``0`` (Inattivo) e ``mgmt.firmware.updateStatus`` deve essere impostato sul valore di stato di errore ``4`` (Verifica non riuscita).
ja: ファームウェア検証が設定されている場合、デバイスはファームウェア・イメージの検証を試みます。イメージ検証が失敗した場合は ``mgmt.firmware.state`` を ``0`` (アイドル状態) に設定し、``mgmt.firmware.updateStatus`` をエラー・ステータス値 ``4`` (検証に失敗) に設定します。
pt_br: Caso um verificador de firmware tenha sido configurado, o dispositivo deve tentar verificar a imagem de firmware. Se a verificação da imagem falhar, ``mgmt.firmware.state`` deve ser configurado como ``0`` (Inativo) e ``mgmt.firmware.updateStatus`` deve ser configurado com o valor de status de erro ``4`` (Falha na Verificação).

source: Firmware Actions - Update
de: Firmwareaktionen - Update
it: Azioni firmware - Aggiorna
ja: ファームウェア操作 - 更新
pt_br: Ações de Firmware - Atualizar

source: The firmware update action supports 2 scenarios:
de: Die Firmwareaktion 'Update' unterstützt 2 Szenarios:
it: L'azione di aggiornamento del firmware supporta 2 scenari:
ja: ファームウェア更新操作は、以下の 2 つのシナリオをサポートしています。
pt_br: A ação de atualização de firmware suporta 2 cenários:

source: Installing firmware that is already on the device from a previously completed firmware download request, or
de: Installieren der Firmware, die sich nach einer zuvor ausgeführten Firmware-Download-Anforderung bereits auf dem Gerät befindet
it: L'installazione di un firmware già presente sul dispositivo a seguito di una precedente richiesta di download del firmware completata.
ja: 過去に完了したファームウェア・ダウンロード・リクエストによって既にデバイス上に存在するファームウェアをインストールする。
pt_br: Instalando o firmware que já está no dispositivo a partir de uma solicitação de download de firmware concluída anteriormente, ou

source: Downloading and installing firmware within a single device management request.
de: Herunterladen und Installieren der Firmware mit einer einzelnen Gerätemanagementanforderung
it: Il download e l'installazione del firmware nell'ambito di una singola richiesta di gestione del dispositivo.
ja: 単一のデバイス管理リクエストでファームウェアをダウンロードしてインストールする。
pt_br: Fazendo o download e instalando o firmware dentro de uma única solicitação de gerenciamento de dispositivo.
