Repository: claudiotorresm/iotf-rtd
Catalog: docs/locale/*/LC_MESSAGES/devices/device_mgmt/requests.po
Languages: de, it, ja, pt_br

source: Device Management Requests
de: Gerätemanagementanforderungen
it: Richieste di gestione dispositivo
ja: デバイス管理リクエスト
pt_br: Solicitações de Gerenciamento de Dispositivo

source: The IoT Platform provides some actions which can be initiated against one or more devices. These actions can be initiated through the dashboard as well as by using the REST API. The available actions are split into two groups, device actions and firmware actions.
de: IoT Platform stellt eine Reihe von Aktionen bereit, die für ein oder mehrere Geräte initiiert werden können. Diese Aktionen können sowohl über das Dashboard als auch mithilfe der REST-API initiiert werden. Die verfügbaren Aktionen werden in zweit Gruppen unterteilt, Geräteaktionen und Firmwareaktionen.
it: IoT Platform fornisce alcune azioni che possono essere avviate su uno o più dispositivi. Queste azioni possono essere avviate mediante il dashboard ed utilizzando l'API REST. Le azioni disponibili sono suddivise in due gruppi, azioni dispositivo ed azioni firmware.
ja: IoT Platform は、1 つ以上のデバイスに対して開始できるいくつかのアクションを提供します。これらのアクションは、REST API だけでなく、ダッシュボードを使用して開始することもできます。使用可能なアクションは、デバイス操作とファームウェア操作の 2 つのグループに分けられます。
pt_br: A IoT Platform fornece algumas ações que podem ser iniciadas em relação a um ou mais dispositivos. Essas ações podem ser iniciadas por meio do painel, bem como usando a API REST. As ações disponíveis são divididas em dois grupos, ações de dispositivo e ações de firmware.

source: Initiating Device Management Requests through the dashboard
de: Gerätemanagementanforderungen über das Dashboard initiieren
it: Avvio delle richieste di gestione dei dispositivi tramite dashboard
ja: ダッシュボードを使用したデバイス管理リクエストの開始
pt_br: Iniciando Solicitações de gerenciamento de dispositivos usando o painel

source: Requests can be initiated through the dashboard by navigating to the Actions tab of the Devices page. The **Initiate Action** button provides a dialog for selecting an action, picking the devices to take the action against, and specifying any additional parameters that the selected action supports.
de: Sie können Anforderungen über das Dashboard initiieren, indem Sie zur Registerkarte 'Aktionen' auf der Seite 'Geräte' navigieren. Mit der Schaltfläche **Aktion initiieren** können Sie einen Dialog zur Auswahl einer Aktion aufrufen, die Geräte auswählen, für die die Aktion ausgeführt werden soll, und zusätzliche, von der jeweiligen Aktion unterstützte Parameter angeben.
it: Le richieste possono essere avviare tramite dashboard accedendo alla scheda Azioni della pagina Dispositivi. Il pulsante **Avvia azione** consente di accedere ad una finestra di dialogo per la selezione di un'azione, e del dispositivo su cui la stessa deve essere eseguita, ed inoltre di specificare eventuali parametri aggiuntivi supportati dall'azione selezionata.
ja: ダッシュボードからリクエストを開始するには、「デバイス」ページの「操作」タブにナビゲートします。「操作の開始」ボタンから開かれるダイアログで、アクションを選択し、アクションの対象にするデバイスを選択し、選択したアクションでサポートされる追加のパラメーターを指定します。
pt_br: Solicitações podem ser iniciadas com o painel navegando para a guia Ações da página Dispositivos. O botão **Iniciar ação** fornece um diálogo para selecionar uma ação, obtendo os dispositivos nos quais efetuar a ação e especificando qualquer parâmetro adicional que a ação selecionada suporta.

source: Initiating Device Management Requests using the REST API
de: Gerätemanagementanforderungen über die REST-API initiieren
it: Avvio delle richieste di gestione dei dispositivi tramite API REST
ja: REST API を使用したデバイス管理リクエストの開始
pt_br: Iniciando Solicitações de gerenciamento de dispositivos usando a API REST

source: Requests can be initiated using the following REST API:
de: Anforderungen können über die folgende REST-API initiiert werden:
it: Le richieste possono essere avviate utilizzando la seguente API REST:
ja: 以下の REST API を使用して、リクエストを開始できます。
pt_br: Solicitações podem ser iniciadas usando a seguinte API REST:

source: For more information on the request body, refer to the `API documentation <../../swagger/v0002.html>`__.
de: Weitere Informationen zum Anforderungshauptteil enthält die `API-Dokumentation <../../swagger/v0002.html>`__.
it: Per ulteriori informazioni sul corpo della richiesta, fare riferimento alla `Documentazione API <../../swagger/v0002.html>`__.
ja: リクエストの本文について詳しくは、`API の資料 <../../swagger/v0002.html>`__を参照してください。
pt_br: Para obter mais informações sobre o corpo da solicitação, consulte a `documentação de API <../../swagger/v0002.html>`__.

source: Device Actions
de: Geräteaktionen
it: Azioni dispositivo
ja: デバイス操作
pt_br: Ações do dispositivo

source: A device may specify that it supports device actions when it publishes a manage request. This indicates to the IoT Platform that the device is able to respond to device reboot and device reset actions.
de: Ein Gerät kann angeben, dass es Geräteaktionen unterstützt, wenn es eine Managementanforderung publiziert. Dadurch wird IoT Platform informiert, dass das Gerät auf Aktionen zum Neustart und zum Zurücksetzen des Geräts reagieren kann.
it: Un dispositivo può specificare che supporta azioni dispositivo quando pubblica una richiesta di gestione. Ciò indica a IoT Platform che il dispositivo è in grado di rispondere ad azioni di reimpostazione e riavvio del dispositivo.
ja: デバイスは、管理リクエストをパブリッシュするときに、デバイス操作をサポートすることを指定できます。これは、デバイスがデバイス・リブート・アクションおよびデバイス・リセット・アクションに応答できることを IoT Platform に示します。
pt_br: Um dispositivo pode especificar que suporta ações de dispositivo quando publica uma solicitação de gerenciamento. Isso indica à IoT Platform que o dispositivo pode responder a ações de reinicialização do dispositivo e de reconfiguração do dispositivo.

source: Device Actions - Reboot
de: Geräteaktionen - Neu starten
it: Azioni dispositivo - Riavvio
ja: デバイス操作 - リブート
pt_br: Ações do Dispositivo - Reinicializar

source: The reboot action can be initiated by using either the IoT Platform dashboard, or the REST API.
de: Die Aktion 'Neustart' kann über das Dashboard von IoT Platform oder über die REST-API eingeleitet werden.
it: L'azione di riavvio può essere avviata utilizzando il dashboard IoT Platform oppure l'API REST.
ja: リブート・アクションを開始するには、IoT Platform ダッシュボードまたは REST API を使用します。
pt_br: A ação de reinicialização pode ser iniciada usando o painel da IoT Platform ou a API REST.

source: To initiate a device reboot using the REST API, issue a POST request to:
de: Setzen Sie zum Einleiten eines Geräteneustarts mithilfe einer REST-API eine POST-Anforderung an die folgende Adresse ab:
it: Per riavviare il dispositivo utilizzando l'API REST, inviare una richiesta POST a :
ja: REST API を使用してデバイスのリブートを開始するには、POST リクエストを以下に対して発行します。
pt_br: Para iniciar uma reinicialização de dispositivo usando a API REST, emita uma solicitação POST para:

source: The information provided is:
de: Folgende Informationen werden bereitgestellt:
it: Le informazioni fornite sono:
ja: 指定する情報は次のとおりです。
pt_br: As informações fornecidas são:

source: The action ``device/reboot``
de: Die Aktion ``device/reboot``
it: Azione ``device/reboot``
ja: ``device/reboot`` アクション
pt_br: A ação ``device/reboot``

source: A list of devices to reboot, with a maximum of 5000 devices
de: Eine Liste der Geräte, die neu gestartet werden sollen (maximal 5000 Geräte)
it: Un elenco di dispositivi da riavviare, con un massimo di 5000 dispositivi
ja: リブートするデバイスのリスト (最大 5000 デバイス)
pt_br: Uma lista de dispositivos para reinicializar, com no máximo 5000 dispositivos

source: Example device reboot request:
de: Beispielanforderung für einen Geräteneustart:
it: Esempio di richiesta di riavvio del dispositivo:
ja: デバイスのリブート・リクエストの例:
pt_br: Solicitação de reinicialização de dispositivo de exemplo:

source: Once a request has been initiated, an MQTT message will be published to all devices specified in the request body. For each device, a response must be sent back indicating whether or not the reboot action can be initiated. If this operation can be initiated immediately, set ``rc`` to ``202``. If the reboot attempt fails, set ``rc`` to ``500`` and set the ``message`` field accordingly. If reboot is not supported, set ``rc`` to ``501`` and optionally set the ``message`` field accordingly.
de: Nachdem eine Anforderung initiiert wurde, wird eine MQTT-Nachricht an alle Geräte publiziert, die im Anforderungshauptteil angegeben sind. Für jedes Gerät muss eine Antwort zurückgesendet werden, die angibt, ob die Neustartaktion initiiert werden kann. Wenn diese Operation sofort eingeleitet werden kann, legen Sie für ``rc`` den Wert ``202`` fest. Wenn der Neustart fehlschlägt, legen Sie für ``rc`` den Wert ``500`` fest und definieren Sie das Feld ``message`` entsprechend. Wenn der Neustart nicht unterstützt wird, legen Sie für ``rc`` den Wert ``501`` fest und definieren Sie optional das Feld ``message`` entsprechend.
it: Una volta avviata una richiesta, verrà pubblicato un messaggio MQTT su tutti i dispositivi nel corpo della richiesta. È necessario che ciascun dispositivo risponda indicando se è possibile o meno avviare la richiesta di riavvio. Se questa operazione può essere avviata immediatamente, impostare ``rc`` su ``202``. Se il tentativo di riavvio ha esito negativo, impostare ``rc`` su ``500`` ed impostare il campo ``message`` di conseguenza. Se il riavvio non è supportato, impostare ``rc`` su ``501`` e, come opzione, impostare il campo ``message`` di conseguenza.
ja: リクエストが開始されると、リクエストの本文に指定されているすべてのデバイスに対して MQTT メッセージがパブリッシュされます。各デバイスは、リブート操作が開始可能かどうかを示す応答を返信する必要があります。この操作をただちに開始できる場合は、``rc`` を ``202`` に設定します。リブートの試行に失敗した場合は、``rc`` を ``500`` に設定し、``message`` フィールドを適切に設定します。リブートがサポートされない場合は、``rc`` を ``501`` に設定し、必要に応じて ``message`` フィールドを適切に設定します。
pt_br: Depois que uma solicitação é iniciada, uma mensagem MQTT é publicada para todos os dispositivos especificados no corpo da solicitação. Para cada dispositivo, uma resposta deve ser enviada novamente indicando se uma ação de reinicialização pode ou não ser iniciada. Se esta operação puder ser iniciada imediatamente, configure ``rc`` como ``202``. Se a tentativa de reinicializar falhar, configure ``rc`` como ``500`` e configure o campo ``message`` de acordo. Se a reinicialização não for suportada, configure ``rc`` como ``501`` e configure opcionalmente o campo ``message`` de acordo.

source: The reboot action is considered complete when the device sends a Manage device request following its reboot.
de: Die Neustartaktion wird als abgeschlossen betrachtet, wenn das Gerät eine 'Gerät verwalten'-Anforderung nach dem Neustart sendet.
it: L'azione di riavvio è considerata completa quando il dispositivo invia una richiesta Gestisci dispositivo dopo il riavvio.
ja: リブート・アクションは、リブート後にデバイスから「デバイスを管理」リクエストが送信された時点で完了したと見なされます。
pt_br: A ação de reinicialização é considerada concluída quando o dispositivo envia uma solicitação Gerenciar dispositivo após a reinicialização.

source: Topic
it: Argomento
ja: トピック
pt_br: Tópico

source: The server publishes this request to a device on the following topic:
de: Der Server publiziert diese Anforderung an ein Gerät mit dem folgenden Topic:
it: Il server pubblica questa richiesta su un dispositivo sul seguente argomento:
ja: サーバーはこのリクエストを次のトピックでデバイスにパブリッシュします。
pt_br: O servidor publica essa solicitação para um dispositivo no tópico a seguir:

source: Message format
de: Nachrichtenformat
it: Formato messaggio
ja: メッセージの形式
pt_br: Formato da mensagem

source: Request Format:
de: Anforderungsformat:
it: Formato richiesta:
ja: リクエストの形式:
pt_br: Formato da Solicitação:

source: Response Format:
de: Antwortformat:
it: Formato risposta:
ja: レスポンスの形式:
pt_br: Formato de Resposta:

source: Device Actions - Factory Reset
de: Geräteaktionen - Zurücksetzen auf Werkseinstellungen
it: Azioni dispositivo - Reimpostazione delle impostazioni di fabbrica
ja: デバイス操作- 工場出荷時設定へのリセット
pt_br: Ações do Dispositivo - Reconfiguração de Fábrica

source: The factory reset action can be initiated by using either the IoT Platform dashboard, or the REST API.
de: Die Aktion 'Zurücksetzen auf Werkseinstellungen' kann über das Dashboard von IoT Platform oder über die REST-API eingeleitet werden.
it: L'azione di reimpostazione delle impostazioni di fabbrica può essere avviata utilizzando il dashboard IoT Platform oppure l'API REST.
ja: 工場出荷時設定にリセット・アクションを開始するには、IoT Platform ダッシュボードまたは REST API を使用します。
pt_br: A ação de reconfiguração de fábrica pode ser iniciada usando o painel da IoT Platform ou a API REST.

source: To initiate a device factory reset using the REST API, issue a POST request to:
de: Setzen Sie zum Einleiten des Zurücksetzens auf Werkseinstellungen mithilfe einer REST-API eine POST-Anforderung an die folgende Adresse ab:
it: Per avviare la reimpostazione alle impostazioni di fabbrica del dispositivo utilizzando l'API REST, inviare una richiesta POST a :
ja: REST API を使用してデバイスの出荷時設定へのリセットを開始するには、POST リクエストを以下に対して発行します。
pt_br: Para iniciar uma reconfiguração de factory de dispositivo usando a API REST, emita uma solicitação POST para:

source: The action ``device/factoryReset``
de: Die Aktion ``device/factoryReset``
it: Azione ``device/factoryReset``
ja: ``device/factoryReset`` アクション
pt_br: A ação ``device/factoryReset``

source: A list of devices to reset, with a maximum of 5000 devices
de: Eine Liste der Geräte, die zurückgesetzt werden sollen (maximal 5000 Geräte)
it: Un elenco di dispositivi da reimpostare, con un massimo di 5000 dispositivi
ja: リセットするデバイスのリスト (最大で 5000 台のデバイス)
pt_br: Uma lista de dispositivos para reconfigurar, com no máximo 5000 dispositivos

source: Example device reset request:
de: Beispielanforderung für das Zurücksetzen des Geräts:
it: Esempio di richiesta di reimpostazione di un dispositivo:
ja: デバイス・リセット・リクエストの例:
pt_br: Solicitação de reconfiguração de dispositivo de exemplo:

source: Once a request has been initiated, an MQTT message will be published to all devices specified in the request body. For each device, a response must be sent back indicating whether or not the factory reset action can be initiated. The response code should be set to ``202`` if this action can be initiated immediately. If the factory reset attempt fails, set ``rc`` to ``500`` and set the ``message`` field accordingly. If the factory reset action is not supported, set ``rc`` to ``501`` and optionally set the ``message`` field accordingly.
de: Nachdem eine Anforderung initiiert wurde, wird eine MQTT-Nachricht an alle Geräte publiziert, die im Anforderungshauptteil angegeben sind. Für jedes Gerät muss eine Antwort zurückgesendet werden, die angibt, ob die Aktion zum Zurücksetzen auf die Werkseinstellungen initiiert werden kann. Der Antwortcode muss ``202`` lauten, wenn diese Aktion sofort initiiert werden kann. Wenn das Zurücksetzen auf Werkseinstellungen fehlschlägt, legen Sie für ``rc`` den Wert ``500`` fest und definieren Sie das Feld ``message`` entsprechend. Wenn die Aktion zum Zurücksetzen auf Werkseinstellungen nicht unterstützt wird, legen Sie für ``rc`` den Wert ``501`` fest und definieren Sie optional das Feld ``message`` entsprechend.
it: Una volta avviata una richiesta, verrà pubblicato un messaggio MQTT su tutti i dispositivi nel corpo della richiesta. È necessario che ciascun dispositivo risponda indicando se è possibile o meno avviare la richiesta di reimpostazione alle impostazioni di fabbrica. Il codice di risposta deve essere impostato su ``202`` se questa azione può essere avviata immediatamente. Se il tentativo di reimpostazione delle impostazioni di fabbrica ha esito negativo, impostare ``rc`` su ``500`` ed impostare il campo ``message`` di conseguenza. Se l'azione di reimpostazione delle impostazioni di fabbrica non è supportata, impostare ``rc`` su ``501`` e, come opzione, impostare il campo ``message`` di conseguenza.
ja: リクエストが開始されると、リクエストの本文に指定されているすべてのデバイスに対して MQTT メッセージがパブリッシュされます。各デバイスは、出荷時設定へのリセット操作が開始可能かどうかを示す応答を返信する必要があります。このアクションをただちに開始できる場合は、応答コードを ``202`` に設定します。工場出荷時設定にリセットの試行に失敗した場合は、``rc`` を ``500`` に設定し、``message`` フィールドを適切に設定します。工場出荷時設定にリセット・アクションがサポートされない場合は、``rc`` を ``501`` に設定し、必要に応じて ``message`` フィールドを適切に設定します。
pt_br: Depois que uma solicitação é iniciada, uma mensagem MQTT é publicada para todos os dispositivos especificados no corpo da solicitação. Para cada dispositivo, uma resposta deve ser enviada novamente indicando se uma ação de reconfiguração de factory pode ou não ser iniciada. O código de resposta deve ser configurado como ``202`` se esta ação puder ser iniciada imediatamente. Se a tentativa de reconfiguração de fábrica falhar, configure ``rc`` como ``500`` e configure o campo ``message`` de acordo. Se a ação de reconfiguração de fábrica não for suportada, configure ``rc`` como ``501`` e configure opcionalmente o campo ``message`` de acordo.

source: The factory reset action is considered complete when the device sends a Manage device request following its factory reset.
de: Die Aktion zum Zurücksetzen auf die Werkseinstellungen wird als abgeschlossen betrachtet, wenn das Gerät eine 'Gerät verwalten'-Anforderung nach dem Zurücksetzen sendet.
it: L'azione di reimpostazione delle impostazioni di fabbrica è considerata completa quando il dispositivo invia una richiesta Gestisci dispositivo dopo la reimpostazione alle impostazioni di fabbrica.
ja: 出荷時設定へのリセット操作は、リセット後にデバイスから「デバイスを管理」リクエストが送信された時点で完了したと見なされます。
pt_br: A ação de reconfiguração de factory é considerada concluída quando o dispositivo envia uma solicitação Gerenciar dispositivo após sua reconfiguração de factory.

source: Firmware Actions
de: Firmwareaktionen
it: Azioni firmware
ja: ファームウェア操作
pt_br: Ações de firmware

source: The firmware level currently known to be on a given device is stored in the ``deviceInfo.fwVersion`` attribute. The ``mgmt.firmware`` attributes are used to perform a firmware update and observe its status.
de: Die Firmwareversion, die momentan für ein bestimmtes Gerät angegeben wird, wird im Attribut ``deviceInfo.fwVersion`` gespeichert. Attribute des Typs ``mgmt.firmware`` werden zum Ausführen eines Firmware-Updates und Beobachten des zugehörigen Status verwendet.
it: Il livello di firmware che è noto sia presente attualmente su un dispositivo dato è memorizzato nell'attributo ``deviceInfo.fwVersion``. Gli attributi ``mgmt.firmware`` vengono utilizzati per eseguire un aggiornamento del firmware e osservarne lo stato.
ja: あるデバイスの現在既知のファームウェア・レベルは ``deviceInfo.fwVersion`` 属性に保管されます。``mgmt.firmware`` 属性を使用すると、ファームウェア更新を実行して更新状況を監視することができます。
pt_br: O nível de firmware atualmente existente em um determinado dispositivo é armazenado no atributo ``deviceInfo.fwVersion``. Os atributos ``mgmt.firmware`` são usados para executar uma atualização de firmware e observar seu status.

source: The managed device must support observation of the ``mgmt.firmware`` attribute in order to support firmware actions.
de: Von dem verwalteten Gerät muss die Beobachtung des Attributs ``mgmt.firmware`` unterstützt werden, damit Firmwareaktionen unterstützt werden.
it: Il dispositivo gestito deve supportare l'osservazione dell'attributo ``mgmt.firmware`` per poter supportare le azioni firmware.
ja: ファームウェア操作をサポートするには、管理対象デバイスが ``mgmt.firmware`` 属性の監視をサポートしている必要があります。
pt_br: O dispositivo gerenciado deve suportar a observação do atributo ``mgmt.firmware`` para que possa suportar ações de firmware.

source: The firmware update process is separated into two distinct actions, Downloading Firmware, and Updating Firmware. The status of each of these actions is stored in a separate attribute on the device. The ``mgmt.firmware.state`` attribute describes the status of the firmware download. The possible values for ``mgmt.firmware.state`` are:
de: Der Firmware-Update-Prozess untergliedert sich in zwei Aktionen: das Herunterladen der Firmware und das Aktualisieren der Firmware. Der Status für jede dieser beiden Aktionen wird in einem separaten Attribut auf dem Gerät gespeichert. Vom Attribut ``mgmt.firmware.state`` wird der Status der heruntergeladenen Firmware beschrieben. Für das Attribut ``mgmt.firmware.state`` sind folgende Werte gültig:
it: Il processo di aggiornamento del firmware è suddiviso in due azioni distinte, Scaricamento firmware e Aggiornamento firmware. Lo stato di ciascuna di queste azioni è memorizzato in un attributo separato sul dispositivo. L'attributo ``mgmt.firmware.state`` descrive lo stato dello scaricamento del firmware. I valori possibili per ``mgmt.firmware.state`` sono:
ja: ファームウェア更新プロセスは、ファームウェア・ダウンロードとファームウェア更新という 2 つの別個のアクションに分かれています。それぞれのアクションの状況が、デバイスの別々の属性に保管されます。``mgmt.firmware.state`` 属性はファームウェア・ダウンロードの状況を示します。``mgmt.firmware.state`` の取り得る値は次のとおりです。
pt_br: O processo de atualização de firmware é separado em duas ações distintas, Download do Firmware e Atualização do Firmware. O status de cada uma dessas ações é armazenado em um atributo separado no dispositivo. O atributo ``mgmt.firmware.state`` descreve o status do download do firmware. Os valores possíveis para ``mgmt.firmware.state`` são:

source: Value
de: Wert
it: Valore
ja: 値
pt_br: Valor

source: State
de: Status
it: Stato
ja: 状態
pt_br: Estado

source: Meaning
de: Bedeutung
it: Significato
ja: 意味
pt_br: Significado

source: Idle
de: Inaktiv
it: Inattivo
ja: アイドル状態
pt_br: Inativo

source: The device is currently not in the process of downloading firmware
de: Von dem Gerät wird derzeit keine Firmware heruntergeladen.
it: Il dispositivo non è correntemente nel processo di scaricamento del firmware
ja: デバイスはファームウェア・ダウンロードを現在実行していません
pt_br: O dispositivo não está atualmente no processo de download do firmware

source: Downloading
de: Download läuft
it: Scaricamento
ja: ダウンロード中
pt_br: Fazendo o Download

source: The device is currently downloading firmware
de: Von dem Gerät wird derzeit ein Firmware heruntergeladen.
it: Il dispositivo sta correntemente scaricando il firmware
ja: デバイスは現在ファームウェアをダウンロードしています
pt_br: O dispositivo está atualmente fazendo o download do firmware

source: Downloaded
de: Heruntergeladen
it: Scaricato
ja: ダウンロード済み
pt_br: Transferido por Download

source: The device has successfully downloaded a firmware update and it is ready to install
de: Das Firmware-Update wurde von dem Gerät erfolgreich heruntergeladen und kann jetzt installiert werden.
it: Il dispositivo ha correttamente scaricato un aggiornamento del firmware ed è pronto per l'installazione
ja: デバイスはファームウェア更新のダウンロードを正常に完了し、インストールできる状態にあります。
pt_br: O dispositivo fez o download com êxito de uma atualização de firmware e está pronto para a instalação

source: The ``mgmt.firmware.updateStatus`` attribute describes the status of firmware update. The possible values for ``mgmt.firmware.updateStatus`` are:
de: Vom Attribut ``mgmt.firmware.updateStatus`` wird der Status des Firmware-Updates beschrieben. Für das Attribut ``mgmt.firmware.updateStatus`` sind die folgenden Werte gültig:
it: L'attributo ``mgmt.firmware.updateStatus`` descrive lo stato dell'aggiornamento del firmware. I valori possibili per ``mgmt.firmware.updateStatus`` sono:
ja: ``mgmt.firmware.updateStatus`` 属性はファームウェア更新の状況を示します。``mgmt.firmware.updateStatus`` の有効な値は以下のとおりです。
pt_br: O atributo ``mgmt.firmware.updateStatus`` descreve o status da atualização de firmware. Os valores possíveis para ``mgmt.firmware.updateStatus`` são:

source: Success
de: Erfolg
it: Riuscito
ja: 成功
pt_br: Êxito

source: The firmware has been successfully updated
de: Die Firmware wurde erfolgreich aktualisiert.
it: Il firmware è stato aggiornato correttamente
ja: ファームウェアが正常に更新されました
pt_br: O firmware foi atualizado com êxito

source: In Progress
de: In Bearbeitung
it: In corso
ja: 進行中
pt_br: Em andamento

source: The firmware update has been initiated but is not yet complete
de: Das Firmware-Update wurde eingeleitet, ist aber noch nicht abgeschlossen.
it: L'aggiornamento del firmware è stato avviato ma non è ancora completato
ja: ファームウェア更新が開始されましたが、まだ完了していません
pt_br: A atualização de firmware foi iniciada mas ainda não foi concluída
